{
  "5609e974d4cad9f2": {
    "name": "Bitcoin",
    "symbol": "btc",
    "price": 67097,
    "livePrice": {
      "value": 67097,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bitcoin&vs_currencies=usd"
    },
    "rank": 1,
    "cap": 1340599282148,
    "addedDate": "1770987986054",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2009-01-03",
    "token": true,
    "description": "Bitcoin is the world's first decentralized cryptocurrency, created in 2009 by the pseudonymous Satoshi Nakamoto. It enables peer-to-peer electronic cash transactions without intermediaries like banks or governments, operating on a blockchain secured by Proof of Work mining and the SHA-256 cryptographic algorithm. \r\n\r\nWith a fixed supply cap of 21 million coins and programmatic halvings every four years that reduce miner rewards, Bitcoin is designed as a deflationary digital asset often called \"digital gold.\" Its value stems from solving the double-spending problem without trusted intermediaries, creating the first truly scarce digital asset with censorship resistance and permissionless access that no government, corporation, or individual can control.\r\n\r\nBitcoin operates as a decentralized peer-to-peer network where transactions are recorded on a public ledger called the blockchain, distributed across thousands of computers globally. Transactions are grouped into blocks added approximately every 10 minutes through mining, where specialized computers compete to solve complex mathematical puzzles. \r\n\r\nBitcoin has achieved mainstream adoption through multiple vectors. The January 2024 SEC approval of 11 spot Bitcoin ETFs opened Bitcoin investment to traditional finance participants, and corporations like Strategy (formerly MicroStrategy) are using Bitcoin as a treasury reserve asset to protect against currency debasement, offering MSTR holders amplified exposure to Bitcoin. \r\n\r\nThe Bitcoin ecosystem continues to evolve with innovations like Ordinals, which emerged in January 2023 to enable NFT-like functionality directly on Bitcoin, and BRC-20 tokens, an experimental standard for creating fungible tokens using Ordinal inscriptions. BTCFi (Bitcoin Finance) represents emerging financial applications extending beyond Bitcoin's traditional role, with protocols like Babylon allowing Bitcoin holders to stake BTC to secure Proof of Stake chains. ",
    "explorerLink": "https://mempool.space/",
    "address": {},
    "website": "http://www.bitcoin.org",
    "reddit": "https://www.reddit.com/r/Bitcoin/",
    "telegram": "",
    "twitter": "https://twitter.com/bitcoin",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/1/large/bitcoin.png?1696501400",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 46106506848,
    "high_24h": 68309,
    "low_24h": 65243,
    "price_change_24h": -650.03884886914,
    "price_change_percentage_24h": -0.95951,
    "market_cap_change_24h": -13766878586.407,
    "market_cap_change_percentage_24h": -1.01648,
    "circulating_supply": 19988628,
    "total_supply": 19988628,
    "max_supply": 21000000,
    "last_updated": "2026-02-13T13:06:00.502Z",
    "platforms": {}
  },
  "1f95aa0d129482be": {
    "name": "Ethereum",
    "symbol": "eth",
    "price": 1961.41,
    "livePrice": {
      "value": 1961.41,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ethereum&vs_currencies=usd"
    },
    "rank": 2,
    "cap": 236603068490,
    "addedDate": "1770988001088",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2015-07-30",
    "token": true,
    "description": "Ethereum is a global, open-source platform for decentralized applications. In other words, it is a decentralized blockchain platform that enables developers to build and deploy smart contracts and applications without central authority control. Unlike Bitcoin, which primarily functions as digital currency, Ethereum operates as a programmable global computer where developers can create any type of decentralized service. \r\n\r\nThe platform hosts over $14 billion in DeFi applications with hundreds of thousands of active users across financial protocols, NFT marketplaces, and gaming platforms. Its transition to Proof of Stake in September 2022 reduced energy consumption by over 99%, addressing environmental concerns while strengthening network security.\r\n\r\nThe network operates through thousands of independent validator nodes that process transactions and execute smart contracts on the Ethereum Virtual Machine. Smart contracts are self-executing programs written in Solidity that automatically carry out agreements when conditions are met, eliminating intermediaries like banks or brokers. \r\n\r\nValidators stake ETH as collateral to propose and validate blocks, earning rewards for honest participation while facing penalties for malicious behavior. The EIP-1559 upgrade introduced a dynamic base fee mechanism that burns ETH with each transaction, creating deflationary pressure during high network activity when more ETH is burned than issued to validators.\r\n\r\nVitalik Buterin proposed Ethereum in 2013, but seven co-founders helped build it, including Gavin Wood who created Solidity and the EVM technical specification, and Joseph Lubin who founded ConsenSys. The project launched in July 2015 after raising over $18 million through crowdfunding, quickly becoming the largest blockchain developer community. Major milestones include the 2020 Beacon Chain launch, the 2021 London hard fork implementing fee burning, and the 2022 Merge to Proof of Stake. \r\n\r\nEther (ETH) serves multiple functions: paying transaction fees (gas), staking to secure the network and earn 3-5% annual yields, serving as collateral in DeFi protocols, and purchasing NFTs and digital assets. The asset is increasingly adopted by traditional institutions, with publicly traded companies adding ETH to corporate treasuries to generate staking yields while maintaining blockchain exposure, and in 2024, the SEC approved spot Ethereum ETFs, allowing traditional investors to gain exposure through conventional brokerage accounts.\r\n\r\nEthereum's roadmap focuses on dramatically increasing transaction capacity to over 100,000 per second, reducing confirmation times, and enhancing decentralization while maintaining security against future threats like quantum computing.",
    "explorerLink": "https://etherscan.io/",
    "address": {},
    "website": "https://www.ethereum.org/",
    "reddit": "https://www.reddit.com/r/ethereum",
    "telegram": "",
    "twitter": "https://twitter.com/ethereum",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/279/large/ethereum.png?1696501628",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 18846681694,
    "high_24h": 1993.58,
    "low_24h": 1902.17,
    "price_change_24h": -16.740656150179,
    "price_change_percentage_24h": -0.84628,
    "market_cap_change_24h": -2121643444.9504,
    "market_cap_change_percentage_24h": -0.88874,
    "circulating_supply": 120692487.0205293,
    "total_supply": 120692487.0205293,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:06:16.676Z",
    "platforms": {}
  },
  "b352a57b753e200a": {
    "name": "Tether",
    "symbol": "usdt",
    "price": 0.999398,
    "livePrice": {
      "value": 0.999398,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=tether&vs_currencies=usd"
    },
    "rank": 3,
    "cap": 183779420862,
    "addedDate": "1770988016133",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange Bitfinex)\r\n\r\nThe digital coins are issued by a company called Tether Limited that is governed by the laws of the British Virgin Islands, according to the legal part of its website. It is incorporated in Hong Kong. It has emerged that Jan Ludovicus van der Velde is the CEO of cryptocurrency exchange Bitfinex, which has been accused of being involved in the price manipulation of bitcoin, as well as tether. Many people trading on exchanges, including Bitfinex, will use tether to buy other cryptocurrencies like bitcoin. Tether Limited argues that using this method to buy virtual currencies allows users to move fiat in and out of an exchange more quickly and cheaply. Also, exchanges typically have rocky relationships with banks, and using Tether is a way to circumvent that.\r\n\r\nUSDT is fairly simple to use. Once on exchanges like Poloniex or Bittrex, it can be used to purchase Bitcoin and other cryptocurrencies. It can be easily transferred from an exchange to any Omni Layer enabled wallet. Tether has no transaction fees, although external wallets and exchanges may charge one. In order to convert USDT to USD and vise versa through the Tether.to Platform, users must pay a small fee. Buying and selling Tether for Bitcoin can be done through a variety of exchanges like the ones mentioned previously or through the Tether.to platform, which also allows the conversion between USD to and from your bank account.\r\n\r\n",
    "explorerLink": "https://etherscan.io/token/0xdac17f958d2ee523a2206206994597c13d831ec7",
    "address": {
      "ethereum": "0xdac17f958d2ee523a2206206994597c13d831ec7",
      "klay-token": "0xd077a400968890eacc75cdc901f0356c943e4fdb",
      "tezos": "KT1XnTn74bUtxHfDtBmm2bGZAQfhPbvKWR8o",
      "tron": "TR7NHqjeKQxGTCi8q8ZY4pL8otSzgjLj6t",
      "solana": "Es9vMFrzaCERmJfrF4H2FYD4KCoNkY11McCe8BenwNYB",
      "near-protocol": "usdt.tether-token.near",
      "kava": "0x919c1c267bc06a7039e03fcc2ef738525769109c",
      "celo": "0x48065fbbe25f71c9282ddf5e1cd6d6a887483d5e",
      "the-open-network": "EQCxE6mUtQJKFnGfaROTKOt1lZbDiiX1kCixRv7Nw2Id_sDs",
      "avalanche": "0x9702230a8ea53601f5cd2dc00fdbc13d4df4a8c7",
      "aptos": "0x357b0b74bc833e95a115ad22604854d6b0fca151cecd94111770e5d6ffc9dc2b"
    },
    "website": "https://tether.to/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/Tether_to",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/325/large/Tether.png?1696501661",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 72325179357,
    "high_24h": 0.999939,
    "low_24h": 0.99917,
    "price_change_24h": -0.0002230710276693,
    "price_change_percentage_24h": -0.02232,
    "market_cap_change_24h": -175148805.1863,
    "market_cap_change_percentage_24h": -0.09521,
    "circulating_supply": 183898052239.9661,
    "total_supply": 189364989479.9062,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:06:43.463Z",
    "platforms": {
      "ethereum": "0xdac17f958d2ee523a2206206994597c13d831ec7",
      "klay-token": "0xd077a400968890eacc75cdc901f0356c943e4fdb",
      "tezos": "KT1XnTn74bUtxHfDtBmm2bGZAQfhPbvKWR8o",
      "tron": "TR7NHqjeKQxGTCi8q8ZY4pL8otSzgjLj6t",
      "solana": "Es9vMFrzaCERmJfrF4H2FYD4KCoNkY11McCe8BenwNYB",
      "near-protocol": "usdt.tether-token.near",
      "kava": "0x919c1c267bc06a7039e03fcc2ef738525769109c",
      "celo": "0x48065fbbe25f71c9282ddf5e1cd6d6a887483d5e",
      "the-open-network": "EQCxE6mUtQJKFnGfaROTKOt1lZbDiiX1kCixRv7Nw2Id_sDs",
      "avalanche": "0x9702230a8ea53601f5cd2dc00fdbc13d4df4a8c7",
      "aptos": "0x357b0b74bc833e95a115ad22604854d6b0fca151cecd94111770e5d6ffc9dc2b"
    }
  },
  "4ffc97ee74aae2a0": {
    "name": "XRP",
    "symbol": "xrp",
    "price": 1.36,
    "livePrice": {
      "value": 1.36,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ripple&vs_currencies=usd"
    },
    "rank": 4,
    "cap": 83094210300,
    "addedDate": "1770988031177",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Ripple is the catchall name for the cryptocurrency platform, the transactional protocol for which is actually XRP, in the same fashion as Ethereum is the name for the platform that facilitates trades in Ether. Like other cryptocurrencies, Ripple is built atop the idea of a distributed ledger network which requires various parties to participate in validating transactions, rather than any singular centralized authority. That facilitates transactions all over the world, and transfer fees are far cheaper than the likes of bitcoin. Unlike other cryptocurrencies, XRP transfers are effectively immediate, requiring no typical confirmation time.\r\n\r\nRipple was originally founded by a single company, Ripple Labs, and continues to be backed by it, rather than the larger network of developers that continue bitcoin’s development. It also doesn’t have a fluctuating amount of its currency in existence. Where bitcoin has a continually growing pool with an eventual maximum, and Ethereum theoretically has no limit, Ripple was created with all of its 100 billion XRP tokens right out of the gate. That number is maintained with no mining and most of the tokens are owned and held by Ripple Labs itself — around 60 billion at the latest count.\r\n\r\nEven at the recently reduced value of around half a dollar per XRP, that means Ripple Labs is currently sitting on around $20 billion worth of the cryptocurrency (note: Ripple’s price crashed hard recently, and may be worth far less than $60 billion by time you read this). It holds 55 billion XRP in an escrow account, which allows it to sell up to a billion per month if it so chooses in order to fund new projects and acquisitions. Selling such an amount would likely have a drastic effect on the cryptocurrency’s value, and isn’t something Ripple Labs plans to do anytime soon.\r\n\r\nIn actuality, Ripple Labs is looking to leverage the technology behind XRP to allow for faster banking transactions around the world. While Bitcoin and other cryptocurrencies are built on the idea of separating financial transactions from the financial organizations of traditional currencies, Ripple is almost the opposite in every sense.\r\n\r\nXRP by Ripple price can be found on this page alongside the market capitalization and additional stats.\r\n\r\n",
    "explorerLink": "https://xrpscan.com/",
    "address": {},
    "website": "https://ripple.com/currency/",
    "reddit": "https://www.reddit.com/r/ripple",
    "telegram": "",
    "twitter": "https://twitter.com/Ripple",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/44/large/xrp-symbol-white-128.png?1696501442",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 2330267751,
    "high_24h": 1.4,
    "low_24h": 1.35,
    "price_change_24h": -0.025401864480327,
    "price_change_percentage_24h": -1.82748,
    "market_cap_change_24h": -1588409494.28472,
    "market_cap_change_percentage_24h": -1.87572,
    "circulating_supply": 60917315351,
    "total_supply": 99985721048,
    "max_supply": 100000000000,
    "last_updated": "2026-02-13T13:06:48.517Z",
    "platforms": {}
  },
  "256a7ee77dcc1ffc": {
    "name": "BNB",
    "symbol": "bnb",
    "price": 598.96,
    "livePrice": {
      "value": 598.96,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=binancecoin&vs_currencies=usd"
    },
    "rank": 5,
    "cap": 81689762165,
    "addedDate": "1770988046221",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2017-07-08",
    "token": true,
    "description": "Binance Coin is the cryptocurrency of the Binance platform. It is a trading platform exclusively for cryptocurrencies. The name \"Binance\" is a combination of binary and finance.\r\n\r\nThus, the startup name shows that only cryptocurrencies can be traded against each other. It is not possible to trade crypto currencies against Fiat. The platform achieved an enormous success within a very short time and is focused on worldwide market with Malta headquarters. The cryptocurrency currently has a daily trading volume of 1.5 billion - 2 billion US dollars and is still increasing.\r\n\r\nIn total, there will only be 200 million BNBs. Binance uses the ERC20 token standard from Ethereum and has distributed it as follow: 50% sold on ICO, 40% to the team and 10% to Angel investors. The coin can be used to pay fees on Binance. These include trading fees, transaction fees, listing fees and others. Binance gives you a huge discount when fees are paid in BNB. \r\n\r\nThe schedule of BNB fees discount is as follow: In the first year, 50% discount on all fees, second year 25% discount, third year 12.5% discount, fourth year 6.75 % discount, and from the fifth year onwards there is no discount. This structure is used to incentivize users to buy BNB and do trades within Binance.\r\n\r\nBinance announced in a buyback plan that it would buy back up to 100 million BNB in Q1 2018. The coins are then burned. This means that they are devaluated to increase the value of the remaining coins. This benefits investors. In the future, the cryptocurrency will remain an asset on the trading platform and will be used as gas.\r\n\r\nOther tokens that are issued by exchanges include Bibox Token, OKB, Huobi Token, and more.",
    "explorerLink": "https://bscscan.com",
    "address": {
      "ethereum": "0xb8c77482e45f1f44de1745f52c74426c631bdd52"
    },
    "website": "https://www.binance.com",
    "reddit": "https://www.reddit.com/r/binance",
    "telegram": "",
    "twitter": "https://twitter.com/binance",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/825/large/bnb-icon2_2x.png?1696501970",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 1094625004,
    "high_24h": 617.76,
    "low_24h": 592.73,
    "price_change_24h": -15.3803057837338,
    "price_change_percentage_24h": -2.50354,
    "market_cap_change_24h": -2070437696.1879,
    "market_cap_change_percentage_24h": -2.47186,
    "circulating_supply": 136359389.07,
    "total_supply": 136359389.07,
    "max_supply": 200000000,
    "last_updated": "2026-02-13T13:06:00.375Z",
    "platforms": {
      "ethereum": "0xb8c77482e45f1f44de1745f52c74426c631bdd52"
    }
  },
  "aae7cb4d54e98bf6": {
    "name": "USDC",
    "symbol": "usdc",
    "price": 1,
    "livePrice": {
      "value": 1,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=usd-coin&vs_currencies=usd"
    },
    "rank": 6,
    "cap": 73107402851,
    "addedDate": "1770988061250",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "USDC is a fully collateralized US dollar stablecoin. USDC is the bridge between dollars and trading on cryptocurrency exchanges. The technology behind CENTRE makes it possible to exchange value between people, businesses and financial institutions just like email between mail services and texts between SMS providers. We believe by removing artificial economic borders, we can create a more inclusive global economy.",
    "explorerLink": "https://etherscan.io/token/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
    "address": {
      "ethereum": "0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
      "monad": "0x754704bc059f8c67012fed69bc8a327a5aafb603",
      "moonriver": "0xffffffff7d2b0b761af01ca8e25242976ac0ad7d",
      "sui": "0xdba34672e30cb065b1f93e3ab55318768fd6fef66c15942c9f7cb846e2f900e7::usdc::USDC",
      "polkadot": "1337",
      "xrp": "5553444300000000000000000000000000000000.rGm7WCVp9gb4jZHWTEtGUr4dd74z2XuWhE",
      "sonic": "0x29219dd400f2bf60e5a23d13be72b486d4038894",
      "zksync": "0x1d17cbcf0d6d143135ae902365d2e5e2a16538d4",
      "hedera-hashgraph": "0.0.456858",
      "ink": "0x2d270e6886d130d724215a266106e6832161eaed",
      "unichain": "0x078d782b760474a361dda0af3839290b0ef57ad6",
      "xdc-network": "0xfa2958cb79b0491cc627c1557f441ef849ca8eb1",
      "hyperevm": "0xb88339cb7199b77e23db6e890353e22632ba630f",
      "plume-network": "0x222365ef19f7947e5484218551b56bb3965aa7af",
      "sei-v2": "0xe15fc38f6d8c56af07bbcbe3baf5708a2bf42392",
      "near-protocol": "17208628f84f5d6ad33f0da3bbbeb27ffcb398eac501a31bd6ad2011e36133a1",
      "base": "0x833589fcd6edb6e08f4c7c32d4f71b54bda02913",
      "algorand": "31566704",
      "tron": "TEkxiTehnzSmSe2XqrBj4w32RUN966rdz8",
      "stellar": "USDC-GA5ZSEJYB37JRC5AVCIA5MOP4RHTM335X2KGX3IHOJAPP5RE34K4KZVN",
      "celo": "0xceba9300f2b948710d2653dd7b07f33a8b32118c",
      "avalanche": "0xb97ef9ef8734c71904d8002f8b6bc66dd9c48a6e",
      "world-chain": "0x79a02482a880bce3f13e09da970dc34db4cd24d1",
      "polygon-pos": "0x3c499c542cef5e3811e1192ce70d8cc03d5c3359",
      "arbitrum-one": "0xaf88d065e77c8cc2239327c5edb3a432268e5831",
      "solana": "EPjFWdd5AufqSSqeM2qN1xzybapC8G4wEGGkZwyTDt1v",
      "starknet": "0x33068f6539f8e6e6b131e6b2b814e6c34a5224bc66947c47dab9dfee93b35fb",
      "optimistic-ethereum": "0x0b2c639c533813f4aa9d7837caf62653d097ff85",
      "aptos": "0xbae207659db88bea0cbead6da0ed00aac12edcdda169e591cd41c94180b46f3b"
    },
    "website": "https://www.circle.com/en/usdc",
    "reddit": "",
    "telegram": "",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/buildoncircle",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/6319/large/USDC.png?1769615602",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 13976113189,
    "high_24h": 1,
    "low_24h": 0.999806,
    "price_change_24h": 0.00002066,
    "price_change_percentage_24h": 0.00207,
    "market_cap_change_24h": -151245436.1782,
    "market_cap_change_percentage_24h": -0.20645,
    "circulating_supply": 73113784715.18294,
    "total_supply": 73140011146.83525,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:07:11.013Z",
    "platforms": {
      "ethereum": "0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
      "monad": "0x754704bc059f8c67012fed69bc8a327a5aafb603",
      "moonriver": "0xffffffff7d2b0b761af01ca8e25242976ac0ad7d",
      "sui": "0xdba34672e30cb065b1f93e3ab55318768fd6fef66c15942c9f7cb846e2f900e7::usdc::USDC",
      "polkadot": "1337",
      "xrp": "5553444300000000000000000000000000000000.rGm7WCVp9gb4jZHWTEtGUr4dd74z2XuWhE",
      "sonic": "0x29219dd400f2bf60e5a23d13be72b486d4038894",
      "zksync": "0x1d17cbcf0d6d143135ae902365d2e5e2a16538d4",
      "hedera-hashgraph": "0.0.456858",
      "ink": "0x2d270e6886d130d724215a266106e6832161eaed",
      "unichain": "0x078d782b760474a361dda0af3839290b0ef57ad6",
      "xdc-network": "0xfa2958cb79b0491cc627c1557f441ef849ca8eb1",
      "hyperevm": "0xb88339cb7199b77e23db6e890353e22632ba630f",
      "plume-network": "0x222365ef19f7947e5484218551b56bb3965aa7af",
      "sei-v2": "0xe15fc38f6d8c56af07bbcbe3baf5708a2bf42392",
      "near-protocol": "17208628f84f5d6ad33f0da3bbbeb27ffcb398eac501a31bd6ad2011e36133a1",
      "base": "0x833589fcd6edb6e08f4c7c32d4f71b54bda02913",
      "algorand": "31566704",
      "tron": "TEkxiTehnzSmSe2XqrBj4w32RUN966rdz8",
      "stellar": "USDC-GA5ZSEJYB37JRC5AVCIA5MOP4RHTM335X2KGX3IHOJAPP5RE34K4KZVN",
      "celo": "0xceba9300f2b948710d2653dd7b07f33a8b32118c",
      "avalanche": "0xb97ef9ef8734c71904d8002f8b6bc66dd9c48a6e",
      "world-chain": "0x79a02482a880bce3f13e09da970dc34db4cd24d1",
      "polygon-pos": "0x3c499c542cef5e3811e1192ce70d8cc03d5c3359",
      "arbitrum-one": "0xaf88d065e77c8cc2239327c5edb3a432268e5831",
      "solana": "EPjFWdd5AufqSSqeM2qN1xzybapC8G4wEGGkZwyTDt1v",
      "starknet": "0x33068f6539f8e6e6b131e6b2b814e6c34a5224bc66947c47dab9dfee93b35fb",
      "optimistic-ethereum": "0x0b2c639c533813f4aa9d7837caf62653d097ff85",
      "aptos": "0xbae207659db88bea0cbead6da0ed00aac12edcdda169e591cd41c94180b46f3b"
    }
  },
  "7517027ad05f9f8b": {
    "name": "Solana",
    "symbol": "sol",
    "price": 80,
    "livePrice": {
      "value": 80,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=solana&vs_currencies=usd"
    },
    "rank": 7,
    "cap": 45428077744,
    "addedDate": "1770988076290",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Solana is a high-performance Layer 1 blockchain designed for mass adoption by providing a fast, secure, and low-cost environment for decentralized applications. It distinguishes itself by scaling globally without the use of complex sharding or multiple layers, instead maintaining a single, unified ledger to avoid liquidity fragmentation. This architecture allows it to process thousands of transactions per second with sub-second finality, often at a cost of less than a penny per transaction.\r\n\r\nThe network operates on a unique hybrid model that combines Proof of Stake with an innovation called Proof of History, which functions as a decentralized clock to timestamp transactions. This system reduces the need for constant node communication, allowing the Sealevel engine to run non-conflicting smart contracts in parallel across multiple CPU cores. Further efficiency is gained through the Gulf Stream protocol, which reduces confirmation times by forwarding transactions to validators before the current block is finished.\r\n\r\nFounded in 2017 by Anatoly Yakovenko, Solana is now supported by the Switzerland-based Solana Foundation and significant institutional investors like Andreessen Horowitz and Polychain Capital. The platform’s native token, SOL, serves as the primary currency for paying transaction fees, participating in network governance, and securing the system through staking. \r\n\r\nSolana has also seen significant institutional adoption ranging from spot Solana ETFs to major partnerships including Visa's 2025 launch of USDC settlement on the network and the tokenization of public equity by firms like Galaxy Digital.",
    "explorerLink": "https://solscan.io/",
    "address": {},
    "website": "https://solana.com/",
    "reddit": "https://www.reddit.com/r/solana",
    "telegram": "",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/4128/large/solana.png?1718769756",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 3847820439,
    "high_24h": 81.78,
    "low_24h": 76.81,
    "price_change_24h": -0.99718791471379,
    "price_change_percentage_24h": -1.23108,
    "market_cap_change_24h": -557387329.92824,
    "market_cap_change_percentage_24h": -1.21209,
    "circulating_supply": 567836957.5559984,
    "total_supply": 620256562.1360441,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:07:31.777Z",
    "platforms": {}
  },
  "4672c843c9ac33ad": {
    "name": "TRON",
    "symbol": "trx",
    "price": 0.27715,
    "livePrice": {
      "value": 0.27715,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=tron&vs_currencies=usd"
    },
    "rank": 8,
    "cap": 26255814872,
    "addedDate": "1770988091377",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2017-08-28",
    "token": true,
    "description": "What is Tron?\r\nTron's mission is to build a truly decentralized internet and aims to be the largest blockchain-based operating system in the world, known as the TRON protocol. The TRON protocol will offer high scalability, high availability, and high throughput computing to serve decentralized applications via smart contracts. Ethereum EVM-based smart contracts will be compatible and deployable on the TRON network as such Solidity developers do not have to rewrite their applications.\r\n\r\nWhy Tron?\r\nSince TRON protocol does not rely on proof of work or mining, instead governed by nodes located around the world, it is decentralized while providing high throughput for transactions on the blockchain. This is suitable for dapps that require high speed transactions especially games. There are a number of tokens already issued on the TRON network and the decentralized exchanges TRX.market has launched.\r\n\r\nOn July 24th 2018, TRON acquired BitTorrent, one of the largest P2P file sharing protocol. As a result of the acquisition, BitTorrent Token (BTT) was launched as the cryptocurrency to power the economics on the BitTorrent network. The Token will be used to inceltivize file sharing and storage within the network.\r\n",
    "explorerLink": "https://tronscan.org/",
    "address": {},
    "website": "https://tron.network",
    "reddit": "https://www.reddit.com/r/Tronix",
    "telegram": "https://t.me/tronnetworkEN",
    "twitter": "https://twitter.com/trondao",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/hqKvyAM",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/1094/large/tron-logo.png?1696502193",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 606798073,
    "high_24h": 0.280219,
    "low_24h": 0.276272,
    "price_change_24h": -0.0009187167441947,
    "price_change_percentage_24h": -0.33039,
    "market_cap_change_24h": -87329139.68091,
    "market_cap_change_percentage_24h": -0.33151,
    "circulating_supply": 94722330914.08989,
    "total_supply": 94722405953.86949,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:07:21.098Z",
    "platforms": {}
  },
  "3bba407eda0650ce": {
    "name": "Dogecoin",
    "symbol": "doge",
    "price": 0.09345,
    "livePrice": {
      "value": 0.09345,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=dogecoin&vs_currencies=usd"
    },
    "rank": 9,
    "cap": 15762638562,
    "addedDate": "1770988106419",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2013-12-08",
    "token": true,
    "description": "Dogecoin is a cryptocurrency based on the popular \"Doge\" Internet meme and features a Shiba Inu on its logo. Dogecoin is a Litecoin fork. Introduced as a \"joke currency\" on 6 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014. Compared with other cryptocurrencies, Dogecoin had a fast initial coin production schedule: 100 billion coins were in circulation by mid-2015, with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin had been mined. \r\n\r\nDogecoin was created by Billy Markus from Portland, Oregon and  Jackson Palmer from Sydney, Australia. Both wanted to create a fun cryptocurrency that will appeal beyond the core Bitcoin audience. Dogecoin is primarily used as a tipping system on Reddit and Twitter where users tip each other for creating or sharing good content. The community is very active in organising fundraising activities for deserving causes.\r\n\r\nThe developers of Dogecoin haven’t made any major changes to the coin since 2015. This means that Dogecoin could get left behind and is why Shibas are leaving Dogecoin to join more advanced platforms like Ethereum. One of Dogecoin strengths is its relaxed and fun-loving community. However, this is also a weakness because other currencies are way more professional.\r\n\r\nTo purchase Dogecoin, it involves downloading a crypto wallet, setting up a crypto exchange account and then trading away for your desired crypto currency. Once we have set up an account with a DOGE currency exchange and deposited some funds, you are ready to start trading. ",
    "explorerLink": "https://doge.tokenview.io/",
    "address": {},
    "website": "http://dogecoin.com/",
    "reddit": "https://www.reddit.com/r/dogecoin/",
    "telegram": "",
    "twitter": "https://twitter.com/dogecoin",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/5/large/dogecoin.png?1696501409",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 752237759,
    "high_24h": 0.094268,
    "low_24h": 0.090858,
    "price_change_24h": -0.00009536241614089,
    "price_change_percentage_24h": -0.10194,
    "market_cap_change_24h": 3290562,
    "market_cap_change_percentage_24h": 0.02088,
    "circulating_supply": 168669383126.5791,
    "total_supply": 168722423126.579,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:07:25.095Z",
    "platforms": {}
  },
  "a146a8060d019f99": {
    "name": "Figure Heloc",
    "symbol": "figr_heloc",
    "price": 1.041,
    "livePrice": {
      "value": 1.041,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=figure-heloc&vs_currencies=usd"
    },
    "rank": 10,
    "cap": 15730014467,
    "addedDate": "1770988121490",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "provenance",
    "launchDate": "",
    "token": true,
    "description": "This project is building the foundational protocol layer for institutional debt markets on blockchain. Powered by Provenance Blockchain, Figure Connect and Figure Markets are transforming the way loan assets are originated, traded, and settled. Figure Connect functions as a primary market for credit—standardizing and tokenizing debt assets such as HELOCs and private credit into composable on-chain formats. Figure Markets acts as a secondary trading venue, enabling 24/7 settlement of these digital loan assets through decentralized custody, with support for both crypto and fiat on/off ramps. Together, they offer an integrated protocol for real-world asset finance, with deep roots in the lending ecosystem.",
    "explorerLink": "https://explorer.provenance.io/nft/scope1qrm5d0wjzamyywvjuws6774ljmrqu8kh9x",
    "address": {
      "provenance": "scope1qrm5d0wjzamyywvjuws6774ljmrqu8kh9x"
    },
    "website": "https://www.figure.com",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/Figure",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/68480/large/figure.png?1755863954",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 132993941,
    "high_24h": 1.046,
    "low_24h": 1.027,
    "price_change_24h": -0.0039215,
    "price_change_percentage_24h": -0.37547,
    "market_cap_change_24h": -32291269.30497,
    "market_cap_change_percentage_24h": -0.20486,
    "circulating_supply": 15117692005.317,
    "total_supply": 15117692005.317,
    "max_supply": 0,
    "last_updated": "2026-02-13T08:00:07.577Z",
    "platforms": {
      "provenance": "scope1qrm5d0wjzamyywvjuws6774ljmrqu8kh9x"
    }
  },
  "78fc701d9239d85e": {
    "name": "WhiteBIT Coin",
    "symbol": "wbt",
    "price": 50.63,
    "livePrice": {
      "value": 50.63,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=whitebit&vs_currencies=usd"
    },
    "rank": 11,
    "cap": 10818691899,
    "addedDate": "1770988136568",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "What is WhiteBIT Token?\r\n\r\nWBT is a utility token of the largest European cryptocurrency exchange, WhiteBIT. The platform was established in 2018 and has already become one of the leading crypto exchanges with 3+ mln users worldwide. WhiteBIT’s goal is to contribute to the mass adoption and popularization of blockchain technologies by implementing the most effective trading and staking tools on the most convenient terms. The most popular and efficient trading orders for spot and margin trading, up to 20x leverage for margin and perpetual Bitcoin futures trading, unique passive income tools, a referral program, and the lowest trading fees on the market are only part of the functionality available on WhiteBIT. Discover the full potential of the platform at the link: https://whitebit.com/.\r\n\r\nWBT is a full-fledged product of the whole WhiteBIT ecosystem that is integrated into all WhiteBIT services, making it easier for the users to interact on the platform. WBT is a solid base for dozens of blockchain startups, new projects, and fruitful trading. Moreover, WhiteBIT Token is a reliable asset that can be used for staking on its native platform, which provides numerous perks to its holders and owners. \r\n\r\nKey advantages:\r\n\r\nincreased referral interest rate (up to 50%);\r\ndecreased trading fees; \r\nfree daily ERC-20/ETH withdrawals;\r\nfree daily AML checks; \r\nintegration with the current and future products of WhiteBIT and much more.\r\n\r\nWBT tokenomics\r\n\r\nThe token supply is limited to 400 000 000 WBT, with no new tokens to be created in the future. 200M of this amount is treasury tokens that are backing the total amount and will be unlocked within the next three months after the launch. \r\n\r\nTrading competitions, airdrops, bounties, beneficial holding programs, and access to the token from other exchange platforms are part of activities associated with the WBT cryptocurrency available on WhiteBIT. \r\n",
    "explorerLink": "https://etherscan.io/token/0x925206b8a707096ed26ae47c84747fe0bb734f59",
    "address": {
      "ethereum": "0x925206b8a707096ed26ae47c84747fe0bb734f59",
      "tron": "TFptbWaARrWTX5Yvy3gNG5Lm8BmhPx82Bt"
    },
    "website": "https://whitebit.com/wbt",
    "reddit": "",
    "telegram": "https://t.me/White_Bit",
    "twitter": "https://twitter.com/WhiteBit",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/27045/large/wbt_token.png?1696526096",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 49131089,
    "high_24h": 51.35,
    "low_24h": 49.32,
    "price_change_24h": -0.4079308315194,
    "price_change_percentage_24h": -0.79922,
    "market_cap_change_24h": -90144835.27415,
    "market_cap_change_percentage_24h": -0.82635,
    "circulating_supply": 213667339,
    "total_supply": 320167339,
    "max_supply": 400000000,
    "last_updated": "2026-02-13T13:07:54.542Z",
    "platforms": {
      "ethereum": "0x925206b8a707096ed26ae47c84747fe0bb734f59",
      "tron": "TFptbWaARrWTX5Yvy3gNG5Lm8BmhPx82Bt"
    }
  },
  "f888409460567f44": {
    "name": "Bitcoin Cash",
    "symbol": "bch",
    "price": 525.73,
    "livePrice": {
      "value": 525.73,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bitcoin-cash&vs_currencies=usd"
    },
    "rank": 12,
    "cap": 10517294387,
    "addedDate": "1770988151707",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Bitcoin Cash is a hard fork of Bitcoin with a protocol upgrade to fix on-chain capacity. Bitcoin Cash intends to be a Bitcoin without Segregated Witness (SegWit) as soft fork, where upgrades of the protocol are done mainly through hard forks and without changing the original economic rules of the Bitcoin.\r\n\r\nBitcoin Cash (BCH) is released on 1st August 2017 as an upgraded version of the original Bitcoin Core software. The main upgrade is the increase in the block size limit from 1MB to 8MB. This effectively allows miners on the BCH chain to process up to 8 times more payments per second in comparison to Bitcoin. This makes for faster, cheaper transactions and a much smoother user experience.\r\n\r\nWhy was Bitcoin Cash Created?\r\n\r\nThe main objective of Bitcoin Cash is to to bring back the essential qualities of money inherent in the original Bitcoin software. Over the years, these qualities were filtered out of Bitcoin Core and progress was stifled by various people, organizations, and companies involved in Bitcoin protocol development. The result is that Bitcoin Core is currently unusable as money due to increasingly high fees per transactions and transfer times taking hours to complete. This is all because of the 1MB limitation of Bitcoin Core’s block size, causing it unable to accommodate to large number of transactions.\r\n\r\nEssentially Bitcoin Cash is a community-activated upgrade (otherwise known as a hard fork) of Bitcoin that increased the block size to 8MB, solving the scaling issues that plague Bitcoin Core today.\r\n\r\nNov 16th 2018: A hashwar resulted in a split between Bitcoin SV and Bitcoin ABC",
    "explorerLink": "https://bch.tokenview.io/",
    "address": {},
    "website": "https://bch.info/",
    "reddit": "https://www.reddit.com/r/btc",
    "telegram": "https://t.me/bchchannel",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/780/large/bitcoin-cash-circle.png?1696501932",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 301986042,
    "high_24h": 527.57,
    "low_24h": 495.59,
    "price_change_24h": 13.732239,
    "price_change_percentage_24h": 2.68211,
    "market_cap_change_24h": 275461006,
    "market_cap_change_percentage_24h": 2.68957,
    "circulating_supply": 19994196.77165078,
    "total_supply": 19994459.27165078,
    "max_supply": 21000000,
    "last_updated": "2026-02-13T13:09:09.792Z",
    "platforms": {}
  },
  "36394139f5998c35": {
    "name": "Cardano",
    "symbol": "ada",
    "price": 0.262834,
    "livePrice": {
      "value": 0.262834,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=cardano&vs_currencies=usd"
    },
    "rank": 13,
    "cap": 9674161224,
    "addedDate": "1770988166752",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Cardano is a blockchain platform built on academic research that enables smart contracts and decentralized applications while using significantly less energy than traditional cryptocurrencies like Bitcoin. \r\n\r\nWhat sets Cardano apart is its methodical, research-driven approach — every major feature is peer-reviewed by scientists and cryptographers before being added to the network. This careful process aims to create a more secure and stable foundation compared to platforms that prioritize speed over thorough testing. The platform's native cryptocurrency, ADA, is used to send money, pay transaction fees, and participate in network governance.\r\n\r\nCardano uses a proof-of-stake system to process transactions, which works differently from Bitcoin's mining approach. Instead of competing to solve complex puzzles, users can \"stake\" their ADA — essentially locking it up temporarily — to become validators who verify transactions. The system selects validators based on how much ADA they've staked and for how long, then rewards them with additional ADA for their participation. This approach uses far less energy than traditional mining while keeping the network secure. The platform also features a two-layer design that separates basic payment transactions from smart contract operations, allowing each function to be optimized independently for better performance. \r\n\r\nADA holders can earn staking rewards by locking up their tokens to help secure the network, vote on proposed changes to the platform, and use ADA for international money transfers with lower fees than traditional services.\r\n\r\nCardano was founded in 2017 by Charles Hoskinson, who previously helped create Ethereum. Hoskinson leads Input Output Global (IOG), the technology company that builds and maintains Cardano's core software. The ecosystem operates through three organizations: IOG handles technical development, the Cardano Foundation promotes adoption and standardization, and Emurgo helps businesses integrate blockchain technology into their operations. This structure distributes responsibilities across multiple groups rather than concentrating control in a single entity. \r\n\r\nIn February 2025, major asset manager Grayscale Investments filed to create an exchange-traded fund (ETF) for Cardano with the U.S. Securities and Exchange Commission, which would allow traditional investors to buy ADA through their regular brokerage accounts without needing to set up cryptocurrency wallets.Retry",
    "explorerLink": "https://cardanoscan.io/",
    "address": {},
    "website": "https://cardano.org/",
    "reddit": "https://www.reddit.com/r/cardano",
    "telegram": "https://t.me/Cardano",
    "twitter": "https://twitter.com/Cardano_CF",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/975/large/cardano.png?1696502090",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 363789369,
    "high_24h": 0.266755,
    "low_24h": 0.258284,
    "price_change_24h": -0.001896877126315,
    "price_change_percentage_24h": -0.71653,
    "market_cap_change_24h": -52867756.262362,
    "market_cap_change_percentage_24h": -0.54351,
    "circulating_supply": 36794311012.29324,
    "total_supply": 45000000000,
    "max_supply": 45000000000,
    "last_updated": "2026-02-13T13:08:27.154Z",
    "platforms": {}
  },
  "a7140e3623c0f624": {
    "name": "USDS",
    "symbol": "usds",
    "price": 0.999919,
    "livePrice": {
      "value": 0.999919,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=usds&vs_currencies=usd"
    },
    "rank": 14,
    "cap": 9660085081,
    "addedDate": "1770988181848",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "USDS is the stablecoin of the decentralized Sky ecosystem, designed to maintain a soft peg (a value intended to stay close) to the U.S. dollar. It functions as a versatile tool for decentralized finance (DeFi), allowing value to move through the system via peer-to-peer lending and saving without a middleman. The token is 'put to work' by being supplied to various protocol modules; for example, users can convert USDS into sUSDS to earn interest from protocol revenue or lock it to receive SKY governance tokens. As the ecosystem grows, this scales through \"Sky Stars,\" which are semi-autonomous projects that expand the stablecoin’s utility into specialized areas like institutional credit and advanced lending.",
    "explorerLink": "https://etherscan.io/token/0xdc035d45d973e3ec169d2276ddab16f1e407384f",
    "address": {
      "ethereum": "0xdc035d45d973e3ec169d2276ddab16f1e407384f",
      "base": "0x820c137fa70c8691f0e44dc420a5e53c168921dc",
      "arbitrum-one": "0x6491c05a82219b8d1479057361ff1654749b876b",
      "solana": "USDSwr9ApdHk5bvJKMjzff41FfuX8bSxdKcR81vTwcA"
    },
    "website": "https://sky.money/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/SkyEcosystem",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/39926/large/usds.webp?1726666683",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 2584477,
    "high_24h": 1.001,
    "low_24h": 0.997369,
    "price_change_24h": 0.00055725,
    "price_change_percentage_24h": 0.05576,
    "market_cap_change_24h": 10271176,
    "market_cap_change_percentage_24h": 0.10644,
    "circulating_supply": 9661238971.345934,
    "total_supply": 9661238971.345934,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:09:31.018Z",
    "platforms": {
      "ethereum": "0xdc035d45d973e3ec169d2276ddab16f1e407384f",
      "base": "0x820c137fa70c8691f0e44dc420a5e53c168921dc",
      "arbitrum-one": "0x6491c05a82219b8d1479057361ff1654749b876b",
      "solana": "USDSwr9ApdHk5bvJKMjzff41FfuX8bSxdKcR81vTwcA"
    }
  },
  "cfa1da4423ef85f8": {
    "name": "LEO Token",
    "symbol": "leo",
    "price": 8.27,
    "livePrice": {
      "value": 8.27,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=leo-token&vs_currencies=usd"
    },
    "rank": 15,
    "cap": 7623777289,
    "addedDate": "1770988197007",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2019-05-20",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://eosflare.io/account/bitfinexleo1",
    "address": {
      "ethereum": "0x2af5d2ad76741191d15dfe7bf6ac92d4bd912ca3",
      "sora": "0x009e199267a6a2c8ae075bb8d4c40ee8d05c1b769085ee59ce98e50c2b2d8756"
    },
    "website": "https://www.bitfinex.com/",
    "reddit": "https://www.reddit.com/r/bitfinex/",
    "telegram": "https://t.me/bitfinex",
    "twitter": "https://twitter.com/bitfinex",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/8418/large/leo-token.png?1696508607",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 3891432,
    "high_24h": 8.53,
    "low_24h": 8.07,
    "price_change_24h": -0.186563013544148,
    "price_change_percentage_24h": -2.20507,
    "market_cap_change_24h": -171661996.352538,
    "market_cap_change_percentage_24h": -2.20208,
    "circulating_supply": 921373413.9,
    "total_supply": 985239504,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:09:52.791Z",
    "platforms": {
      "ethereum": "0x2af5d2ad76741191d15dfe7bf6ac92d4bd912ca3",
      "sora": "0x009e199267a6a2c8ae075bb8d4c40ee8d05c1b769085ee59ce98e50c2b2d8756"
    }
  },
  "c3a765290298f544": {
    "name": "Hyperliquid",
    "symbol": "hype",
    "price": 30.3,
    "livePrice": {
      "value": 30.3,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=hyperliquid&vs_currencies=usd"
    },
    "rank": 16,
    "cap": 7222960856,
    "addedDate": "1770988212238",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "hyperliquid",
    "launchDate": "",
    "token": true,
    "description": "Hyperliquid is a performant L1 optimized from the ground up. The vision is a fully onchain open financial system with user built applications interfacing with performant native components, all without compromising end user experience. \r\n\r\nThe Hyperliquid L1 is performant enough to operate an entire ecosystem of permissionless financial applications – every order, cancel, trade, and liquidation happens transparently on-chain with block latency &lt;1 second. The chain currently supports 100k orders / second.\r\n\r\nThe Hyperliquid L1 uses a custom consensus algorithm called HyperBFT which is heavily inspired by Hotstuff and its successors. Both the algorithm and networking stack are optimized from the ground up to support the L1. \r\n\r\nThe flagship native application is a fully onchain order book perpetuals exchange, the Hyperliquid DEX. Further developments include a native token standard, spot trading, permissionless liquidity, etc.",
    "explorerLink": "https://app.hyperliquid.xyz/explorer/token/0x0d01dc56dcaaca66ad901c959b4011ec",
    "address": {
      "hyperliquid": "0x0d01dc56dcaaca66ad901c959b4011ec"
    },
    "website": "https://hyperliquid.xyz/",
    "reddit": "",
    "telegram": "https://t.me/hyperliquid_announcements",
    "twitter": "https://twitter.com/HyperliquidX",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/50882/large/hyperliquid.jpg?1729431300",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 258155615,
    "high_24h": 31.37,
    "low_24h": 29.37,
    "price_change_24h": -0.53294030993451,
    "price_change_percentage_24h": -1.72866,
    "market_cap_change_24h": -124744966.43953,
    "market_cap_change_percentage_24h": -1.69774,
    "circulating_supply": 238385315.9541414,
    "total_supply": 962274028.9541414,
    "max_supply": 1000000000,
    "last_updated": "2026-02-13T13:10:03.715Z",
    "platforms": {
      "hyperliquid": "0x0d01dc56dcaaca66ad901c959b4011ec"
    }
  },
  "acea7a127c75e9b3": {
    "name": "Ethena USDe",
    "symbol": "usde",
    "price": 0.998601,
    "livePrice": {
      "value": 0.998601,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ethena-usde&vs_currencies=usd"
    },
    "rank": 18,
    "cap": 6310072419,
    "addedDate": "1770988227379",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Ethena is a delta-hedged synthetic dollar with native crypto yield derived from staking and perpetual funding rate",
    "explorerLink": "https://etherscan.io/token/0x4c9edd5852cd905f086c759e8383e09bff1e68b3",
    "address": {
      "ethereum": "0x4c9edd5852cd905f086c759e8383e09bff1e68b3",
      "plasma": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "zircuit": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "metis-andromeda": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "morph-l2": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "swellchain": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "kava": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "berachain": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "linea": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "avalanche": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "scroll": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "x-layer": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "binance-smart-chain": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "hyperevm": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "mode": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "fraxtal": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "mantle": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "the-open-network": "EQAIb6KmdfdDR7CN1GBqVJuP25iCnLKCvBlJ07Evuu2dzP5f",
      "hyperliquid": "0x2e6d84f2d7ca82e6581e03523e4389f7",
      "aptos": "0xf37a8864fe737eb8ec2c2931047047cbaed1beed3fb0e5b7c5526dafd3b9c2e9",
      "solana": "DEkqHyPN7GMRJ5cArtQFAWefqbZb33Hyf6s5iCwjEonT",
      "base": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "zksync": "0x39fe7a0dacce31bd90418e3e659fb0b5f0b3db0d",
      "manta-pacific": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "blast": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "optimistic-ethereum": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "arbitrum-one": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34"
    },
    "website": "https://app.ethena.fi/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/ethena_labs",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/33613/large/usde.png?1733810059",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 67775543,
    "high_24h": 0.999229,
    "low_24h": 0.997661,
    "price_change_24h": -0.0000636726496644,
    "price_change_percentage_24h": -0.00638,
    "market_cap_change_24h": -27904254.431261,
    "market_cap_change_percentage_24h": -0.44027,
    "circulating_supply": 6320472181.46393,
    "total_supply": 6320472181.46393,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:10:15.099Z",
    "platforms": {
      "ethereum": "0x4c9edd5852cd905f086c759e8383e09bff1e68b3",
      "plasma": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "zircuit": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "metis-andromeda": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "morph-l2": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "swellchain": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "kava": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "berachain": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "linea": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "avalanche": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "scroll": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "x-layer": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "binance-smart-chain": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "hyperevm": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "mode": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "fraxtal": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "mantle": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "the-open-network": "EQAIb6KmdfdDR7CN1GBqVJuP25iCnLKCvBlJ07Evuu2dzP5f",
      "hyperliquid": "0x2e6d84f2d7ca82e6581e03523e4389f7",
      "aptos": "0xf37a8864fe737eb8ec2c2931047047cbaed1beed3fb0e5b7c5526dafd3b9c2e9",
      "solana": "DEkqHyPN7GMRJ5cArtQFAWefqbZb33Hyf6s5iCwjEonT",
      "base": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "zksync": "0x39fe7a0dacce31bd90418e3e659fb0b5f0b3db0d",
      "manta-pacific": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "blast": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "optimistic-ethereum": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "arbitrum-one": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34"
    }
  },
  "61c6257389d4a541": {
    "name": "Monero",
    "symbol": "xmr",
    "price": 341.89,
    "livePrice": {
      "value": 341.89,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=monero&vs_currencies=usd"
    },
    "rank": 18,
    "cap": 6314296158,
    "addedDate": "1770988242419",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2014-04-18",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://monero.com/explorer",
    "address": {},
    "website": "https://getmonero.org",
    "reddit": "https://www.reddit.com/r/monero",
    "telegram": "",
    "twitter": "https://twitter.com/monero",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/69/large/monero_logo.png?1696501460",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 73236616,
    "high_24h": 343.08,
    "low_24h": 324.64,
    "price_change_24h": 1.49,
    "price_change_percentage_24h": 0.43779,
    "market_cap_change_24h": 55241688,
    "market_cap_change_percentage_24h": 0.88259,
    "circulating_supply": 18446744.07370955,
    "total_supply": 18446744.07370955,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:09:55.425Z",
    "platforms": {}
  },
  "0f46af449a42f7de": {
    "name": "Chainlink",
    "symbol": "link",
    "price": 8.43,
    "livePrice": {
      "value": 8.43,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=chainlink&vs_currencies=usd"
    },
    "rank": 19,
    "cap": 5971095391,
    "addedDate": "1770988257829",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2017-09-16",
    "token": true,
    "description": "Chainlink is the industry-standard decentralized oracle network that solves the \"oracle problem\" by connecting smart contracts with real-world data. Blockchains cannot access external information on their own, so Chainlink acts as a secure bridge, enabling smart contracts to react to real-world events using verified, tamper-proof data. It is widely considered one of the first decentralized oracle networks and is the market leader in bringing off-chain data on-chain.\r\n\r\nThe platform operates through a decentralized network of nodes that fetch, validate, and deliver data to smart contracts. When a contract requests information like a stock price, a committee of independent nodes retrieves and aggregates the data to reach consensus, then delivers a single trustworthy answer. Chainlink offers a suite of services including Data Feeds for asset prices, CCIP for cross-chain token transfers and messaging, Automation for triggering smart contract functions, and Proof of Reserve for verifying asset collateralization.\r\n\r\nChainlink has established itself as critical infrastructure for both DeFi and institutional adoption, with partnerships including Swift, Euroclear, Mastercard, UBS, ANZ, Fidelity International, and J.P. Morgan. Its institutional products include the Chainlink Runtime Environment for tokenized asset workflows, Confidential Compute for privacy-preserving computation, and the Automated Compliance Engine for embedding regulatory rules into smart contracts.\r\n\r\nThe LINK token is the native asset used to pay node operators for services, fund subscription accounts, and incentivize network security through staking. Node operators stake LINK as collateral, which can be slashed if they provide inaccurate data. Chainlink was co-founded in 2017 by Sergey Nazarov and Steve Ellis, who co-authored the white paper with Ari Juels, and raised $32 million in its September 2017 ICO.",
    "explorerLink": "https://etherscan.io/token/0x514910771af9ca656af840dff83e8264ecf986ca",
    "address": {
      "ethereum": "0x514910771af9ca656af840dff83e8264ecf986ca",
      "klay-token": "0x7311ded199cc28d80e58e81e8589aa160199fcd2",
      "bittensor": "0xf09afe78d3c7d359b334d7cb88995751f7ec5e13",
      "taiko": "0x917a3964c37993e99a47c779beb5db1e9d13804d",
      "xdc-network": "0xe27dd9bf01b55ce6803c0d81386a04212c718b95",
      "mode": "0x183e3691eff3524b2315d3703d94f922cbe51f54",
      "hydration": "asset_registry%2F1000794",
      "moonriver": "0x8b12ac23bfe11cab03a634c1f117d64a7f2cfd3e",
      "merlin-chain": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "metal-l2": "0x587d19ddf735d6b536aadb1a2a92938eb23b8d5c",
      "metis-andromeda": "0xd2fe54d1e5f568eb710ba9d898bf4bd02c7c0353",
      "ronin": "0x3902228d6a3d2dc44731fd9d45fee6a61c722d0b",
      "fantom": "0xb3654dc3d10ea7645f8319668e8f54d2574fbdc8",
      "moonbeam": "0x012414a392f9fa442a3109f1320c439c45518ac3",
      "tac": "0xc2be2f77562a6676098e8d363b9d8a33ea009d4e",
      "base": "0x88fb150bdc53a65fe94dea0c9ba0a6daf8c6e196",
      "lens": "0x6e970e8d6758164798290c8db1d79a527ca6e1b2",
      "linea": "0xa18152629128738a5c081eb226335fed4b9c95e9",
      "henesys": "0x76a443768a5e3b8d1aed0105fc250877841deb40",
      "monad": "0x6fe981dbd557f81ff66836af0932cba535cbc343",
      "huobi-token": "0x9e004545c59d359f6b7bfb06a26390b087717b42",
      "mint": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "xdai": "0xe2e73a1c69ecf83f464efce6a5be353a37ca09b2",
      "near-protocol": "514910771af9ca656af840dff83e8264ecf986ca.factory.bridge.near",
      "mantle": "0xfe36cf0b43aae49fbc5cfc5c0af22a623114e043",
      "bittensor-evm": "0xf09afe78d3c7d359b334d7cb88995751f7ec5e13",
      "rootstock": "0x938d84942f5d924070a6bb82f8e56a5e2b3098a4",
      "opbnb": "0x99f0d88b81b758ab07e22c7aba00e0121a882dea",
      "neo": "0xb25de57d73ab177fc091327bcb725154dfbb5bfb",
      "plume-network": "0xb549b375da0c76f8b3877b9adfdd28378f087a64",
      "polygon-zkevm": "0xdb7a504cf869484dd6ac5faf925c8386cbf7573d",
      "scroll": "0x548c6944cba02b9d1c0570102c89de64d258d3ac",
      "shibarium": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "soneium": "0x32d8f819c8080ae44375f8d383ffd39fc642f3ec",
      "sonic": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "superseed": "0x41ccf59e3f30eb624ef8e5ea34b2da96bee472d9",
      "unichain": "0xef66491eab4bbb582c57b14778afd8dfb70d8a1a",
      "wemix-network": "0x80f1fcdc96b55e459bf52b998abbe2c364935d69",
      "x-layer": "0x8af9711b44695a5a081f25ab9903ddb73acf8fa9",
      "zora-network": "0x3662b6f73c5560229d1a98af6e59e6649d568374",
      "abstract": "0x2ea38d6cdb6774992d4a62fe622f4405663729dd",
      "apechain": "0xf575731b78981b86d34321d875a3d25a48479be6",
      "astar": "0x31efb841d5e0b4082f7e1267dab8de1b853f2a9d",
      "berachain": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "bitlayer": "0x56b275c0ec034a229a1ded8db17089544bc276d9",
      "bob-network": "0x5ab885cda7216b163fb6f813dec1e1532516c833",
      "botanix": "0x30e85a5c9525ad9a7a0fa5c74df4baf0b01ad241",
      "bsquared-network": "0x709229d9587886a1edfee6b5ce636e1d70d1ce39",
      "celo": "0xd07294e6e917e07dfdcee882dd1e2565085c2ae0",
      "core": "0x3902228d6a3d2dc44731fd9d45fee6a61c722d0b",
      "lisk": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "corn": "0x7311ded199cc28d80e58e81e8589aa160199fcd2",
      "cronos": "0x8c80a01f461f297df7f9da3a4f740d7297c8ac85",
      "cronos-zkevm": "0x61170ca9fb9cf98d4c7d684e07be6d969d59667e",
      "etherlink": "0x8ce7618e8f8e514d13889283f58ff03b794e6cc3",
      "fraxtal": "0xd6a6ba37faac229b9665e86739ca501401f5a940",
      "sei-v2": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "katana": "0xc2c447b04e0ed3476ddbdae8e9e39be7159d27b6",
      "hemi": "0x63dbe12a6381d64ade47bc3d92abf4393dff4bc8",
      "hyperevm": "0x1ac2ee68b8d038c982c1e1f73f596927dd70de59",
      "ink": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "kroma": "0xc1f6f7622ad37c3f46cdf6f8aa0344ade80bf450",
      "hedera-hashgraph": "0x7ce6bb2cc2d3fd45a974da6a0f29236cb9513a98",
      "zircuit": "0xdee94506570ca186bc1e3516fcf4fd719c312ccd",
      "solana": "LinkhB3afbBKb2EQQu7s7umdZceV3wcvAUJhQAfQ23L",
      "osmosis": "ibc/D3327A763C23F01EC43D1F0DB3CEFEC390C362569B6FD191F40A5192F8960049",
      "hashkey-chain": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "plasma": "0x76a443768a5e3b8d1aed0105fc250877841deb40",
      "harmony-shard-0": "0x218532a12a389a4a92fc0c5fb22901d1c19198aa",
      "energi": "0x68ca48ca2626c415a89756471d4ade2cc9034008",
      "sora": "0x008484148dcf23d1b48908393e7a00d5fdc3bf81029a73eeca62a15ebfb1205a",
      "avalanche": "0x5947bb275c521040051d82396192181b413227a3",
      "milkomeda-cardano": "0xf390830df829cf22c53c8840554b98eafc5dcbc2",
      "polygon-pos": "0x53e0bca35ec356bd5dddfebbd1fc0fd03fabad39",
      "binance-smart-chain": "0xf8a0bf9cf54bb92f17374d9e9a321e6a111a51bd",
      "arbitrum-one": "0xf97f4df75117a78c1a5a0dbb814af92458539fb4",
      "blast": "0x93202ec683288a9ea75bb829c6bacfb2bfea9013",
      "world-chain": "0x915b648e994d5f31059b38223b9fbe98ae185473",
      "starknet": "0x60f47b96b525c1014fed595e87e98edc3ce0731627a0670e1804ee1a3ca0ee9",
      "optimistic-ethereum": "0x350a791bfc2c21f9ed5d10980dad2e2638ffa7f6",
      "zksync": "0x52869bae3e091e36b0915941577f2d47d8d8b534"
    },
    "website": "https://chain.link/",
    "reddit": "https://www.reddit.com/r/Chainlink/",
    "telegram": "https://t.me/chainlinkofficial",
    "twitter": "https://twitter.com/chainlink",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/877/large/Chainlink_Logo_500.png?1760023405",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 292391275,
    "high_24h": 8.55,
    "low_24h": 8.2,
    "price_change_24h": -0.059126077454769,
    "price_change_percentage_24h": -0.69643,
    "market_cap_change_24h": -37679572.000779,
    "market_cap_change_percentage_24h": -0.62708,
    "circulating_supply": 708099970.4525867,
    "total_supply": 1000000000,
    "max_supply": 1000000000,
    "last_updated": "2026-02-13T13:10:54.694Z",
    "platforms": {
      "ethereum": "0x514910771af9ca656af840dff83e8264ecf986ca",
      "klay-token": "0x7311ded199cc28d80e58e81e8589aa160199fcd2",
      "bittensor": "0xf09afe78d3c7d359b334d7cb88995751f7ec5e13",
      "taiko": "0x917a3964c37993e99a47c779beb5db1e9d13804d",
      "xdc-network": "0xe27dd9bf01b55ce6803c0d81386a04212c718b95",
      "mode": "0x183e3691eff3524b2315d3703d94f922cbe51f54",
      "hydration": "asset_registry%2F1000794",
      "moonriver": "0x8b12ac23bfe11cab03a634c1f117d64a7f2cfd3e",
      "merlin-chain": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "metal-l2": "0x587d19ddf735d6b536aadb1a2a92938eb23b8d5c",
      "metis-andromeda": "0xd2fe54d1e5f568eb710ba9d898bf4bd02c7c0353",
      "ronin": "0x3902228d6a3d2dc44731fd9d45fee6a61c722d0b",
      "fantom": "0xb3654dc3d10ea7645f8319668e8f54d2574fbdc8",
      "moonbeam": "0x012414a392f9fa442a3109f1320c439c45518ac3",
      "tac": "0xc2be2f77562a6676098e8d363b9d8a33ea009d4e",
      "base": "0x88fb150bdc53a65fe94dea0c9ba0a6daf8c6e196",
      "lens": "0x6e970e8d6758164798290c8db1d79a527ca6e1b2",
      "linea": "0xa18152629128738a5c081eb226335fed4b9c95e9",
      "henesys": "0x76a443768a5e3b8d1aed0105fc250877841deb40",
      "monad": "0x6fe981dbd557f81ff66836af0932cba535cbc343",
      "huobi-token": "0x9e004545c59d359f6b7bfb06a26390b087717b42",
      "mint": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "xdai": "0xe2e73a1c69ecf83f464efce6a5be353a37ca09b2",
      "near-protocol": "514910771af9ca656af840dff83e8264ecf986ca.factory.bridge.near",
      "mantle": "0xfe36cf0b43aae49fbc5cfc5c0af22a623114e043",
      "bittensor-evm": "0xf09afe78d3c7d359b334d7cb88995751f7ec5e13",
      "rootstock": "0x938d84942f5d924070a6bb82f8e56a5e2b3098a4",
      "opbnb": "0x99f0d88b81b758ab07e22c7aba00e0121a882dea",
      "neo": "0xb25de57d73ab177fc091327bcb725154dfbb5bfb",
      "plume-network": "0xb549b375da0c76f8b3877b9adfdd28378f087a64",
      "polygon-zkevm": "0xdb7a504cf869484dd6ac5faf925c8386cbf7573d",
      "scroll": "0x548c6944cba02b9d1c0570102c89de64d258d3ac",
      "shibarium": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "soneium": "0x32d8f819c8080ae44375f8d383ffd39fc642f3ec",
      "sonic": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "superseed": "0x41ccf59e3f30eb624ef8e5ea34b2da96bee472d9",
      "unichain": "0xef66491eab4bbb582c57b14778afd8dfb70d8a1a",
      "wemix-network": "0x80f1fcdc96b55e459bf52b998abbe2c364935d69",
      "x-layer": "0x8af9711b44695a5a081f25ab9903ddb73acf8fa9",
      "zora-network": "0x3662b6f73c5560229d1a98af6e59e6649d568374",
      "abstract": "0x2ea38d6cdb6774992d4a62fe622f4405663729dd",
      "apechain": "0xf575731b78981b86d34321d875a3d25a48479be6",
      "astar": "0x31efb841d5e0b4082f7e1267dab8de1b853f2a9d",
      "berachain": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "bitlayer": "0x56b275c0ec034a229a1ded8db17089544bc276d9",
      "bob-network": "0x5ab885cda7216b163fb6f813dec1e1532516c833",
      "botanix": "0x30e85a5c9525ad9a7a0fa5c74df4baf0b01ad241",
      "bsquared-network": "0x709229d9587886a1edfee6b5ce636e1d70d1ce39",
      "celo": "0xd07294e6e917e07dfdcee882dd1e2565085c2ae0",
      "core": "0x3902228d6a3d2dc44731fd9d45fee6a61c722d0b",
      "lisk": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "corn": "0x7311ded199cc28d80e58e81e8589aa160199fcd2",
      "cronos": "0x8c80a01f461f297df7f9da3a4f740d7297c8ac85",
      "cronos-zkevm": "0x61170ca9fb9cf98d4c7d684e07be6d969d59667e",
      "etherlink": "0x8ce7618e8f8e514d13889283f58ff03b794e6cc3",
      "fraxtal": "0xd6a6ba37faac229b9665e86739ca501401f5a940",
      "sei-v2": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "katana": "0xc2c447b04e0ed3476ddbdae8e9e39be7159d27b6",
      "hemi": "0x63dbe12a6381d64ade47bc3d92abf4393dff4bc8",
      "hyperevm": "0x1ac2ee68b8d038c982c1e1f73f596927dd70de59",
      "ink": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "kroma": "0xc1f6f7622ad37c3f46cdf6f8aa0344ade80bf450",
      "hedera-hashgraph": "0x7ce6bb2cc2d3fd45a974da6a0f29236cb9513a98",
      "zircuit": "0xdee94506570ca186bc1e3516fcf4fd719c312ccd",
      "solana": "LinkhB3afbBKb2EQQu7s7umdZceV3wcvAUJhQAfQ23L",
      "osmosis": "ibc/D3327A763C23F01EC43D1F0DB3CEFEC390C362569B6FD191F40A5192F8960049",
      "hashkey-chain": "0x71052bae71c25c78e37fd12e5ff1101a71d9018f",
      "plasma": "0x76a443768a5e3b8d1aed0105fc250877841deb40",
      "harmony-shard-0": "0x218532a12a389a4a92fc0c5fb22901d1c19198aa",
      "energi": "0x68ca48ca2626c415a89756471d4ade2cc9034008",
      "sora": "0x008484148dcf23d1b48908393e7a00d5fdc3bf81029a73eeca62a15ebfb1205a",
      "avalanche": "0x5947bb275c521040051d82396192181b413227a3",
      "milkomeda-cardano": "0xf390830df829cf22c53c8840554b98eafc5dcbc2",
      "polygon-pos": "0x53e0bca35ec356bd5dddfebbd1fc0fd03fabad39",
      "binance-smart-chain": "0xf8a0bf9cf54bb92f17374d9e9a321e6a111a51bd",
      "arbitrum-one": "0xf97f4df75117a78c1a5a0dbb814af92458539fb4",
      "blast": "0x93202ec683288a9ea75bb829c6bacfb2bfea9013",
      "world-chain": "0x915b648e994d5f31059b38223b9fbe98ae185473",
      "starknet": "0x60f47b96b525c1014fed595e87e98edc3ce0731627a0670e1804ee1a3ca0ee9",
      "optimistic-ethereum": "0x350a791bfc2c21f9ed5d10980dad2e2638ffa7f6",
      "zksync": "0x52869bae3e091e36b0915941577f2d47d8d8b534"
    }
  },
  "ee26b48a595fbb34": {
    "name": "Canton",
    "symbol": "cc",
    "price": 0.157075,
    "livePrice": {
      "value": 0.157075,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=canton-network&vs_currencies=usd"
    },
    "rank": 20,
    "cap": 5931115504,
    "addedDate": "1770988272931",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Canton Coin (CC), the network’s native utility token, was designed to reward real network usage over speculation. It aligns the success of the network with the participants who make it work, fairly rewarding app builders and app users, as well as those operating decentralized infrastructure. The result is a fundamentally different model where rewards flow to those creating value through real activity, not only miners or early investors.\r\n",
    "explorerLink": "",
    "address": {},
    "website": "https://www.canton.network/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/cantonnetwork",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/70468/large/Canton-Ticker_%281%29.png?1762826299",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 13860711,
    "high_24h": 0.169137,
    "low_24h": 0.157053,
    "price_change_24h": -0.0095515425823952,
    "price_change_percentage_24h": -5.7323,
    "market_cap_change_24h": -355969990.822273,
    "market_cap_change_percentage_24h": -5.66192,
    "circulating_supply": 37743419071.1191,
    "total_supply": 37743419071.1191,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:11:06.798Z",
    "platforms": {}
  },
  "cdb957a709ff7920": {
    "name": "USD1",
    "symbol": "usd1",
    "price": 0.998874,
    "livePrice": {
      "value": 0.998874,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=usd1-wlfi&vs_currencies=usd"
    },
    "rank": 21,
    "cap": 5327843484,
    "addedDate": "1770988288102",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "binance-smart-chain",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://bscscan.com/token/0x8d0d000ee44948fc98c9b98a4fa4921476f08b0d",
    "address": {
      "binance-smart-chain": "0x8d0d000ee44948fc98c9b98a4fa4921476f08b0d",
      "plume-network": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "ethereum": "0x8d0d000ee44948fc98c9b98a4fa4921476f08b0d",
      "solana": "USD1ttGY1N17NEEHLmELoaybftRBUSErhqYiQzvEmuB",
      "tron": "TPFqcBAaaUMCSVRCqPaQ9QnzKhmuoLR6Rc",
      "monad": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "mantle": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "morph-l2": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "aptos": "0x05fabd1b12e39967a3c24e91b7b8f67719a6dacee74f3c8b9fb7d93e855437d2"
    },
    "website": "https://www.worldlibertyfinancial.com/",
    "reddit": "",
    "telegram": "https://t.me/defiant1s",
    "twitter": "https://twitter.com/worldlibertyfi",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/54977/large/USD1_1000x1000_transparent.png?1749297002",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 1628283877,
    "high_24h": 1,
    "low_24h": 0.998432,
    "price_change_24h": -0.0004475551519771,
    "price_change_percentage_24h": -0.04479,
    "market_cap_change_24h": -45228561.899128,
    "market_cap_change_percentage_24h": -0.84176,
    "circulating_supply": 5334061488.486275,
    "total_supply": 5334061488.486275,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:11:18.202Z",
    "platforms": {
      "binance-smart-chain": "0x8d0d000ee44948fc98c9b98a4fa4921476f08b0d",
      "plume-network": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "ethereum": "0x8d0d000ee44948fc98c9b98a4fa4921476f08b0d",
      "solana": "USD1ttGY1N17NEEHLmELoaybftRBUSErhqYiQzvEmuB",
      "tron": "TPFqcBAaaUMCSVRCqPaQ9QnzKhmuoLR6Rc",
      "monad": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "mantle": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "morph-l2": "0x111111d2bf19e43c34263401e0cad979ed1cdb61",
      "aptos": "0x05fabd1b12e39967a3c24e91b7b8f67719a6dacee74f3c8b9fb7d93e855437d2"
    }
  },
  "d32b15e953d73212": {
    "name": "Stellar",
    "symbol": "xlm",
    "price": 0.15763,
    "livePrice": {
      "value": 0.15763,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=stellar&vs_currencies=usd"
    },
    "rank": 22,
    "cap": 5163124416,
    "addedDate": "1770988303380",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "The Stellar network is an open source, distributed, and community owned network used to facilitate cross-asset transfers of value. Stellar aims to help facilitate cross-asset transfer of value at a fraction of a penny while aiming to be an open financial system that gives people of all income levels access to low-cost financial services. Stellar can handle exchanges between fiat-based currencies and between cryptocurrencies. Stellar.org, the organization that supports Stellar, is centralized like XRP and meant to handle cross platform transactions and micro transactions like XRP. However, unlike Ripple, Stellar.org is non-profit and their platform itself is open source and decentralized. \r\n\r\nStellar was founded by Jed McCaleb in 2014. Jed McCaleb is also the founder of Mt. Gox and co-founder of Ripple, launched the network system Stellar with former lawyer Joyce Kim. Stellar is also a payment technology that aims to connect financial institutions and drastically reduce the cost and time required for cross-border transfers. In fact, both payment networks used the same protocol initially.\r\n\r\nDistributed Exchange\r\nThrough the use of its intermediary currency Lumens (XLM), a user can send any currency that they own to anyone else in a different currency.\r\n\r\nFor instance, if Joe wanted to send USD to Mary using her EUR, an offer is submitted to the distributed exchange selling USD for EUR. This submitted offer forms is known as an order book. The network will use the order book to find the best exchange rate for the transaction in-order to minimize the fee paid by a user.\r\n\r\nThis multi-currency transaction is possible because of \"Anchors\". Anchors are trusted entities that hold people’s deposits and can issue credit. In essence, Anchors serves as the bridge between different currencies and the Stellar network.\r\n\r\nLumens (XLM)\r\nLumens are the native asset (digital currency) that exist on the Stellar network that helps to facilitate multi-currency transactions and prevent spams. For multi-currency transactions, XLM is the digital intermediary that allows for such a transaction to occur at a low cost.\r\n\r\nIn-order to prevent DoS attacks (aka spams) that would inevitably occur on the Stellar network, a small fee of 0.00001 XLM is associated with every transaction that occurs on the network. This fee is small enough so it does not significantly affect the cost of transaction, but large enough so it dissuades bad actors from spamming the network. \r\n\r\nPrior to Protocol 12, Stellar had a built-in inflation mechanism conceived to allow account holders to collectively direct inflation-generated lumens toward projects built on Stellar.\r\n\r\nAs the network evolved and grew, it became increasingly clear that inflation wasn’t working as intended — account holders either didn’t set their inflation destination or joined inflation pools to claim the inflation themselves, and the operational costs associated with inflation payments continued to rise — and so a protocol change to disable inflation was proposed, implemented, voted on by validators, and ultimately adopted as part of a network upgrade.\r\n\r\nThe inflation operation is now deprecated.\r\nhttps://developers.stellar.org/docs/glossary/inflation/\r\n",
    "explorerLink": "https://dashboard.stellar.org/",
    "address": {},
    "website": "https://www.stellar.org/",
    "reddit": "https://www.reddit.com/r/stellar",
    "telegram": "",
    "twitter": "https://twitter.com/stellarorg",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/100/large/fmpFRHHQ_400x400.jpg?1735231350",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 99878161,
    "high_24h": 0.163324,
    "low_24h": 0.154187,
    "price_change_24h": -0.0027589866795428,
    "price_change_percentage_24h": -1.72019,
    "market_cap_change_24h": -82992791.524517,
    "market_cap_change_percentage_24h": -1.58199,
    "circulating_supply": 32746272574.54863,
    "total_supply": 50001786883.65895,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:11:30.986Z",
    "platforms": {}
  },
  "f08f5d9cec2588fa": {
    "name": "Dai",
    "symbol": "dai",
    "price": 0.99881,
    "livePrice": {
      "value": 0.99881,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=dai&vs_currencies=usd"
    },
    "rank": 23,
    "cap": 4160352315,
    "addedDate": "1770988318465",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "MakerDAO has launched Multi-collateral DAI (MCD). This token refers to the new DAI that is collaterized by multiple assets.\r\n",
    "explorerLink": "https://etherscan.io/token/0x6b175474e89094c44da98b954eedeac495271d0f",
    "address": {
      "ethereum": "0x6b175474e89094c44da98b954eedeac495271d0f"
    },
    "website": "https://makerdao.com/",
    "reddit": "https://www.reddit.com/r/MakerDAO",
    "telegram": "https://t.me/makerdaoOfficial",
    "twitter": "https://twitter.com/SkyEcosystem",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/9956/large/Badge_Dai.png?1696509996",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 129520410,
    "high_24h": 1.001,
    "low_24h": 0.998854,
    "price_change_24h": -0.0011963084924365,
    "price_change_percentage_24h": -0.11963,
    "market_cap_change_24h": -30830557.961187,
    "market_cap_change_percentage_24h": -0.73561,
    "circulating_supply": 4162058280.715531,
    "total_supply": 4162058280.715531,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:11:18.072Z",
    "platforms": {
      "ethereum": "0x6b175474e89094c44da98b954eedeac495271d0f"
    }
  },
  "44994f263f392e41": {
    "name": "Litecoin",
    "symbol": "ltc",
    "price": 53.4,
    "livePrice": {
      "value": 53.4,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=litecoin&vs_currencies=usd"
    },
    "rank": 24,
    "cap": 4106775457,
    "addedDate": "1770988333510",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2011-10-08",
    "token": true,
    "description": "Litecoin is a peer-to-peer cryptocurrency created by Charlie Lee. It was created based on the Bitcoin protocol but differs in terms of the hashing algorithm used. Litecoin uses the memory intensive Scrypt proof of work mining algorithm. Scrypt allows consumer-grade hardware such as GPU to mine those coins.\r\n\r\nWhy Litecoin?\r\nLitecoin is a cryptocurrency that has evolved from Bitcoin after its own popularity in the industry, this alternative, or ‘altcoin’ has emerged to allow investors to diversify their digital currency package, according to Investopedia. Litecoin is one of the most prominent altcoins and was created by former Google employee and Director of Engineering at Coinbase, Charlie Lee. Litecoin was the first to alter Bitcoin and the most significant difference is that it takes 2.5 minutes for Litecoin to generate a block, or transaction, in comparison to Bitcoin's 10 minutes.\r\n\r\n‘While this matters little to traders, miners who use hardware to run Bitcoin's network cannot switch over to Litecoin. This keeps bigger mining conglomerates away from Litecoin because they cannot easily optimize their profits by swapping to another coin, contributing to a more decentralized experience. Litecoin also has bigger blocks, and more coins in circulation, making it more affordable and swift when transacting,’ Investopedia explained.\r\n\r\nAs explained above, Litecoin can transact a lot faster than Bitcoin, but there are also a number of other characteristics that investors need to know before trading. Litecoin can handle higher volumes of transactions because of the capability of transacting faster and if Bitcoin attempted to transact on the scale of its altcoin, a code update would be needed. However, Litecoin’s blocks would be larger, but with more ‘orphaned blocks'. The faster block time of litecoin reduces the risk of double spending attacks - this is theoretical in the case of both networks having the same hashing power.\r\n\r\nLitecoin Technical Details:\r\nThe transaction confirmation time taken for Litecoin is about 2.5 minutes on average (as compared to Bitcoin's 10 minutes). The Litecoin network is scheduled to cap at 84 million currency units. \r\n\r\nLitecoin has inspired many other popular alternative currencies (eg. Dogecoin) because of its Scrypt hashing algorithm in order to prevent ASIC miners from mining those coins. However it is said that by the end of this year, Scrypt ASIC will enter the mass market.",
    "explorerLink": "https://chainz.cryptoid.info/ltc/",
    "address": {},
    "website": "http://litecoin.org",
    "reddit": "https://www.reddit.com/r/litecoin/",
    "telegram": "",
    "twitter": "https://twitter.com/LTCFoundation",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/2/large/litecoin.png?1696501400",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 312992643,
    "high_24h": 53.47,
    "low_24h": 51.69,
    "price_change_24h": 0.48489932,
    "price_change_percentage_24h": 0.91646,
    "market_cap_change_24h": 41084457,
    "market_cap_change_percentage_24h": 1.01052,
    "circulating_supply": 76844370.73347135,
    "total_supply": 76844370.73347135,
    "max_supply": 84000000,
    "last_updated": "2026-02-13T13:11:31.099Z",
    "platforms": {}
  },
  "64e21c856b63467e": {
    "name": "Hedera",
    "symbol": "hbar",
    "price": 0.093017,
    "livePrice": {
      "value": 0.093017,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=hedera-hashgraph&vs_currencies=usd"
    },
    "rank": 25,
    "cap": 3999361192,
    "addedDate": "1770988348555",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Hedera is a decentralized public network where developers can build secure, fair applications with near real-time consensus. The platform is owned and governed by a council of global innovators including Avery Dennison, Boeing, Deutsche Telekom, DLA Piper, FIS (WorldPay), Google, IBM, LG Electronics, Magalu, Nomura, Swirlds, Tata Communications, University College London (UCL), Wipro, and Zain Group. \r\n\r\nThe Hedera Consensus Service (HCS) acts as a trust layer for any application or permissioned network and allows for the creation of an immutable and verifiable log of messages. Application messages are submitted to the Hedera network for consensus, given a trusted timestamp, and fairly ordered. Use HCS to track assets across a supply chain, create auditable logs of events in an advertising platform, or even use it as a decentralized ordering service.\r\n\r\n",
    "explorerLink": "https://hashscan.io/",
    "address": {},
    "website": "https://www.hedera.com/",
    "reddit": "https://www.reddit.com/r/Hedera/",
    "telegram": "https://t.me/hederahashgraph",
    "twitter": "https://twitter.com/hedera",
    "insta": "",
    "youtube": "",
    "discord": "https://hedera.com/discord",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/3688/large/hbar.png?1696504364",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 108655756,
    "high_24h": 0.095681,
    "low_24h": 0.090199,
    "price_change_24h": -0.00164057570975994,
    "price_change_percentage_24h": -1.73316,
    "market_cap_change_24h": -69251229.862226,
    "market_cap_change_percentage_24h": -1.70208,
    "circulating_supply": 43003138665.58028,
    "total_supply": 50000000000,
    "max_supply": 50000000000,
    "last_updated": "2026-02-13T13:11:54.315Z",
    "platforms": {}
  },
  "edd1e1e6413e9072": {
    "name": "PayPal USD",
    "symbol": "pyusd",
    "price": 0.999955,
    "livePrice": {
      "value": 0.999955,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=paypal-usd&vs_currencies=usd"
    },
    "rank": 26,
    "cap": 3945126515,
    "addedDate": "1770988363656",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "PayPal USD is designed to contribute to the opportunity stablecoins offer for payments and is 100% backed by U.S. dollar deposits, short-term U.S Treasuries and similar cash equivalents. PayPal USD is redeemable 1:1 for U.S. dollars and is issued by Paxos Trust Company.",
    "explorerLink": "https://etherscan.io/token/0x6c3ea9036406852006290770bedfcaba0e23a0e8",
    "address": {
      "ethereum": "0x6c3ea9036406852006290770bedfcaba0e23a0e8",
      "stellar": "PYUSD-GDQE7IXJ4HUHV6RQHIUPRJSEZE4DRS5WY577O2FY6YQ5LVWZ7JZTU2V5",
      "solana": "2b1kV6DkPAnxd5ixfnxCpjxmKwqjjaYmCZfHsFu24GXo",
      "arbitrum-one": "0x46850ad61c2b7d64d08c9c754f45254596696984"
    },
    "website": "https://www.paypal.com/us/digital-wallet/manage-money/crypto/pyusd",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/PayPal",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/31212/large/PYUSD_Token_Logo_2x.png?1765987788",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 197273439,
    "high_24h": 1.001,
    "low_24h": 0.998524,
    "price_change_24h": 0.00075172,
    "price_change_percentage_24h": 0.07523,
    "market_cap_change_24h": 30079804,
    "market_cap_change_percentage_24h": 0.76831,
    "circulating_supply": 3945797501.382978,
    "total_supply": 3945187312.062978,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:12:39.962Z",
    "platforms": {
      "ethereum": "0x6c3ea9036406852006290770bedfcaba0e23a0e8",
      "stellar": "PYUSD-GDQE7IXJ4HUHV6RQHIUPRJSEZE4DRS5WY577O2FY6YQ5LVWZ7JZTU2V5",
      "solana": "2b1kV6DkPAnxd5ixfnxCpjxmKwqjjaYmCZfHsFu24GXo",
      "arbitrum-one": "0x46850ad61c2b7d64d08c9c754f45254596696984"
    }
  },
  "a3c7eceffa330b34": {
    "name": "Zcash",
    "symbol": "zec",
    "price": 233.74,
    "livePrice": {
      "value": 233.74,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=zcash&vs_currencies=usd"
    },
    "rank": 27,
    "cap": 3861696124,
    "addedDate": "1770988378737",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2016-10-28",
    "token": true,
    "description": "Zcash is a privacy-focused cryptocurrency that uses trustless zero-knowledge proofs to enable fully encrypted transactions while maintaining blockchain transparency and security. It was the first cryptocurrency to implement zero-knowledge encryption for private peer-to-peer payments, addressing the fundamental privacy gap in traditional cryptocurrencies that expose transaction details publicly. \r\n\r\nWith a fixed supply of 21 million ZEC and a halving schedule similar to Bitcoin, Zcash allows users to prove transactions are valid without revealing sensitive information like wallet balances, transaction amounts, or participant identities, making it suitable for everyday payments, long-term savings, and cross-border money transfers where financial confidentiality matters.\r\n\r\nThe protocol operates on its own blockchain currently using Proof-of-Work consensus, though it's evolving toward Proof-of-Stake through the planned \"Crosslink\" upgrade to enhance security, scalability, and energy efficiency. Zcash employs trustless zero-knowledge proofs (Halo) within its Orchard shielded pool to verify transactions without revealing sender, receiver, or amount information. \r\n\r\nUsers can choose between transparent public transactions and shielded private transactions through Unified Addresses, which work with both types. The network is faster and cheaper than Bitcoin, with new blocks mined every 75 seconds and transaction fees typically just a fraction of a cent. Privacy adoption has surged in 2025, with over 30% of total ZEC supply now held in fully shielded pools.\r\n\r\nZcash was created by a group of scientists in 2013 who initially proposed Zerocoin as a privacy extension to Bitcoin before building a standalone protocol. The ecosystem operates with a self-funded development model where block rewards support independent teams through the Zcash Community Grants Committee and a new Coinholder-Controlled Fund.",
    "explorerLink": "https://zecblockexplorer.com/",
    "address": {
      "near-protocol": "zec.omft.near"
    },
    "website": "https://z.cash/",
    "reddit": "https://www.reddit.com/r/zec",
    "telegram": "https://t.me/Zcash_Community",
    "twitter": "https://twitter.com/zcash",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/486/large/circle-zcash-color.png?1696501740",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 288683593,
    "high_24h": 238.91,
    "low_24h": 228.95,
    "price_change_24h": -4.5598006728651,
    "price_change_percentage_24h": -1.91351,
    "market_cap_change_24h": -75092331.197616,
    "market_cap_change_percentage_24h": -1.90745,
    "circulating_supply": 16511426.7280448,
    "total_supply": 16511426.7280448,
    "max_supply": 21000000,
    "last_updated": "2026-02-13T13:12:21.510Z",
    "platforms": {
      "near-protocol": "zec.omft.near"
    }
  },
  "0f935fdd9ac468e2": {
    "name": "Avalanche",
    "symbol": "avax",
    "price": 8.86,
    "livePrice": {
      "value": 8.86,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=avalanche-2&vs_currencies=usd"
    },
    "rank": 28,
    "cap": 3825503383,
    "addedDate": "1770988393775",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Avalanche is a high throughput smart contract blockchain platform. Validators secure the network through a proof-of-stake consensus protocol. It is said to be fast, low cost, and environmental friendly.",
    "explorerLink": "https://snowtrace.io/",
    "address": {},
    "website": "https://www.avax.network",
    "reddit": "https://www.reddit.com/r/Avax",
    "telegram": "https://t.me/avalancheavax",
    "twitter": "https://twitter.com/avax",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/avax",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12559/large/Avalanche_Circle_RedWhite_Trans.png?1696512369",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 257608749,
    "high_24h": 8.95,
    "low_24h": 8.65,
    "price_change_24h": 0.02811408,
    "price_change_percentage_24h": 0.31847,
    "market_cap_change_24h": 15131838,
    "market_cap_change_percentage_24h": 0.39712,
    "circulating_supply": 431771961.1772119,
    "total_supply": 463441061.1772119,
    "max_supply": 720000000,
    "last_updated": "2026-02-13T13:12:55.769Z",
    "platforms": {}
  },
  "40566cc17bce6086": {
    "name": "Shiba Inu",
    "symbol": "shib",
    "price": 0.00000609,
    "livePrice": {
      "value": 0.00000609,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=shiba-inu&vs_currencies=usd"
    },
    "rank": 29,
    "cap": 3589945177,
    "addedDate": "1770988408901",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Shiba Inu (SHIB) is a meme token which began as a fun currency and has now transformed into a decentralized ecosystem. During the initial launch, 50% of the supply was allocated into Vitalik Buterin's ethereum wallet. \r\n\r\nAs a result of that, Vitalik proceeded to donate 10% of his SHIB holdings to a COVID-19 relief effort in India and the remaining 40% is burnt forever. That donation was worth about $1 billion at that time, which makes it one of the largest donation ever in the world.\r\n\r\nWhat is the Shiba Inu community working on right now? The Shiba Inu team launched a decentralized exchange called Shibaswap with 2 new tokens, LEASH and BONE. LEASH is a scarce supply token that is used to offer incentives on Shibaswap. BONE is the governance token for holders to vote on proposals on Doggy DAO.",
    "explorerLink": "https://etherscan.io/token/0x95ad61b0a150d79219dcf64e1e6cc01f0b64c4ce",
    "address": {
      "ethereum": "0x95ad61b0a150d79219dcf64e1e6cc01f0b64c4ce"
    },
    "website": "https://shibatoken.com/",
    "reddit": "https://www.reddit.com/r/SHIBArmy/",
    "telegram": "https://t.me/ShibaInu_Dogecoinkiller",
    "twitter": "https://twitter.com/shibarium_",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/shibatoken",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/11939/large/shiba.png?1696511800",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 134762642,
    "high_24h": 0.00000618,
    "low_24h": 0.00000595,
    "price_change_24h": -2.5799818117e-8,
    "price_change_percentage_24h": -0.42216,
    "market_cap_change_24h": -1464992.730103,
    "market_cap_change_percentage_24h": -0.04079,
    "circulating_supply": 589243880917864.1,
    "total_supply": 589500418093313.5,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:13:24.148Z",
    "platforms": {
      "ethereum": "0x95ad61b0a150d79219dcf64e1e6cc01f0b64c4ce"
    }
  },
  "3e3d01d000257a7c": {
    "name": "Sui",
    "symbol": "sui",
    "price": 0.920925,
    "livePrice": {
      "value": 0.920925,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=sui&vs_currencies=usd"
    },
    "rank": 30,
    "cap": 3544958917,
    "addedDate": "1770988423943",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "sui",
    "launchDate": "",
    "token": true,
    "description": "Sui is an innovative layer-1 blockchain platform crafted to meet the demands of global adoption, providing a secure, robust, and scalable development environment. Rooted in a unique object-centric data model and fortified by the trusted Move programming language, Sui is engineered to tackle the inefficiencies found in current blockchain frameworks.\r\n\r\nIn addition to its solid technical underpinnings, Sui places a strong emphasis on user experience, aiming to remove common barriers encountered in blockchain interactions. Through groundbreaking features such as zkLogin, sponsored transactions, and programmable transaction blocks, Sui sets a new standard for user accessibility and friendliness within Web3 applications.\r\n\r\nUnique elements of Sui\r\nSui’s innovative architecture ensures swift transactions with stable fees and high throughput through horizontal scaling. Its object-oriented design offers deep composability for developers, enabling tailored object types with network-wide compatibility. This revolutionizes asset and protocol collaboration, fostering product innovation.\r\n\r\nThe platform's object-oriented approach dramatically improves transaction processing, enabling parallel execution and faster completion times. Additionally, unique consensus requirements expedite transaction finalization while maintaining stability. Sui prioritizes overcoming Web3 adoption barriers, offering native tools like zkLogin and sponsored transactions for wallet onboarding and fee management.\r\n\r\nMove integration into Sui's data model combines innovation with security, mitigating common exploits found in smart contract languages. This empowers developers and users with a secure and intuitive platform, accelerating the evolution of Web3 applications.\r\n\r\nAbout the Sui token\r\nThe SUI token serves four primary functions within the Sui ecosystem:\r\nProof-of-stake participation - Sui implements a delegated proof-of-stake mechanism, rewarding honest behavior by validators and SUI token holders who stake with them.\r\nGas fee payments - SUI tokens cover gas fees for executing transactions and storing data onchain.\r\nApplication utility - SUI is a versatile asset, integral to various applications within Sui’s ecosystem, including decentralized exchanges, lending platforms, gaming, and more.\r\nGovernance - The SUI token empowers holders to participate in on-chain voting on significant matters like protocol upgrades and platform changes, shaping the future of Sui.\r\n\r\nAdditionally, the Sui storage fund ensures fair compensation for validators by distributing stake rewards over time and covering storage costs for previously stored on-chain data. This tokenomic strategy promotes indefinite data storage while maintaining fair compensation for validators, fostering long-term sustainability.\r\n",
    "explorerLink": "https://suiscan.xyz/mainnet/home",
    "address": {
      "sui": "0x0000000000000000000000000000000000000000000000000000000000000002::sui::SUI"
    },
    "website": "https://sui.io/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/SuiNetwork",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/sui",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/26375/large/sui-ocean-square.png?1727791290",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 519768248,
    "high_24h": 0.933483,
    "low_24h": 0.895652,
    "price_change_24h": -0.0087362303204232,
    "price_change_percentage_24h": -0.93972,
    "market_cap_change_24h": -32448895.917416,
    "market_cap_change_percentage_24h": -0.90705,
    "circulating_supply": 3846172527.429665,
    "total_supply": 10000000000,
    "max_supply": 10000000000,
    "last_updated": "2026-02-13T13:13:14.507Z",
    "platforms": {
      "sui": "0x0000000000000000000000000000000000000000000000000000000000000002::sui::SUI"
    }
  },
  "c5457f949566f39a": {
    "name": "Toncoin",
    "symbol": "ton",
    "price": 1.43,
    "livePrice": {
      "value": 1.43,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=the-open-network&vs_currencies=usd"
    },
    "rank": 31,
    "cap": 3505258599,
    "addedDate": "1770988438972",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "the-open-network",
    "launchDate": "",
    "token": true,
    "description": "TON (The Open Network) is a general-purpose blockchain that allows developers to build decentralized apps and tokens.",
    "explorerLink": "https://tonviewer.com/EQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM9c",
    "address": {
      "the-open-network": "EQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM9c",
      "ethereum": "0x582d872a1b094fc48f5de31d3b73f2d9be47def1",
      "binance-smart-chain": "0x76a797a59ba2c17726896976b7b3747bfd1d220f"
    },
    "website": "https://ton.org/",
    "reddit": "",
    "telegram": "https://t.me/toncoin",
    "twitter": "https://twitter.com/ton_blockchain",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/17980/large/photo_2024-09-10_17.09.00.jpeg?1725963446",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 88888934,
    "high_24h": 1.43,
    "low_24h": 1.36,
    "price_change_24h": 0.057295,
    "price_change_percentage_24h": 4.17472,
    "market_cap_change_24h": 141365540,
    "market_cap_change_percentage_24h": 4.20244,
    "circulating_supply": 2448684648.960621,
    "total_supply": 5154016187.349006,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:13:04.108Z",
    "platforms": {
      "the-open-network": "EQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM9c",
      "ethereum": "0x582d872a1b094fc48f5de31d3b73f2d9be47def1",
      "binance-smart-chain": "0x76a797a59ba2c17726896976b7b3747bfd1d220f"
    }
  },
  "c5dcc8669a1eabc6": {
    "name": "Rain",
    "symbol": "rain",
    "price": 0.00984303,
    "livePrice": {
      "value": 0.00984303,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=rain&vs_currencies=usd"
    },
    "rank": 32,
    "cap": 3356455570,
    "addedDate": "1770988454134",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "arbitrum-one",
    "launchDate": "",
    "token": true,
    "description": "Rain is a decentralized options protocol built on Arbitrum. It enables anyone to create and trade custom markets without restrictions, offering a permissionless framework for prediction and options trading. Public markets are resolved using Olympus AI’s oracle agent, while private markets allow creators to act as resolvers. The protocol supports secondary trading, account abstraction for smoother user experience, and a deflationary token model where 2.5% of trading volume is allocated to buy and burn the $RAIN token. Governance of the protocol is carried out by token holders through a DAO.",
    "explorerLink": "https://arbiscan.io/token/0x25118290e6A5f4139381D072181157035864099d",
    "address": {
      "arbitrum-one": "0x25118290e6a5f4139381d072181157035864099d"
    },
    "website": "https://rain.one",
    "reddit": "",
    "telegram": "https://t.me/+9y2TtrFRYEA2OGFk",
    "twitter": "https://twitter.com/rain__protocol",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/69134/large/Rain_logo_1_.png?1762952191",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 30881805,
    "high_24h": 0.01023562,
    "low_24h": 0.00971306,
    "price_change_24h": -0.000368328256773452,
    "price_change_percentage_24h": -3.60704,
    "market_cap_change_24h": -110956228.785985,
    "market_cap_change_percentage_24h": -3.19997,
    "circulating_supply": 339869379279.3642,
    "total_supply": 1149929332673.051,
    "max_supply": 1150000000000,
    "last_updated": "2026-02-13T13:14:06.227Z",
    "platforms": {
      "arbitrum-one": "0x25118290e6a5f4139381d072181157035864099d"
    }
  },
  "fcc148cb82838834": {
    "name": "Cronos",
    "symbol": "cro",
    "price": 0.076721,
    "livePrice": {
      "value": 0.076721,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=crypto-com-chain&vs_currencies=usd"
    },
    "rank": 33,
    "cap": 3062466965,
    "addedDate": "1770988469179",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2018-11-14",
    "token": true,
    "description": "Cronos is an institutional-grade, high-performance, EVM-compatible Layer-1 blockchain built on the Cosmos SDK and integrated with the Inter-Blockchain Communication (IBC) protocol, designed as the backbone for open, compliant, and AI-accessible tokenized markets. It supports up to 60,000 transactions per second (TPS), 500ms block times, instant finality, and sub-$0.01 fees via Proof of Authority consensus. ",
    "explorerLink": "https://etherscan.io/token/0xa0b73e1ff0b80914ab6fe0444e65848c4c34450b",
    "address": {
      "ethereum": "0xa0b73e1ff0b80914ab6fe0444e65848c4c34450b"
    },
    "website": "https://cronos.org/",
    "reddit": "",
    "telegram": "https://t.me/Cronos_POS_Announcements",
    "twitter": "https://twitter.com/cronos_chain",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/cronos",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/7310/large/cro_token_logo.png?1696507599",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 15187741,
    "high_24h": 0.078559,
    "low_24h": 0.075801,
    "price_change_24h": -0.00136534430329773,
    "price_change_percentage_24h": -1.7485,
    "market_cap_change_24h": -47997349.826974,
    "market_cap_change_percentage_24h": -1.54309,
    "circulating_supply": 39859666110.33913,
    "total_supply": 98392948775.05241,
    "max_supply": 100000000000,
    "last_updated": "2026-02-13T13:14:12.083Z",
    "platforms": {
      "ethereum": "0xa0b73e1ff0b80914ab6fe0444e65848c4c34450b"
    }
  },
  "4e1be173cd5e3dac": {
    "name": "World Liberty Financial",
    "symbol": "wlfi",
    "price": 0.101411,
    "livePrice": {
      "value": 0.101411,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=world-liberty-financial&vs_currencies=usd"
    },
    "rank": 34,
    "cap": 2760342389,
    "addedDate": "1770988484285",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etherscan.io/token/0xdA5e1988097297dCdc1f90D4dFE7909e847CBeF6",
    "address": {
      "ethereum": "0xda5e1988097297dcdc1f90d4dfe7909e847cbef6",
      "solana": "WLFinEv6ypjkczcS83FZqFpgFZYwQXutRbxGe7oC16g",
      "binance-smart-chain": "0x47474747477b199288bf72a1d702f7fe0fb1deea"
    },
    "website": "https://www.worldlibertyfinancial.com/",
    "reddit": "",
    "telegram": "https://t.me/defiant1s",
    "twitter": "https://twitter.com/worldlibertyfi",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/50767/large/wlfi.png?1756438915",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 126727720,
    "high_24h": 0.109642,
    "low_24h": 0.100541,
    "price_change_24h": -0.0058252223368046,
    "price_change_percentage_24h": -5.43215,
    "market_cap_change_24h": -160023032.145443,
    "market_cap_change_percentage_24h": -5.47956,
    "circulating_supply": 27243802538.151154,
    "total_supply": 100000000000,
    "max_supply": 100000000000,
    "last_updated": "2026-02-13T13:14:42.690Z",
    "platforms": {
      "ethereum": "0xda5e1988097297dcdc1f90d4dfe7909e847cbef6",
      "solana": "WLFinEv6ypjkczcS83FZqFpgFZYwQXutRbxGe7oC16g",
      "binance-smart-chain": "0x47474747477b199288bf72a1d702f7fe0fb1deea"
    }
  },
  "5711cf68b1dfd2a2": {
    "name": "Tether Gold",
    "symbol": "xaut",
    "price": 4945.3,
    "livePrice": {
      "value": 4945.3,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=tether-gold&vs_currencies=usd"
    },
    "rank": 35,
    "cap": 2571994715,
    "addedDate": "1770988500785",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Each XAU₮ token represents ownership of one troy fine ounce of physical gold on a specific gold bar. XAU₮, which is available as an ERC-20 token on the Ethereum blockchain and as a TRC20 token on the TRON blockchain, can be transferred to any on-chain address from the purchasers’ Tether wallet. Furthermore, Tether Gold (XAU₮) is the only product among the competition that offers zero custody fees and has direct control over the physical gold storage, safely held in a Switzerland vault, adopting best in class security and anti-threat measures. Today, Tether Gold (XAU₮) is the best way to hold Gold. ",
    "explorerLink": "https://etherscan.io/token/0x68749665ff8d2d112fa859aa293f07a622782f38",
    "address": {
      "ethereum": "0x68749665ff8d2d112fa859aa293f07a622782f38"
    },
    "website": "https://gold.tether.to/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/tethergold",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/10481/large/Tether_Gold.png?1696510471",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 640714880,
    "high_24h": 5053.93,
    "low_24h": 4883.92,
    "price_change_24h": -87.972306800016,
    "price_change_percentage_24h": -1.74781,
    "market_cap_change_24h": -42798724.01774,
    "market_cap_change_percentage_24h": -1.63679,
    "circulating_supply": 519825.641699,
    "total_supply": 712747.089,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:14:53.957Z",
    "platforms": {
      "ethereum": "0x68749665ff8d2d112fa859aa293f07a622782f38"
    }
  },
  "b50be96e6663b5ab": {
    "name": "MemeCore",
    "symbol": "m",
    "price": 1.4,
    "livePrice": {
      "value": 1.4,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=memecore&vs_currencies=usd"
    },
    "rank": 36,
    "cap": 2427041667,
    "addedDate": "1770988516782",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "MemeCore is the first Layer 1 blockchain, built for Meme 2.0 — a new paradigm where meme coins transcend speculation to become engines of culture, value, and community coordination. In this new era, memes are not just content — they are currency, governance, and creative expression.\r\n\r\nMission\r\nTo structure and sustain the meme viral economy, empowering anyone to launch tokens, earn from cultural contributions, and build openly in a decentralized, meme-native environment.\r\n\r\nVision\r\nMemeCore envisions a world where meme coins are vehicles of shared ownership and viral innovation. Every social post, meme remix, and on-chain action becomes a part of an economic feedback loop — fueling a participatory ecosystem where culture is capital.",
    "explorerLink": "https://memecorescan.io/",
    "address": {
      "binance-smart-chain": "0x22b1458e780f8fa71e2f84502cee8b5a3cc731fa"
    },
    "website": "https://memecore.com/",
    "reddit": "",
    "telegram": "https://t.me/MemeCoreLabs",
    "twitter": "https://twitter.com/MemeCore_ORG",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/memecore",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/53247/large/square-bg-transparent.png?1752637478",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 8822612,
    "high_24h": 1.49,
    "low_24h": 1.4,
    "price_change_24h": -0.015879061240786,
    "price_change_percentage_24h": -1.12257,
    "market_cap_change_24h": -28313643.038226,
    "market_cap_change_percentage_24h": -1.15314,
    "circulating_supply": 1735232870.09116,
    "total_supply": 5335217481.119927,
    "max_supply": 10000000000,
    "last_updated": "2026-02-13T13:15:14.913Z",
    "platforms": {
      "binance-smart-chain": "0x22b1458e780f8fa71e2f84502cee8b5a3cc731fa"
    }
  },
  "88e4a064b036a594": {
    "name": "PAX Gold",
    "symbol": "paxg",
    "price": 4974.02,
    "livePrice": {
      "value": 4974.02,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=pax-gold&vs_currencies=usd"
    },
    "rank": 37,
    "cap": 2284037542,
    "addedDate": "1770988531901",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "PAX Gold (PAXG) is an asset-backed token where one token should represent one fine troy ounce of a London Good Delivery gold bar, stored in professional vault facilities. Anyone who owns PAXG has ownership rights to that gold under the custody of Paxos Trust Company. Since PAXG represents physical gold, its value is tied directly to the real-time market value of that physical gold.\r\n\r\nPAXG gives customers the benefits of actual physical ownership of specific gold bars with the speed and mobility of a digital asset. Customers are able to have fractional ownership of physical bars. On the Paxos platform, customers can convert their tokens to allocated gold, unallocated gold, or fiat currency (and vice versa) quickly and efficiently, reducing their exposure to settlement risk. PAXG is also available for trading on Paxos’ itBit exchange. PAXG will also be available on other crypto-asset exchanges, wallets, lending platforms and elsewhere within the crypto ecosystem. \r\n\r\nAt any time, PAXG holders can lookup the serial number, value and physical characteristics of their vaulted gold just by entering their Ethereum wallet address on the PAXG lookup tool on Paxos.com/paxgold.",
    "explorerLink": "https://etherscan.io/token/0x45804880de22913dafe09f4980848ece6ecbaf78",
    "address": {
      "ethereum": "0x45804880de22913dafe09f4980848ece6ecbaf78"
    },
    "website": "https://www.paxos.com/paxgold/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/paxosglobal",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/9519/large/paxgold.png?1696509604",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 400247838,
    "high_24h": 5086.98,
    "low_24h": 4910.32,
    "price_change_24h": -99.272730338733,
    "price_change_percentage_24h": -1.95677,
    "market_cap_change_24h": -40517071.276574,
    "market_cap_change_percentage_24h": -1.743,
    "circulating_supply": 459009.975,
    "total_supply": 459009.975,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:15:24.563Z",
    "platforms": {
      "ethereum": "0x45804880de22913dafe09f4980848ece6ecbaf78"
    }
  },
  "79ac2f4fa4206604": {
    "name": "Polkadot",
    "symbol": "dot",
    "price": 1.27,
    "livePrice": {
      "value": 1.27,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=polkadot&vs_currencies=usd"
    },
    "rank": 38,
    "cap": 2122118398,
    "addedDate": "1770988546942",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Polkadot is a platform that allows diverse blockchains to transfer messages, including value, in a trust-free fashion; sharing their unique features while pooling their security. In brief, Polkadot is a scalable heterogeneous multi-chain technology.\r\n\r\nPolkadot is heterogeneous because it is entirely flexible and makes no assumption about the nature or structure of the chains in the network. Even non-blockchain systems or data structures can become parachains if they fulfill a set of criteria.\r\n\r\nPolkadot may be considered equivalent to a set of independent chains (e.g. a set containing Ethereum, Ethereum Classic, Namecoin and Bitcoin) except with important additions: pooled security and trust-free interchain transactability.\r\n\r\nMany of the native parachains of Polkadot will be written using a Polkadot Runtime Environment SDK (e.g. Parity Technologies' Substrate).",
    "explorerLink": "https://polkadot.subscan.io/",
    "address": {
      "ethereum": "0x196c20da81fbc324ecdf55501e95ce9f0bd84d14",
      "binance-smart-chain": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8",
      "base": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8",
      "optimistic-ethereum": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8",
      "arbitrum-one": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8"
    },
    "website": "https://polkadot.com/",
    "reddit": "https://www.reddit.com/r/Polkadot",
    "telegram": "https://t.me/PolkadotOfficial",
    "twitter": "https://twitter.com/Polkadot",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/polkadot",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12171/large/polkadot.jpg?1766533446",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 90661192,
    "high_24h": 1.3,
    "low_24h": 1.25,
    "price_change_24h": -0.009246069655571,
    "price_change_percentage_24h": -0.7202,
    "market_cap_change_24h": -15141526.617199,
    "market_cap_change_percentage_24h": -0.70846,
    "circulating_supply": 1664939557.311887,
    "total_supply": 1664939557.311887,
    "max_supply": 2100000000,
    "last_updated": "2026-02-13T13:14:31.930Z",
    "platforms": {
      "ethereum": "0x196c20da81fbc324ecdf55501e95ce9f0bd84d14",
      "binance-smart-chain": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8",
      "base": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8",
      "optimistic-ethereum": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8",
      "arbitrum-one": "0x8d010bf9c26881788b4e6bf5fd1bdc358c8f90b8"
    }
  },
  "bc8c9af0d4f11721": {
    "name": "Uniswap",
    "symbol": "uni",
    "price": 3.34,
    "livePrice": {
      "value": 3.34,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=uniswap&vs_currencies=usd"
    },
    "rank": 39,
    "cap": 2117058422,
    "addedDate": "1770988562032",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "UNI is the governance token for Uniswap, an Automated Market Marker DEX on the Ethereum blockchain. The UNI token allows token holders to participate in the governance of the protocol. Key decisions such as usage of the treasury or future upgrades can be decided through a governance vote.",
    "explorerLink": "https://etherscan.io/token/0x1f9840a85d5af5bf1d1762f925bdaddc4201f984",
    "address": {
      "ethereum": "0x1f9840a85d5af5bf1d1762f925bdaddc4201f984",
      "xdai": "0x4537e328bf7e4efa29d05caea260d7fe26af9d74",
      "huobi-token": "0x22c54ce8321a4015740ee1109d9cbc25815c46e6",
      "unichain": "0x8f187aa05619a017077f5308904739877ce9ea21",
      "near-protocol": "1f9840a85d5af5bf1d1762f925bdaddc4201f984.factory.bridge.near",
      "harmony-shard-0": "0x90d81749da8867962c760414c1c25ec926e889b6",
      "energi": "0x665b3a802979ec24e076c80025bff33c18eb6007",
      "sora": "0x009be848df92a400da2f217256c88d1a9b1a0304f9b3e90991a67418e1d3b08c",
      "avalanche": "0x8ebaf22b6f053dffeaf46f4dd9efa95d89ba8580",
      "polygon-pos": "0xb33eaad8d922b1083446dc23f610c2567fb5180f",
      "binance-smart-chain": "0xbf5140a22578168fd562dccf235e5d43a02ce9b1",
      "arbitrum-one": "0xfa7f8980b0f1e64a2062791cc3b0871572f1f7f0",
      "optimistic-ethereum": "0x6fd9d7ad17242c41f7131d257212c54a0e816691"
    },
    "website": "https://uniswap.org/",
    "reddit": "https://www.reddit.com/r/Uniswap",
    "telegram": "",
    "twitter": "https://twitter.com/Uniswap",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/FCfyBSbCU5",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12504/large/uniswap-logo.png?1720676669",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 296359376,
    "high_24h": 3.46,
    "low_24h": 3.16,
    "price_change_24h": -0.057624194436814,
    "price_change_percentage_24h": -1.69585,
    "market_cap_change_24h": -32781181.212022,
    "market_cap_change_percentage_24h": -1.52482,
    "circulating_supply": 633878762.0380214,
    "total_supply": 898848420.0366304,
    "max_supply": 1000000000,
    "last_updated": "2026-02-13T13:15:04.735Z",
    "platforms": {
      "ethereum": "0x1f9840a85d5af5bf1d1762f925bdaddc4201f984",
      "xdai": "0x4537e328bf7e4efa29d05caea260d7fe26af9d74",
      "huobi-token": "0x22c54ce8321a4015740ee1109d9cbc25815c46e6",
      "unichain": "0x8f187aa05619a017077f5308904739877ce9ea21",
      "near-protocol": "1f9840a85d5af5bf1d1762f925bdaddc4201f984.factory.bridge.near",
      "harmony-shard-0": "0x90d81749da8867962c760414c1c25ec926e889b6",
      "energi": "0x665b3a802979ec24e076c80025bff33c18eb6007",
      "sora": "0x009be848df92a400da2f217256c88d1a9b1a0304f9b3e90991a67418e1d3b08c",
      "avalanche": "0x8ebaf22b6f053dffeaf46f4dd9efa95d89ba8580",
      "polygon-pos": "0xb33eaad8d922b1083446dc23f610c2567fb5180f",
      "binance-smart-chain": "0xbf5140a22578168fd562dccf235e5d43a02ce9b1",
      "arbitrum-one": "0xfa7f8980b0f1e64a2062791cc3b0871572f1f7f0",
      "optimistic-ethereum": "0x6fd9d7ad17242c41f7131d257212c54a0e816691"
    }
  },
  "7e84bc1b65d115bc": {
    "name": "Mantle",
    "symbol": "mnt",
    "price": 0.613436,
    "livePrice": {
      "value": 0.613436,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=mantle&vs_currencies=usd"
    },
    "rank": 40,
    "cap": 1995832449,
    "addedDate": "1770988577072",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Mantle is a pioneering on-chain ecosystem dedicated to revolutionizing the future of finance and blockchain scalability, seamlessly bridging traditional finance (TradFi) and decentralized finance (DeFi). Through innovative products like Mantle Network, mETH Protocol, Function (FBTC), and Mantle Index Four (MI4), Mantle empowers users and institutions with a unified financial services platform, redefining how the world spends, saves, and invests in the Web 3.0 era.\r\n\r\nWhat is MNT?\r\n$MNT powers Mantle’s ecosystem, serving as the cornerstone for governance, staking, and driving innovation across the decentralized economy.",
    "explorerLink": "https://etherscan.io/token/0x3c3a81e81dc49a522a592e7622a7e711c06bf354",
    "address": {
      "ethereum": "0x3c3a81e81dc49a522a592e7622a7e711c06bf354",
      "mantle": "0xdeaddeaddeaddeaddeaddeaddeaddeaddead0000"
    },
    "website": "https://group.mantle.xyz/",
    "reddit": "",
    "telegram": "https://t.me/mantlenetwork",
    "twitter": "https://twitter.com/Mantle_Official",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/0xMantle",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/30980/large/MNT_Token_Logo.png?1765516974",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 31785446,
    "high_24h": 0.625116,
    "low_24h": 0.604053,
    "price_change_24h": -0.0093204228134224,
    "price_change_percentage_24h": -1.49664,
    "market_cap_change_24h": -26692838.668631,
    "market_cap_change_percentage_24h": -1.31978,
    "circulating_supply": 3252944055.63684,
    "total_supply": 6219316794.889999,
    "max_supply": 6219316794.89,
    "last_updated": "2026-02-13T13:15:34.730Z",
    "platforms": {
      "ethereum": "0x3c3a81e81dc49a522a592e7622a7e711c06bf354",
      "mantle": "0xdeaddeaddeaddeaddeaddeaddeaddeaddead0000"
    }
  },
  "85284da386f84f29": {
    "name": "BlackRock USD Institutional Digital Liquidity Fund",
    "symbol": "buidl",
    "price": 1,
    "livePrice": {
      "value": 1,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=blackrock-usd-institutional-digital-liquidity-fund&vs_currencies=usd"
    },
    "rank": 41,
    "cap": 1840510042,
    "addedDate": "1770988592239",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etherscan.io/token/0x7712c34205737192402172409a8f7ccef8aa2aec",
    "address": {
      "ethereum": "0x7712c34205737192402172409a8f7ccef8aa2aec",
      "avalanche": "0x53fc82f14f009009b440a706e31c9021e1196a2f",
      "binance-smart-chain": "0x2d5bdc96d9c8aabbdb38c9a27398513e7e5ef84f",
      "solana": "GyWgeqpy5GueU2YbkE8xqUeVEokCMMCEeUrfbtMw6phr",
      "arbitrum-one": "0xa6525ae43edcd03dc08e775774dcabd3bb925872",
      "optimistic-ethereum": "0xa1cdab15bba75a80df4089cafba013e376957cf5",
      "aptos": "0x50038be55be5b964cfa32cf128b5cf05f123959f286b4cc02b86cafd48945f89",
      "polygon-pos": "0x2893ef551b6dd69f661ac00f11d93e5dc5dc0e99"
    },
    "website": "https://www.blackrock.com/corporate",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/BlackRock",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/36291/large/blackrock.png?1711013223",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 0,
    "high_24h": 1,
    "low_24h": 1,
    "price_change_24h": 0,
    "price_change_percentage_24h": 0,
    "market_cap_change_24h": -76209.409999,
    "market_cap_change_percentage_24h": -0.00414,
    "circulating_supply": 1840510042.410449,
    "total_supply": 1840510042.410449,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:15:01.860Z",
    "platforms": {
      "ethereum": "0x7712c34205737192402172409a8f7ccef8aa2aec",
      "avalanche": "0x53fc82f14f009009b440a706e31c9021e1196a2f",
      "binance-smart-chain": "0x2d5bdc96d9c8aabbdb38c9a27398513e7e5ef84f",
      "solana": "GyWgeqpy5GueU2YbkE8xqUeVEokCMMCEeUrfbtMw6phr",
      "arbitrum-one": "0xa6525ae43edcd03dc08e775774dcabd3bb925872",
      "optimistic-ethereum": "0xa1cdab15bba75a80df4089cafba013e376957cf5",
      "aptos": "0x50038be55be5b964cfa32cf128b5cf05f123959f286b4cc02b86cafd48945f89",
      "polygon-pos": "0x2893ef551b6dd69f661ac00f11d93e5dc5dc0e99"
    }
  },
  "feb82a482c43eb75": {
    "name": "Aster",
    "symbol": "aster",
    "price": 0.710723,
    "livePrice": {
      "value": 0.710723,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=aster-2&vs_currencies=usd"
    },
    "rank": 42,
    "cap": 1754395982,
    "addedDate": "1770988607566",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "binance-smart-chain",
    "launchDate": "",
    "token": true,
    "description": "Aster is a next-generation decentralized perpetual exchange that combines non-custodial trading with advanced features like hidden orders and multi-chain support. The platform emerged from the merger of Astherus and APX Finance in late 2024, with APX token holders able to migrate their holdings to ASTER.\r\n\r\nAster addresses the gap between centralized and decentralized exchanges by enabling traders to maintain full control of their assets while accessing deep liquidity and CEX-grade trading tools. The platform supports trading of both cryptocurrency perpetuals and U.S. stocks with up to 100x leverage, all settled on-chain in crypto without requiring traditional financial infrastructure.\r\n\r\nThe platform offers two distinct trading modes to accommodate different user needs. Simple Mode provides one-click, MEV-resistant trading with up to 1001x leverage for beginners, while Pro Mode delivers a full order book with advanced features like automated grid trading and hidden orders that remain invisible until execution. \r\n\r\nAster operates across BNB Chain, Ethereum, Solana, and Arbitrum without requiring bridging, with liquidity pooled across markets to support large trades with minimal slippage. A distinctive feature allows users to deposit yield-generating assets like asBNB or USDF as collateral, earning passive returns while trading, maximizing capital efficiency compared to platforms where collateral sits idle.\r\n\r\nAster received backing from YZi Labs (formerly Binance Labs), which holds a minority stake through a private fund managing over $10 billion on behalf of early Binance executives. Changpeng Zhao, founder of Binance, serves in an advisory role and has personally invested over $2.5 million worth of ASTER tokens. \r\n\r\nThe ASTER token serves multiple functions including governance rights, staking rewards through liquidity provision, and earning incentives through the platform's points program for traders and liquidity providers.\r\n",
    "explorerLink": "https://bscscan.com/token/0x000Ae314E2A2172a039B26378814C252734f556A",
    "address": {
      "binance-smart-chain": "0x000ae314e2a2172a039b26378814c252734f556a"
    },
    "website": "https://www.asterdex.com/en",
    "reddit": "",
    "telegram": "https://t.me/AsterDEX",
    "twitter": "https://twitter.com/Aster_DEX",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/69040/large/_ASTER.png?1757326782",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 235576196,
    "high_24h": 0.735737,
    "low_24h": 0.693838,
    "price_change_24h": -0.004784921941744,
    "price_change_percentage_24h": -0.66874,
    "market_cap_change_24h": 4114643,
    "market_cap_change_percentage_24h": 0.23508,
    "circulating_supply": 2454947754.91,
    "total_supply": 7822985112.446448,
    "max_supply": 8000000000,
    "last_updated": "2026-02-13T13:16:42.836Z",
    "platforms": {
      "binance-smart-chain": "0x000ae314e2a2172a039b26378814c252734f556a"
    }
  },
  "96cd2d5745a725e2": {
    "name": "Falcon USD",
    "symbol": "usdf",
    "price": 0.996845,
    "livePrice": {
      "value": 0.996845,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=falcon-finance&vs_currencies=usd"
    },
    "rank": 43,
    "cap": 1751138759,
    "addedDate": "1770988622767",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": " Falcon, the next-generation platform transforming synthetic dollars into sustainable yield opportunities. Our mission is clear: Your Crypto, Your Yields. Falcon aims to empower users and institutions to unlock the true yield potential of their digital assets.  \r\n\r\nFalcon is built on the foundation of trust, transparency, and robust technology. Our team of experienced professionals brings expertise from blockchain, financial engineering, and quantitative analysis to ensure we deliver a protocol that balances reliability with performance. We are committed to enable users to make the most of their assets while adhering to the highest standards of accountability.\r\n\r\nOur mission extends beyond creating a protocol—it’s about fostering a system that prioritizes user returns and sustainable growth. ",
    "explorerLink": "https://etherscan.io/token/0xFa2B947eEc368f42195f24F36d2aF29f7c24CeC2",
    "address": {
      "ethereum": "0xfa2b947eec368f42195f24f36d2af29f7c24cec2",
      "binance-smart-chain": "0xb3b02e4a9fb2bd28cc2ff97b0ab3f6b3ec1ee9d2",
      "xdc-network": "0x8210c0634ab8f273806e4b7866e9db353773c44b"
    },
    "website": "https://falcon.finance/",
    "reddit": "",
    "telegram": "https://t.me/falconstable",
    "twitter": "https://twitter.com/FalconStable",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/54558/large/ff_200_X_200.png?1740741076",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 1196397,
    "high_24h": 0.997374,
    "low_24h": 0.995856,
    "price_change_24h": 0.00014604,
    "price_change_percentage_24h": 0.01465,
    "market_cap_change_24h": -2962448.361574,
    "market_cap_change_percentage_24h": -0.16889,
    "circulating_supply": 1757068816.796232,
    "total_supply": 1757068816.796232,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:16:57.886Z",
    "platforms": {
      "ethereum": "0xfa2b947eec368f42195f24f36d2af29f7c24cec2",
      "binance-smart-chain": "0xb3b02e4a9fb2bd28cc2ff97b0ab3f6b3ec1ee9d2",
      "xdc-network": "0x8210c0634ab8f273806e4b7866e9db353773c44b"
    }
  },
  "1133a5b60dcb6399": {
    "name": "Aave",
    "symbol": "aave",
    "price": 112.32,
    "livePrice": {
      "value": 112.32,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=aave&vs_currencies=usd"
    },
    "rank": 44,
    "cap": 1708246011,
    "addedDate": "1770988637894",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Aave is a decentralized money market protocol where users can lend and borrow cryptocurrency across 20 different assets as collateral. The protocol has a native token called AAVE, which is also a governance token that lets the community decide the direction of the protocol in a collective manner. Lenders can earn interest by providing liquidity to the market, while borrowers can borrow by collateralizing their cryptoassets to take out loans from the liquidity pools.\r\n\r\n",
    "explorerLink": "https://etherscan.io/token/0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9",
    "address": {
      "ethereum": "0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9",
      "base": "0x63706e401c06ac8513145b7687a14804d17f814b",
      "hydration": "asset_registry%2F1000624",
      "harmony-shard-0": "0xcf323aad9e522b93f11c352caa519ad0e14eb40f",
      "huobi-token": "0x202b4936fe1a82a4965220860ae46d7d3939bb25",
      "fantom": "0x6a07a792ab2965c72a5b8088d3a069a7ac3a993b",
      "near-protocol": "7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9.factory.bridge.near",
      "energi": "0xa7f2f790355e0c32cab03f92f6eb7f488e6f049a",
      "sora": "0x0091bd8d8295b25cab5a7b8b0e44498e678cfc15d872ede3215f7d4c7635ba36",
      "avalanche": "0x63a72806098bd3d9520cc43356dd78afe5d386d9",
      "polygon-pos": "0xd6df932a45c0f255f85145f286ea0b292b21c90b",
      "binance-smart-chain": "0xfb6115445bff7b52feb98650c87f44907e58f802",
      "arbitrum-one": "0xba5ddd1f9d7f570dc94a51479a000e3bce967196",
      "optimistic-ethereum": "0x76fb31fb4af56892a25e32cfc43de717950c9278"
    },
    "website": "https://app.aave.com/",
    "reddit": "https://www.reddit.com/r/Aave_Official",
    "telegram": "https://t.me/Aavesome",
    "twitter": "https://twitter.com/aave",
    "insta": "",
    "youtube": "",
    "discord": "https://aave.com/discord",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12645/large/aave-token-round.png?1720472354",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 419933486,
    "high_24h": 115.13,
    "low_24h": 106.07,
    "price_change_24h": 3.03,
    "price_change_percentage_24h": 2.77418,
    "market_cap_change_24h": 49128810,
    "market_cap_change_percentage_24h": 2.96114,
    "circulating_supply": 15190609.341746064,
    "total_supply": 16000000,
    "max_supply": 16000000,
    "last_updated": "2026-02-13T13:17:16.007Z",
    "platforms": {
      "ethereum": "0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9",
      "base": "0x63706e401c06ac8513145b7687a14804d17f814b",
      "hydration": "asset_registry%2F1000624",
      "harmony-shard-0": "0xcf323aad9e522b93f11c352caa519ad0e14eb40f",
      "huobi-token": "0x202b4936fe1a82a4965220860ae46d7d3939bb25",
      "fantom": "0x6a07a792ab2965c72a5b8088d3a069a7ac3a993b",
      "near-protocol": "7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9.factory.bridge.near",
      "energi": "0xa7f2f790355e0c32cab03f92f6eb7f488e6f049a",
      "sora": "0x0091bd8d8295b25cab5a7b8b0e44498e678cfc15d872ede3215f7d4c7635ba36",
      "avalanche": "0x63a72806098bd3d9520cc43356dd78afe5d386d9",
      "polygon-pos": "0xd6df932a45c0f255f85145f286ea0b292b21c90b",
      "binance-smart-chain": "0xfb6115445bff7b52feb98650c87f44907e58f802",
      "arbitrum-one": "0xba5ddd1f9d7f570dc94a51479a000e3bce967196",
      "optimistic-ethereum": "0x76fb31fb4af56892a25e32cfc43de717950c9278"
    }
  },
  "0b8dc98b6b42fd72": {
    "name": "Bitget Token",
    "symbol": "bgb",
    "price": 2.34,
    "livePrice": {
      "value": 2.34,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bitget-token&vs_currencies=usd"
    },
    "rank": 45,
    "cap": 1640109337,
    "addedDate": "1770988653091",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "What is BGB token?\r\nBGB is a decentralised token that is the primary token of Morph's blockchain, serving as the gas, governance, and payment token across the layer. \r\n\r\nWho Are the Founders of Bitget Token?\r\nLaunched in 2021, Bitget Token (BGB) was initially positioned as the platform token for the Bitget exchange and Bitget Wallet. \r\nBehind Bitget is a team of visionary early adopters dedicated to a blockchain-powered future. The leadership team is comprised of seasoned professionals with experience at global giants like Goldman Sachs, Facebook, and Binance, including CEO Gracy Chen, COO Vugar Usi Zade, and CLO Hon Ng.\r\nIn September 2025, Bitget agreed to a strategic partnership with the Morph chain. The Morph Foundation, a non-profit decentralized organization, is now solely responsible for the future development of BGB.\r\n\r\nWhat Makes Bitget Token (BGB) Unique?\r\nBGB is the gas and governance token of the Morph chain. At the same time, BGB will also get support from its partners, such as exchanges and wallets, serving as a key medium for Launchpool's new token mining, fee discounts, and more.\r\n\r\nHow Many Bitget Token (BGB) Coins Are There in Circulation?\r\nThe initial supply of Bitget Token (BGB) is fixed at 2 billion tokens. As of September 2025, the circulating supply of BGB is 699,992,035. The Morph Foundation will update the BGB burn mechanism, linking it to Morph network activity, until the total BGB supply is reduced to 100 million.\r\n\r\nHow Is the Bitget Token Network Secured?\r\nBitget Token (BGB) initially operates on Ethereum's blockchain using the ERC-20 standard and Proof-of-Stake (PoS) consensus, making it compatible with any Ethereum wallet. \r\nFollowing the strategic partnership between Bitget and Morph, a growing number of BGB will be migrated to the Morph chain, as the gas and governance token. \r\n\r\nWhere Can You Buy Bitget Token (BGB)?\r\nBitget Token (BGB) can be purchased directly on the Bitget exchange. BGB is also available for trading on MECX, Bitfinex, Uniswap, and BulbaSwap.",
    "explorerLink": "https://etherscan.io/token/0x54d2252757e1672eead234d27b1270728ff90581",
    "address": {
      "ethereum": "0x54d2252757e1672eead234d27b1270728ff90581",
      "morph-l2": "0x55d1f1879969bdbb9960d269974564c58dbc3238"
    },
    "website": "https://partner.bitget.com/bg/2LAE9K",
    "reddit": "https://www.reddit.com/r/BitgetReddit",
    "telegram": "https://t.me/Bitget_NewMarket_Bot",
    "twitter": "https://twitter.com/bitgetglobal",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/11610/large/Bitget_logo.png?1736925727",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 16760682,
    "high_24h": 2.39,
    "low_24h": 2.33,
    "price_change_24h": -0.048870681143626,
    "price_change_percentage_24h": -2.04474,
    "market_cap_change_24h": -33443170.99545,
    "market_cap_change_percentage_24h": -1.99833,
    "circulating_supply": 699992035.9787906,
    "total_supply": 916931610.9787906,
    "max_supply": 2000000000,
    "last_updated": "2026-02-13T13:17:27.522Z",
    "platforms": {
      "ethereum": "0x54d2252757e1672eead234d27b1270728ff90581",
      "morph-l2": "0x55d1f1879969bdbb9960d269974564c58dbc3238"
    }
  },
  "c0a7ad543ecc9b8f": {
    "name": "Circle USYC",
    "symbol": "usyc",
    "price": 1.12,
    "livePrice": {
      "value": 1.12,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=hashnote-usyc&vs_currencies=usd"
    },
    "rank": 46,
    "cap": 1588037235,
    "addedDate": "1770988668128",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "USYC: Tokenized Money Market Fund\r\n\r\nHashnote International Short Duration Yield Fund Ltd. invests in short-term U.S. Treasury Bills and performs repo/reverse repo activities as the underlying asset of the USYC token.\r\n\r\nUSYC earns short-term Fed rate returns. Tokenization enables the fund to deliver rapid transactions, onchain transparency, and seamless composability—while maintaining strong controls across regulatory and credit dimensions.\r\n",
    "explorerLink": "https://etherscan.io/token/0x136471a34f6ef19fe571effc1ca711fdb8e49f2b",
    "address": {
      "ethereum": "0x136471a34f6ef19fe571effc1ca711fdb8e49f2b",
      "binance-smart-chain": "0x8d0fa28f221eb5735bc71d3a0da67ee5bc821311",
      "solana": "7LWanZteUKtvFjv4MHYgKXXdAuCQYFPJysL9pxxdRQGn"
    },
    "website": "https://usyc.hashnote.com/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/Hashnote_Labs",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/51054/large/Hashnote_SDYC_200x200.png?1730370965",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 44.6,
    "high_24h": 0,
    "low_24h": 0,
    "price_change_24h": 0,
    "price_change_percentage_24h": 0,
    "market_cap_change_24h": 0,
    "market_cap_change_percentage_24h": 0,
    "circulating_supply": 1424238927.49778,
    "total_supply": 1424238927.49778,
    "max_supply": 0,
    "last_updated": "2026-02-10T05:42:11.457Z",
    "platforms": {
      "ethereum": "0x136471a34f6ef19fe571effc1ca711fdb8e49f2b",
      "binance-smart-chain": "0x8d0fa28f221eb5735bc71d3a0da67ee5bc821311",
      "solana": "7LWanZteUKtvFjv4MHYgKXXdAuCQYFPJysL9pxxdRQGn"
    }
  },
  "265a2e74f4bd3bbe": {
    "name": "OKB",
    "symbol": "okb",
    "price": 75.09,
    "livePrice": {
      "value": 75.09,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=okb&vs_currencies=usd"
    },
    "rank": 47,
    "cap": 1579164951,
    "addedDate": "1770988683431",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "OKEx, the 2nd most popular cryptocurrency exchange by trading volume, launched its platform token ‘OKB‘ today with 10 trading pairs. On its official support page, OKEx describes OKB is a global utility token issued by the OK Blockchain Foundation. The total available supply of OKB will be one billion tokens (1,000,000,000), with a distribution model that allocates 60% of the supply will be given out to OKEx customers for community building and during marketing campaigns. According to OKEx, the company had officially issued OKB on ERC20 protocol earlier this month. \r\n\r\nThe company denied ICO (initial coin offering) and public fundraising. Reportedly the company had stated that it would be soon shifting the token to its official OK chain and subsequently it will be applied not only on OKEx’s platform but also on other related projects. There will be in total 1 billion tokens supplied globally out of which 600 million coins will be distributed to OKEx customers for community building and marketing campaigns. Rest will be locked up for a period of 1 year to 3 years.\r\n\r\nAccording to OKEx, the company had officially issued OKB on ERC20 protocol earlier this month. The company denied ICO (initial coin offering) and public fundraising. Reportedly the company had stated that it would be soon shifting the token to its official OK chain and subsequently it will be applied not only on OKEx’s platform but also on other related projects. There will be in total 1 billion tokens supplied globally out of which 600 million coins will be distributed to OKEx customers for community building and marketing campaigns. Rest will be locked up for a period of 1 year to 3 years.",
    "explorerLink": "https://ethplorer.io/address/0x75231f58b43240c9718dd58b4967c5114342a86c",
    "address": {
      "ethereum": "0x75231f58b43240c9718dd58b4967c5114342a86c",
      "okex-chain": "0xdf54b6c6195ea4d948d03bfd818d365cf175cfc2",
      "sora": "0x0080edc40a944d29562b2dea2de42ed27b9047d16eeea27c5bc1b2e02786abe9"
    },
    "website": "https://www.okx.com/okb",
    "reddit": "https://www.reddit.com/r/OKX/",
    "telegram": "https://t.me/OKXOfficial_English",
    "twitter": "https://twitter.com/okx",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/4463/large/WeChat_Image_20220118095654.png?1696505053",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 15924434,
    "high_24h": 75.57,
    "low_24h": 73.37,
    "price_change_24h": -0.11310434484144,
    "price_change_percentage_24h": -0.15039,
    "market_cap_change_24h": 1302888,
    "market_cap_change_percentage_24h": 0.08257,
    "circulating_supply": 21000000,
    "total_supply": 21000000,
    "max_supply": 21000000,
    "last_updated": "2026-02-13T13:17:52.158Z",
    "platforms": {
      "ethereum": "0x75231f58b43240c9718dd58b4967c5114342a86c",
      "okex-chain": "0xdf54b6c6195ea4d948d03bfd818d365cf175cfc2",
      "sora": "0x0080edc40a944d29562b2dea2de42ed27b9047d16eeea27c5bc1b2e02786abe9"
    }
  },
  "90d5ca91304b32f8": {
    "name": "Global Dollar",
    "symbol": "usdg",
    "price": 0.999645,
    "livePrice": {
      "value": 0.999645,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=global-dollar&vs_currencies=usd"
    },
    "rank": 48,
    "cap": 1571744635,
    "addedDate": "1770988698721",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "solana",
    "launchDate": "",
    "token": true,
    "description": "Global Dollar (USDG) is a single currency stablecoin pegged to the US dollar that is regulated under the Monetary Authority of Singapore (MAS). USDG is issued by Paxos Digital Singapore (PDS) and will always be fully redeemable from Paxos on a one- to-one basis for US dollars. \r\n\r\nUSDG combines the stability and reach of US dollars with the added security and efficiency of blockchain technology. USDG is always available and accessible, offering high transfer speeds and programmability. USDG is always available for 1:1 redemption for US dollars, 24/7.\r\n\r\nPaxos Digital Singapore Pte. Ltd. (PDS), the issuer of USDG, has secured full approval from the Monetary Authority of Singapore (MAS) as a Major Payments Institution (MPI) to offer digital payment token services. This approval aligns USDG with MAS' forthcoming stablecoin framework, positioning it at the forefront of regulatory compliance. MAS, a globally recognized prudential regulator, is known for its robust oversight of stablecoins and commitment to stringent consumer protection standards.\r\n\r\nUSDG's issuance will adhere to strict regulatory standards, including requirements for value stability, capital adequacy, redemption and par and comprehensive disclosure. Specific regulatory obligations include substantial capital reserve requirements, frequent regulatory examinations, monthly independent attestations of reserve assets, monitoring of operating procedures and annual audits of reserve assets. It also provides protection from bankruptcy by holding stablecoin reserve assets in segregated accounts held on trust by PDS for the benefit of USDG holders.  \r\n\r\nUSDG represents the pinnacle of regulated stablecoins, offering unparalleled stability, security and compliance in the rapidly evolving world of digital finance.",
    "explorerLink": "https://etherscan.io/token/0xe343167631d89B6Ffc58B88d6b7fB0228795491D",
    "address": {
      "solana": "2u1tszSeqZ3qBWF3uNGPFc8TzMk2tdiwknnRMWGWjGWH",
      "x-layer": "0x4ae46a509f6b1d9056937ba4500cb143933d2dc8",
      "ink": "0xe343167631d89b6ffc58b88d6b7fb0228795491d",
      "ethereum": "0xe343167631d89b6ffc58b88d6b7fb0228795491d"
    },
    "website": "https://globaldollar.com",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/global_dollar",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/51281/large/GDN_USDG_Token_200x200.png?1730484111",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 35555782,
    "high_24h": 1,
    "low_24h": 0.999593,
    "price_change_24h": -0.0001406347356498,
    "price_change_percentage_24h": -0.01407,
    "market_cap_change_24h": 1220098,
    "market_cap_change_percentage_24h": 0.07769,
    "circulating_supply": 1572130361.355434,
    "total_supply": 1572130361.355434,
    "max_supply": 0,
    "last_updated": "2026-02-13T13:18:12.598Z",
    "platforms": {
      "solana": "2u1tszSeqZ3qBWF3uNGPFc8TzMk2tdiwknnRMWGWjGWH",
      "x-layer": "0x4ae46a509f6b1d9056937ba4500cb143933d2dc8",
      "ink": "0xe343167631d89b6ffc58b88d6b7fb0228795491d",
      "ethereum": "0xe343167631d89b6ffc58b88d6b7fb0228795491d"
    }
  },
  "d9f76fb4f3935398": {
    "name": "HTX DAO",
    "symbol": "htx",
    "price": 0.0000017,
    "livePrice": {
      "value": 0.0000017,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=htx-dao&vs_currencies=usd"
    },
    "rank": 49,
    "cap": 1555853535,
    "addedDate": "1770988713887",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "tron",
    "launchDate": "",
    "token": true,
    "description": "HTX is the governance token of HTX DAO, a decentralized autonomous organization relying on the collective autonomy of HTX token holders. HTX holders possess the right to vote on proposals and can freely delegate and exercise their voting rights in the decision-making process.",
    "explorerLink": "https://tronscan.org/#/token20/TUPM7K8REVzD2UdV4R5fe5M8XbnR2DdoJ6",
    "address": {
      "tron": "TUPM7K8REVzD2UdV4R5fe5M8XbnR2DdoJ6",
      "ethereum": "0x61ec85ab89377db65762e234c946b5c25a56e99e",
      "binance-smart-chain": "0x61ec85ab89377db65762e234c946b5c25a56e99e"
    },
    "website": "http://www.htxdao.com/en-us/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/HTX_DAO",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/35491/large/Frame_1321318576.png?1708908626",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 23593852,
    "high_24h": 0.00000171,
    "low_24h": 0.00000168,
    "price_change_24h": 9.363e-9,
    "price_change_percentage_24h": 0.5549,
    "market_cap_change_24h": 9676812,
    "market_cap_change_percentage_24h": 0.62585,
    "circulating_supply": 916533066327098.8,
    "total_supply": 916533066327098.8,
    "max_supply": 999990000000000,
    "last_updated": "2026-02-13T13:18:30.246Z",
    "platforms": {
      "tron": "TUPM7K8REVzD2UdV4R5fe5M8XbnR2DdoJ6",
      "ethereum": "0x61ec85ab89377db65762e234c946b5c25a56e99e",
      "binance-smart-chain": "0x61ec85ab89377db65762e234c946b5c25a56e99e"
    }
  },
  "ca90960e81f009c7": {
    "name": "Pepe",
    "symbol": "pepe",
    "price": 0.00000366,
    "livePrice": {
      "value": 0.00000366,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=pepe&vs_currencies=usd"
    },
    "rank": 50,
    "cap": 1544954910,
    "addedDate": "1770988728967",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "What is the project about?\r\nPepe is a community based meme token surround the iconic meme Pepe the frog. Pepe aims to leverage the power of such an iconic meme to become the most memeable memecoin in existence. \r\n\r\nWhat makes your project unique?\r\nPepe is here to make memecoins great again. Ushering in a new paradigm for memecoins, Pepe represents the memecoin in it's purest simplicity. With zero taxes, liquidity locked forever, and contract immutable, Pepe is for the people, forever. Pepe is about culture, rallying together a community to have fun and enjoy memes, fueled purely by memetic power. \r\n\r\nHistory of your project.\r\nPepe was stealth launched on Friday, April 14th, 2023. \r\n\r\nWhat’s next for your project?\r\nPepe will focus on developing a tight-knit community around the token and building resources to enrich the communities knowledge and success in crypto through a token gated group, newsletter, and more tools. \r\n\r\nWhat can your token be used for?\r\nPepe can be used to speculate on the power of memes, and does not pretend to be anything more. \r\n",
    "explorerLink": "https://etherscan.io/token/0x6982508145454ce325ddbe47a25d4ec3d2311933",
    "address": {
      "ethereum": "0x6982508145454ce325ddbe47a25d4ec3d2311933",
      "avalanche": "0xa659d083b677d6bffe1cb704e1473b896727be6d",
      "binance-smart-chain": "0x25d887ce7a35172c62febfd67a1856f20faebb00",
      "arbitrum-one": "0x25d887ce7a35172c62febfd67a1856f20faebb00"
    },
    "website": "https://www.pepe.vip/",
    "reddit": "",
    "telegram": "",
    "twitter": "https://twitter.com/pepecoineth",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/29850/large/pepe-token.jpeg?1696528776",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 269372712,
    "high_24h": 0.00000376,
    "low_24h": 0.00000361,
    "price_change_24h": -5.8088065474e-8,
    "price_change_percentage_24h": -1.56085,
    "market_cap_change_24h": -9792338.526227,
    "market_cap_change_percentage_24h": -0.62983,
    "circulating_supply": 420690000000000,
    "total_supply": 420690000000000,
    "max_supply": 420690000000000,
    "last_updated": "2026-02-13T13:17:53.233Z",
    "platforms": {
      "ethereum": "0x6982508145454ce325ddbe47a25d4ec3d2311933",
      "avalanche": "0xa659d083b677d6bffe1cb704e1473b896727be6d",
      "binance-smart-chain": "0x25d887ce7a35172c62febfd67a1856f20faebb00",
      "arbitrum-one": "0x25d887ce7a35172c62febfd67a1856f20faebb00"
    }
  }
}