{
  "c3edbf2b6e745a24": {
    "name": "Bitcoin",
    "symbol": "btc",
    "price": 117669,
    "livePrice": {
      "value": 117669,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bitcoin&vs_currencies=usd"
    },
    "rank": 1,
    "cap": 2340205206792,
    "addedDate": "1752285361229",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2009-01-03",
    "token": true,
    "description": "Bitcoin is the first successful internet money based on peer-to-peer technology; whereby no central bank or authority is involved in the transaction and production of the Bitcoin currency. It was created by an anonymous individual/group under the name, Satoshi Nakamoto. The source code is available publicly as an open source project, anybody can look at it and be part of the developmental process.\r\n\r\nBitcoin is changing the way we see money as we speak. The idea was to produce a means of exchange, independent of any central authority, that could be transferred electronically in a secure, verifiable and immutable way. It is a decentralized peer-to-peer internet currency making mobile payment easy, very low transaction fees, protects your identity, and it works anywhere all the time with no central authority and banks.\r\n\r\nBitcoin is designed to have only 21 million BTC ever created, thus making it a deflationary currency. Bitcoin uses the SHA-256 hashing algorithm with an average transaction confirmation time of 10 minutes. Miners today are mining Bitcoin using ASIC chip dedicated to only mining Bitcoin, and the hash rate has shot up to peta hashes.\r\n\r\nBeing the first successful online cryptography currency, Bitcoin has inspired other alternative currencies such as Litecoin, Peercoin, Primecoin, and so on.\r\n\r\nThe cryptocurrency then took off with the innovation of the turing-complete smart contract by Ethereum which led to the development of other amazing projects such as EOS, Tron, and even crypto-collectibles such as CryptoKitties.",
    "explorerLink": "https://mempool.space/",
    "address": {},
    "website": "http://www.bitcoin.org",
    "reddit": "https://www.reddit.com/r/Bitcoin/",
    "telegram": "",
    "twitter": "https://twitter.com/bitcoin",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/1/large/bitcoin.png?1696501400",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 61375489385,
    "high_24h": 118667,
    "low_24h": 115841,
    "price_change_24h": 1712,
    "price_change_percentage_24h": 1.47658,
    "market_cap_change_24h": 33257379864,
    "market_cap_change_percentage_24h": 1.44162,
    "circulating_supply": 19891084,
    "total_supply": 19891125,
    "max_supply": 21000000,
    "last_updated": "2025-07-12T01:55:02.144Z",
    "platforms": {}
  },
  "1f6e47739ea552ba": {
    "name": "Ethereum",
    "symbol": "eth",
    "price": 2964.28,
    "livePrice": {
      "value": 2964.28,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ethereum&vs_currencies=usd"
    },
    "rank": 2,
    "cap": 357716927544,
    "addedDate": "1752285376292",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2015-07-30",
    "token": true,
    "description": "Ethereum is a global, open-source platform for decentralized applications. In other words, the vision is to create a world computer that anyone can build applications in a decentralized manner; while all states and data are distributed and publicly accessible. Ethereum supports smart contracts in which developers can write code in order to program digital value. Examples of decentralized apps (dapps) that are built on Ethereum includes tokens, non-fungible tokens, decentralized finance apps, lending protocol, decentralized exchanges, and much more.\r\n\r\nOn Ethereum, all transactions and smart contract executions require a small fee to be paid. This fee is called Gas. In technical terms, Gas refers to the unit of measure on the amount of computational effort required to execute an operation or a smart contract. The more complex the execution operation is, the more gas is required to fulfill that operation. Gas fees are paid entirely in Ether (ETH), which is the native coin of the blockchain. The price of gas can fluctuate from time to time depending on the network demand.",
    "explorerLink": "https://etherscan.io/",
    "address": {},
    "website": "https://www.ethereum.org/",
    "reddit": "https://www.reddit.com/r/ethereum",
    "telegram": "",
    "twitter": "https://twitter.com/ethereum",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/279/large/ethereum.png?1696501628",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 40947474954,
    "high_24h": 3027.12,
    "low_24h": 2935.93,
    "price_change_24h": 11.721136,
    "price_change_percentage_24h": 0.39698,
    "market_cap_change_24h": 1787991953,
    "market_cap_change_percentage_24h": 0.50235,
    "circulating_supply": 120715723.3341001,
    "total_supply": 120715200.3530708,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:55:16.829Z",
    "platforms": {}
  },
  "8a43c5a6eebc426a": {
    "name": "XRP",
    "symbol": "xrp",
    "price": 2.81,
    "livePrice": {
      "value": 2.81,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ripple&vs_currencies=usd"
    },
    "rank": 3,
    "cap": 165696009712,
    "addedDate": "1752285391378",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Ripple is the catchall name for the cryptocurrency platform, the transactional protocol for which is actually XRP, in the same fashion as Ethereum is the name for the platform that facilitates trades in Ether. Like other cryptocurrencies, Ripple is built atop the idea of a distributed ledger network which requires various parties to participate in validating transactions, rather than any singular centralized authority. That facilitates transactions all over the world, and transfer fees are far cheaper than the likes of bitcoin. Unlike other cryptocurrencies, XRP transfers are effectively immediate, requiring no typical confirmation time.\r\n\r\nRipple was originally founded by a single company, Ripple Labs, and continues to be backed by it, rather than the larger network of developers that continue bitcoin’s development. It also doesn’t have a fluctuating amount of its currency in existence. Where bitcoin has a continually growing pool with an eventual maximum, and Ethereum theoretically has no limit, Ripple was created with all of its 100 billion XRP tokens right out of the gate. That number is maintained with no mining and most of the tokens are owned and held by Ripple Labs itself — around 60 billion at the latest count.\r\n\r\nEven at the recently reduced value of around half a dollar per XRP, that means Ripple Labs is currently sitting on around $20 billion worth of the cryptocurrency (note: Ripple’s price crashed hard recently, and may be worth far less than $60 billion by time you read this). It holds 55 billion XRP in an escrow account, which allows it to sell up to a billion per month if it so chooses in order to fund new projects and acquisitions. Selling such an amount would likely have a drastic effect on the cryptocurrency’s value, and isn’t something Ripple Labs plans to do anytime soon.\r\n\r\nIn actuality, Ripple Labs is looking to leverage the technology behind XRP to allow for faster banking transactions around the world. While Bitcoin and other cryptocurrencies are built on the idea of separating financial transactions from the financial organizations of traditional currencies, Ripple is almost the opposite in every sense.\r\n\r\nXRP by Ripple price can be found on this page alongside the market capitalization and additional stats.\r\n\r\n",
    "explorerLink": "https://blockchair.com/ripple",
    "address": {},
    "website": "https://ripple.com/currency/",
    "reddit": "https://www.reddit.com/r/ripple",
    "telegram": "",
    "twitter": "https://twitter.com/Ripple",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/44/large/xrp-symbol-white-128.png?1696501442",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 14480059419,
    "high_24h": 2.91,
    "low_24h": 2.55,
    "price_change_24h": 0.2577218,
    "price_change_percentage_24h": 10.11158,
    "market_cap_change_24h": 15186100123,
    "market_cap_change_percentage_24h": 10.08977,
    "circulating_supply": 59131625363,
    "total_supply": 99985946231,
    "max_supply": 100000000000,
    "last_updated": "2025-07-12T01:55:07.495Z",
    "platforms": {}
  },
  "52543c8bf3e5d3b2": {
    "name": "Tether",
    "symbol": "usdt",
    "price": 1,
    "livePrice": {
      "value": 1,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=tether&vs_currencies=usd"
    },
    "rank": 4,
    "cap": 159129017920,
    "addedDate": "1752285406515",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange Bitfinex).\r\n\r\nThe digital coins are issued by a company called Tether Limited that is governed by the laws of the British Virgin Islands, according to the legal part of its website. It is incorporated in Hong Kong. It has emerged that Jan Ludovicus van der Velde is the CEO of cryptocurrency exchange Bitfinex, which has been accused of being involved in the price manipulation of bitcoin, as well as tether. Many people trading on exchanges, including Bitfinex, will use tether to buy other cryptocurrencies like bitcoin. Tether Limited argues that using this method to buy virtual currencies allows users to move fiat in and out of an exchange more quickly and cheaply. Also, exchanges typically have rocky relationships with banks, and using Tether is a way to circumvent that.\r\n\r\nUSDT is fairly simple to use. Once on exchanges like Poloniex or Bittrex, it can be used to purchase Bitcoin and other cryptocurrencies. It can be easily transferred from an exchange to any Omni Layer enabled wallet. Tether has no transaction fees, although external wallets and exchanges may charge one. In order to convert USDT to USD and vise versa through the Tether.to Platform, users must pay a small fee. Buying and selling Tether for Bitcoin can be done through a variety of exchanges like the ones mentioned previously or through the Tether.to platform, which also allows the conversion between USD to and from your bank account.\r\n\r\n",
    "explorerLink": "https://etherscan.io/token/0xdac17f958d2ee523a2206206994597c13d831ec7",
    "address": {
      "ethereum": "0xdac17f958d2ee523a2206206994597c13d831ec7",
      "klay-token": "0xd077a400968890eacc75cdc901f0356c943e4fdb",
      "aptos": "0x357b0b74bc833e95a115ad22604854d6b0fca151cecd94111770e5d6ffc9dc2b",
      "tron": "TR7NHqjeKQxGTCi8q8ZY4pL8otSzgjLj6t",
      "near-protocol": "usdt.tether-token.near",
      "kava": "0x919c1c267bc06a7039e03fcc2ef738525769109c",
      "celo": "0x48065fbbe25f71c9282ddf5e1cd6d6a887483d5e",
      "the-open-network": "EQCxE6mUtQJKFnGfaROTKOt1lZbDiiX1kCixRv7Nw2Id_sDs",
      "avalanche": "0x9702230a8ea53601f5cd2dc00fdbc13d4df4a8c7",
      "solana": "Es9vMFrzaCERmJfrF4H2FYD4KCoNkY11McCe8BenwNYB"
    },
    "website": "https://tether.to/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/Tether_to",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/325/large/Tether.png?1696501661",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 148420980142,
    "high_24h": 1,
    "low_24h": 0.999986,
    "price_change_24h": 0.00021792,
    "price_change_percentage_24h": 0.02179,
    "market_cap_change_24h": 42073986,
    "market_cap_change_percentage_24h": 0.02645,
    "circulating_supply": 159085671680.0948,
    "total_supply": 159085671680.0948,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:56:07.261Z",
    "platforms": {
      "ethereum": "0xdac17f958d2ee523a2206206994597c13d831ec7",
      "klay-token": "0xd077a400968890eacc75cdc901f0356c943e4fdb",
      "aptos": "0x357b0b74bc833e95a115ad22604854d6b0fca151cecd94111770e5d6ffc9dc2b",
      "tron": "TR7NHqjeKQxGTCi8q8ZY4pL8otSzgjLj6t",
      "near-protocol": "usdt.tether-token.near",
      "kava": "0x919c1c267bc06a7039e03fcc2ef738525769109c",
      "celo": "0x48065fbbe25f71c9282ddf5e1cd6d6a887483d5e",
      "the-open-network": "EQCxE6mUtQJKFnGfaROTKOt1lZbDiiX1kCixRv7Nw2Id_sDs",
      "avalanche": "0x9702230a8ea53601f5cd2dc00fdbc13d4df4a8c7",
      "solana": "Es9vMFrzaCERmJfrF4H2FYD4KCoNkY11McCe8BenwNYB"
    }
  },
  "f663cd8d92eee5ff": {
    "name": "BNB",
    "symbol": "bnb",
    "price": 694.6,
    "livePrice": {
      "value": 694.6,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=binancecoin&vs_currencies=usd"
    },
    "rank": 5,
    "cap": 101334447536,
    "addedDate": "1752285421601",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2017-07-08",
    "token": true,
    "description": "Binance Coin is the cryptocurrency of the Binance platform. It is a trading platform exclusively for cryptocurrencies. The name \"Binance\" is a combination of binary and finance.\r\n\r\nThus, the startup name shows that only cryptocurrencies can be traded against each other. It is not possible to trade crypto currencies against Fiat. The platform achieved an enormous success within a very short time and is focused on worldwide market with Malta headquarters. The cryptocurrency currently has a daily trading volume of 1.5 billion - 2 billion US dollars and is still increasing.\r\n\r\nIn total, there will only be 200 million BNBs. Binance uses the ERC20 token standard from Ethereum and has distributed it as follow: 50% sold on ICO, 40% to the team and 10% to Angel investors. The coin can be used to pay fees on Binance. These include trading fees, transaction fees, listing fees and others. Binance gives you a huge discount when fees are paid in BNB. \r\n\r\nThe schedule of BNB fees discount is as follow: In the first year, 50% discount on all fees, second year 25% discount, third year 12.5% discount, fourth year 6.75 % discount, and from the fifth year onwards there is no discount. This structure is used to incentivize users to buy BNB and do trades within Binance.\r\n\r\nBinance announced in a buyback plan that it would buy back up to 100 million BNB in Q1 2018. The coins are then burned. This means that they are devaluated to increase the value of the remaining coins. This benefits investors. In the future, the cryptocurrency will remain an asset on the trading platform and will be used as gas.\r\n\r\nOther tokens that are issued by exchanges include Bibox Token, OKB, Huobi Token, and more.",
    "explorerLink": "https://bscscan.com",
    "address": {
      "ethereum": "0xb8c77482e45f1f44de1745f52c74426c631bdd52"
    },
    "website": "https://www.binance.com",
    "reddit": "https://www.reddit.com/r/binance",
    "telegram": "",
    "twitter": "https://twitter.com/binance",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/825/large/bnb-icon2_2x.png?1696501970",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 1795157388,
    "high_24h": 696.43,
    "low_24h": 683.98,
    "price_change_24h": 5.078914,
    "price_change_percentage_24h": 0.73659,
    "market_cap_change_24h": 648509950,
    "market_cap_change_percentage_24h": 0.64409,
    "circulating_supply": 145887575.79,
    "total_supply": 145887575.79,
    "max_supply": 200000000,
    "last_updated": "2025-07-12T01:56:09.065Z",
    "platforms": {
      "ethereum": "0xb8c77482e45f1f44de1745f52c74426c631bdd52"
    }
  },
  "dcb355d8301494fe": {
    "name": "Solana",
    "symbol": "sol",
    "price": 163.74,
    "livePrice": {
      "value": 163.74,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=solana&vs_currencies=usd"
    },
    "rank": 6,
    "cap": 87644585258,
    "addedDate": "1752285436691",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Solana is a highly functional open source project that banks on blockchain technology’s permissionless nature to provide decentralized finance (DeFi) solutions. It is a layer 1 network that offers fast speeds and affordable costs. While the idea and initial work on the project began in 2017, Solana was officially launched in March 2020 by the Solana Foundation with headquarters in Geneva, Switzerland.",
    "explorerLink": "https://solscan.io/",
    "address": {},
    "website": "https://solana.com/",
    "reddit": "https://www.reddit.com/r/solana",
    "telegram": "https://t.me/solana",
    "twitter": "https://twitter.com/solana",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/4128/large/solana.png?1718769756",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 14574449638,
    "high_24h": 167.55,
    "low_24h": 160.87,
    "price_change_24h": -0.391329123003,
    "price_change_percentage_24h": -0.23842,
    "market_cap_change_24h": -514363651.66434,
    "market_cap_change_percentage_24h": -0.58345,
    "circulating_supply": 536031765.8528278,
    "total_supply": 605030514.3641498,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:56:06.166Z",
    "platforms": {}
  },
  "801ae56ce8fa7a57": {
    "name": "USDC",
    "symbol": "usdc",
    "price": 0.999907,
    "livePrice": {
      "value": 0.999907,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=usd-coin&vs_currencies=usd"
    },
    "rank": 7,
    "cap": 63510691083,
    "addedDate": "1752285451757",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "USDC is a fully collateralized US dollar stablecoin. USDC is the bridge between dollars and trading on cryptocurrency exchanges. The technology behind CENTRE makes it possible to exchange value between people, businesses and financial institutions just like email between mail services and texts between SMS providers. We believe by removing artificial economic borders, we can create a more inclusive global economy.",
    "explorerLink": "https://etherscan.io/token/0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
    "address": {
      "ethereum": "0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
      "sonic": "0x29219dd400f2bf60e5a23d13be72b486d4038894",
      "unichain": "0x078d782b760474a361dda0af3839290b0ef57ad6",
      "polkadot": "1337",
      "world-chain": "0x79a02482a880bce3f13e09da970dc34db4cd24d1",
      "xrp": "5553444300000000000000000000000000000000.rGm7WCVp9gb4jZHWTEtGUr4dd74z2XuWhE",
      "tron": "TEkxiTehnzSmSe2XqrBj4w32RUN966rdz8",
      "near-protocol": "17208628f84f5d6ad33f0da3bbbeb27ffcb398eac501a31bd6ad2011e36133a1",
      "hedera-hashgraph": "0.0.456858",
      "arbitrum-one": "0xaf88d065e77c8cc2239327c5edb3a432268e5831",
      "optimistic-ethereum": "0x0b2c639c533813f4aa9d7837caf62653d097ff85",
      "zksync": "0x1d17cbcf0d6d143135ae902365d2e5e2a16538d4",
      "aptos": "0xbae207659db88bea0cbead6da0ed00aac12edcdda169e591cd41c94180b46f3b",
      "base": "0x833589fcd6edb6e08f4c7c32d4f71b54bda02913",
      "algorand": "31566704",
      "stellar": "USDC-GA5ZSEJYB37JRC5AVCIA5MOP4RHTM335X2KGX3IHOJAPP5RE34K4KZVN",
      "celo": "0xceba9300f2b948710d2653dd7b07f33a8b32118c",
      "sui": "0xdba34672e30cb065b1f93e3ab55318768fd6fef66c15942c9f7cb846e2f900e7::usdc::USDC",
      "avalanche": "0xb97ef9ef8734c71904d8002f8b6bc66dd9c48a6e",
      "polygon-pos": "0x3c499c542cef5e3811e1192ce70d8cc03d5c3359",
      "solana": "EPjFWdd5AufqSSqeM2qN1xzybapC8G4wEGGkZwyTDt1v"
    },
    "website": "https://www.circle.com/en/usdc",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/buildoncircle",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/6319/large/usdc.png?1696506694",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 8417607879,
    "high_24h": 1,
    "low_24h": 0.999804,
    "price_change_24h": 0.00003102,
    "price_change_percentage_24h": 0.0031,
    "market_cap_change_24h": 677865623,
    "market_cap_change_percentage_24h": 1.07884,
    "circulating_supply": 63516587200.62469,
    "total_supply": 63516045837.82505,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:56:23.287Z",
    "platforms": {
      "ethereum": "0xa0b86991c6218b36c1d19d4a2e9eb0ce3606eb48",
      "sonic": "0x29219dd400f2bf60e5a23d13be72b486d4038894",
      "unichain": "0x078d782b760474a361dda0af3839290b0ef57ad6",
      "polkadot": "1337",
      "world-chain": "0x79a02482a880bce3f13e09da970dc34db4cd24d1",
      "xrp": "5553444300000000000000000000000000000000.rGm7WCVp9gb4jZHWTEtGUr4dd74z2XuWhE",
      "tron": "TEkxiTehnzSmSe2XqrBj4w32RUN966rdz8",
      "near-protocol": "17208628f84f5d6ad33f0da3bbbeb27ffcb398eac501a31bd6ad2011e36133a1",
      "hedera-hashgraph": "0.0.456858",
      "arbitrum-one": "0xaf88d065e77c8cc2239327c5edb3a432268e5831",
      "optimistic-ethereum": "0x0b2c639c533813f4aa9d7837caf62653d097ff85",
      "zksync": "0x1d17cbcf0d6d143135ae902365d2e5e2a16538d4",
      "aptos": "0xbae207659db88bea0cbead6da0ed00aac12edcdda169e591cd41c94180b46f3b",
      "base": "0x833589fcd6edb6e08f4c7c32d4f71b54bda02913",
      "algorand": "31566704",
      "stellar": "USDC-GA5ZSEJYB37JRC5AVCIA5MOP4RHTM335X2KGX3IHOJAPP5RE34K4KZVN",
      "celo": "0xceba9300f2b948710d2653dd7b07f33a8b32118c",
      "sui": "0xdba34672e30cb065b1f93e3ab55318768fd6fef66c15942c9f7cb846e2f900e7::usdc::USDC",
      "avalanche": "0xb97ef9ef8734c71904d8002f8b6bc66dd9c48a6e",
      "polygon-pos": "0x3c499c542cef5e3811e1192ce70d8cc03d5c3359",
      "solana": "EPjFWdd5AufqSSqeM2qN1xzybapC8G4wEGGkZwyTDt1v"
    }
  },
  "c910ae9a54f26e6d": {
    "name": "Dogecoin",
    "symbol": "doge",
    "price": 0.202611,
    "livePrice": {
      "value": 0.202611,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=dogecoin&vs_currencies=usd"
    },
    "rank": 8,
    "cap": 30401236910,
    "addedDate": "1752285466857",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2013-12-08",
    "token": true,
    "description": "Dogecoin is a cryptocurrency based on the popular \"Doge\" Internet meme and features a Shiba Inu on its logo. Dogecoin is a Litecoin fork. Introduced as a \"joke currency\" on 6 December 2013, Dogecoin quickly developed its own online community and reached a capitalization of US$60 million in January 2014. Compared with other cryptocurrencies, Dogecoin had a fast initial coin production schedule: 100 billion coins were in circulation by mid-2015, with an additional 5.256 billion coins every year thereafter. As of 30 June 2015, the 100 billionth Dogecoin had been mined. \r\n\r\nDogecoin was created by Billy Markus from Portland, Oregon and  Jackson Palmer from Sydney, Australia. Both wanted to create a fun cryptocurrency that will appeal beyond the core Bitcoin audience. Dogecoin is primarily used as a tipping system on Reddit and Twitter where users tip each other for creating or sharing good content. The community is very active in organising fundraising activities for deserving causes.\r\n\r\nThe developers of Dogecoin haven’t made any major changes to the coin since 2015. This means that Dogecoin could get left behind and is why Shibas are leaving Dogecoin to join more advanced platforms like Ethereum. One of Dogecoin strengths is its relaxed and fun-loving community. However, this is also a weakness because other currencies are way more professional.\r\n\r\nTo purchase Dogecoin, it involves downloading a crypto wallet, setting up a crypto exchange account and then trading away for your desired crypto currency. Once we have set up an account with a DOGE currency exchange and deposited some funds, you are ready to start trading. ",
    "explorerLink": "https://blockchair.com/dogecoin",
    "address": {},
    "website": "http://dogecoin.com/",
    "reddit": "https://www.reddit.com/r/dogecoin/",
    "telegram": "",
    "twitter": "https://twitter.com/dogecoin",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/5/large/dogecoin.png?1696501409",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 11737578685,
    "high_24h": 0.212442,
    "low_24h": 0.195661,
    "price_change_24h": 0.00695064,
    "price_change_percentage_24h": 3.55239,
    "market_cap_change_24h": 1061414021,
    "market_cap_change_percentage_24h": 3.61766,
    "circulating_supply": 150048356383.7052,
    "total_supply": 150058896383.7052,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:56:18.699Z",
    "platforms": {}
  },
  "450159dce373cd1f": {
    "name": "TRON",
    "symbol": "trx",
    "price": 0.302877,
    "livePrice": {
      "value": 0.302877,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=tron&vs_currencies=usd"
    },
    "rank": 9,
    "cap": 28692240333,
    "addedDate": "1752285481923",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2017-08-28",
    "token": true,
    "description": "What is Tron?\r\nTron's mission is to build a truly decentralized internet and aims to be the largest blockchain-based operating system in the world, known as the TRON protocol. The TRON protocol will offer high scalability, high availability, and high throughput computing to serve decentralized applications via smart contracts. Ethereum EVM-based smart contracts will be compatible and deployable on the TRON network as such Solidity developers do not have to rewrite their applications.\r\n\r\nWhy Tron?\r\nSince TRON protocol does not rely on proof of work or mining, instead governed by nodes located around the world, it is decentralized while providing high throughput for transactions on the blockchain. This is suitable for dapps that require high speed transactions especially games. There are a number of tokens already issued on the TRON network and the decentralized exchanges TRX.market has launched.\r\n\r\nOn July 24th 2018, TRON acquired BitTorrent, one of the largest P2P file sharing protocol. As a result of the acquisition, BitTorrent Token (BTT) was launched as the cryptocurrency to power the economics on the BitTorrent network. The Token will be used to inceltivize file sharing and storage within the network.\r\n",
    "explorerLink": "https://tronscan.org/",
    "address": {},
    "website": "https://tron.network",
    "reddit": "https://www.reddit.com/r/Tronix",
    "telegram": "https://t.me/tronnetworkEN",
    "twitter": "https://twitter.com/trondao",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/hqKvyAM",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/1094/large/tron-logo.png?1696502193",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 2840468275,
    "high_24h": 0.303186,
    "low_24h": 0.294316,
    "price_change_24h": 0.00825053,
    "price_change_percentage_24h": 2.80034,
    "market_cap_change_24h": 771392549,
    "market_cap_change_percentage_24h": 2.76278,
    "circulating_supply": 94763231852.30998,
    "total_supply": 94763348533.76802,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:56:42.446Z",
    "platforms": {}
  },
  "08927d626bfab9a0": {
    "name": "Lido Staked Ether",
    "symbol": "steth",
    "price": 2962.95,
    "livePrice": {
      "value": 2962.95,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=staked-ether&vs_currencies=usd"
    },
    "rank": 10,
    "cap": 27014971787,
    "addedDate": "1752285497207",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Lido Staked Ether (stETH) is a token that represents your staked ether in Lido, combining the value of initial deposit and staking rewards. stETH tokens are minted upon deposit and burned when redeemed. stETH token balances are pegged 1:1 to the ethers that are staked by Lido and the token’s balances are updated daily to reflect earnings and rewards. stETH tokens can be used as one would use ether, allowing you to earn ETH 2.0 staking rewards whilst benefiting from e.g. yields across decentralised finance products.",
    "explorerLink": "https://etherscan.io/token/0xae7ab96520de3a18e5e111b5eaab095312d7fe84",
    "address": {
      "ethereum": "0xae7ab96520de3a18e5e111b5eaab095312d7fe84"
    },
    "website": "https://www.lido.fi",
    "reddit": "https://www.reddit.com/r/lidofinance/",
    "telegram": "https://t.me/lidofinance",
    "twitter": "https://twitter.com/lidofinance",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/vgdPfhZ",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/13442/large/steth_logo.png?1696513206",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 102172313,
    "high_24h": 3033.06,
    "low_24h": 2927.93,
    "price_change_24h": 10.2,
    "price_change_percentage_24h": 0.34533,
    "market_cap_change_24h": 98809722,
    "market_cap_change_percentage_24h": 0.3671,
    "circulating_supply": 9128324.706343394,
    "total_supply": 9128355.665125808,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:58:13.135Z",
    "platforms": {
      "ethereum": "0xae7ab96520de3a18e5e111b5eaab095312d7fe84"
    }
  },
  "054e83dfbc279277": {
    "name": "Cardano",
    "symbol": "ada",
    "price": 0.72748,
    "livePrice": {
      "value": 0.72748,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=cardano&vs_currencies=usd"
    },
    "rank": 11,
    "cap": 26266314518,
    "addedDate": "1752285512267",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Cardano is a proof-of-stake blockchain platform designed to support decentralized applications (dApps), featuring a multi-asset ledger and smart contract functionality. Unlike many other blockchains, Cardano is built from the ground up based on original academic research, with proposed solutions undergoing peer review and presentation at international conferences before development. The platform emphasizes a research-driven and formal methods approach to design and implementation.",
    "explorerLink": "https://cardanoscan.io/",
    "address": {},
    "website": "https://cardano.org/",
    "reddit": "https://www.reddit.com/r/cardano",
    "telegram": "https://t.me/Cardano",
    "twitter": "https://twitter.com/Cardano_CF",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/975/large/cardano.png?1696502090",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 2586614000,
    "high_24h": 0.77209,
    "low_24h": 0.682275,
    "price_change_24h": 0.04520471,
    "price_change_percentage_24h": 6.62559,
    "market_cap_change_24h": 1615363034,
    "market_cap_change_percentage_24h": 6.55294,
    "circulating_supply": 36140694507.05163,
    "total_supply": 45000000000,
    "max_supply": 45000000000,
    "last_updated": "2025-07-12T01:58:04.110Z",
    "platforms": {}
  },
  "43c6fcea0a6c8d9e": {
    "name": "Hyperliquid",
    "symbol": "hype",
    "price": 46.35,
    "livePrice": {
      "value": 46.35,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=hyperliquid&vs_currencies=usd"
    },
    "rank": 12,
    "cap": 15475214996,
    "addedDate": "1752285527364",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "hyperliquid",
    "launchDate": "",
    "token": true,
    "description": "Hyperliquid is a performant L1 optimized from the ground up. The vision is a fully onchain open financial system with user built applications interfacing with performant native components, all without compromising end user experience. \r\n\r\nThe Hyperliquid L1 is performant enough to operate an entire ecosystem of permissionless financial applications – every order, cancel, trade, and liquidation happens transparently on-chain with block latency <1 second. The chain currently supports 100k orders / second.\r\n\r\nThe Hyperliquid L1 uses a custom consensus algorithm called HyperBFT which is heavily inspired by Hotstuff and its successors. Both the algorithm and networking stack are optimized from the ground up to support the L1. \r\n\r\nThe flagship native application is a fully onchain order book perpetuals exchange, the Hyperliquid DEX. Further developments include a native token standard, spot trading, permissionless liquidity, etc.",
    "explorerLink": "https://app.hyperliquid.xyz/explorer/token/0x0d01dc56dcaaca66ad901c959b4011ec",
    "address": {
      "hyperliquid": "0x0d01dc56dcaaca66ad901c959b4011ec"
    },
    "website": "https://hyperliquid.xyz/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/hyperliquid_announcements",
    "twitter": "https://twitter.com/HyperliquidX",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/50882/large/hyperliquid.jpg?1729431300",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 536123032,
    "high_24h": 46.74,
    "low_24h": 43.8,
    "price_change_24h": 2.44,
    "price_change_percentage_24h": 5.55878,
    "market_cap_change_24h": 779390930,
    "market_cap_change_percentage_24h": 5.30349,
    "circulating_supply": 333928180,
    "total_supply": 999990391,
    "max_supply": 1000000000,
    "last_updated": "2025-07-12T01:57:42.025Z",
    "platforms": {
      "hyperliquid": "0x0d01dc56dcaaca66ad901c959b4011ec"
    }
  },
  "a0d3ea8345f4b867": {
    "name": "Wrapped Bitcoin",
    "symbol": "wbtc",
    "price": 117435,
    "livePrice": {
      "value": 117435,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=wrapped-bitcoin&vs_currencies=usd"
    },
    "rank": 13,
    "cap": 15130513604,
    "addedDate": "1752285542469",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etherscan.io/token/0x2260fac5e5542a773aa44fbcfedf7c193bc2c599",
    "address": {
      "ethereum": "0x2260fac5e5542a773aa44fbcfedf7c193bc2c599",
      "osmosis": "factory/osmo1z0qrq605sjgcqpylfl4aa6s90x738j7m58wyatt0tdzflg2ha26q67k743/wbtc",
      "solana": "5XZw2LKTyrfvfiskJ78AMpackRjPcyCif1WhUsPDuVqQ"
    },
    "website": "https://www.wbtc.network/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/WrappedBTC",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/7598/large/wrapped_bitcoin_wbtc.png?1696507857",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 261395868,
    "high_24h": 118574,
    "low_24h": 115800,
    "price_change_24h": 1515.72,
    "price_change_percentage_24h": 1.30756,
    "market_cap_change_24h": 195101416,
    "market_cap_change_percentage_24h": 1.3063,
    "circulating_supply": 128850.89873878,
    "total_supply": 128850.89873878,
    "max_supply": 128850.89873878,
    "last_updated": "2025-07-12T01:57:53.660Z",
    "platforms": {
      "ethereum": "0x2260fac5e5542a773aa44fbcfedf7c193bc2c599",
      "osmosis": "factory/osmo1z0qrq605sjgcqpylfl4aa6s90x738j7m58wyatt0tdzflg2ha26q67k743/wbtc",
      "solana": "5XZw2LKTyrfvfiskJ78AMpackRjPcyCif1WhUsPDuVqQ"
    }
  },
  "94ff89a526e976a8": {
    "name": "Wrapped stETH",
    "symbol": "wsteth",
    "price": 3567.97,
    "livePrice": {
      "value": 3567.97,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=wrapped-steth&vs_currencies=usd"
    },
    "rank": 14,
    "cap": 12254065498,
    "addedDate": "1752285557606",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "wstETH is a wrapped version of stETH.  Instead of rebasing, or changing account holdings daily it is similar to a c-token.  It represents a pro-rata ownership of the staked ETH (stETH). When someone exits wstETH they are returned principal stETH + stETH earnings.\r\n\r\nLido is a liquid staking protocol for POS blockchains.  It gives you a liquid token that represents your staked collateral and earnings over time.  Lido removes the need to run infrastructure and enabling continued participation in DeFi.\r\n\r\nwstETH is minted and burned as stETH is wrapped and unwrapped.",
    "explorerLink": "https://etherscan.io/token/0x7f39c581f595b53c5cb19bd0b3f8da6c935e2ca0",
    "address": {
      "ethereum": "0x7f39c581f595b53c5cb19bd0b3f8da6c935e2ca0",
      "unichain": "0xc02fe7317d4eb8753a02c35fe019786854a92001"
    },
    "website": "https://lido.fi/",
    "reddit": "https://www.reddit.com/r/LidoFinance/",
    "telegram": "https://t.me/lidofinance",
    "twitter": "https://twitter.com/LidoFinance",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/dMqN4GYq",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/18834/large/wstETH.png?1696518295",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 23672920,
    "high_24h": 3660.06,
    "low_24h": 3545.98,
    "price_change_24h": 7.42,
    "price_change_percentage_24h": 0.20828,
    "market_cap_change_24h": 58025678,
    "market_cap_change_percentage_24h": 0.47577,
    "circulating_supply": 3426883.141891517,
    "total_supply": 3426883.141891517,
    "max_supply": 0,
    "last_updated": "2025-07-12T01:59:12.192Z",
    "platforms": {
      "ethereum": "0x7f39c581f595b53c5cb19bd0b3f8da6c935e2ca0",
      "unichain": "0xc02fe7317d4eb8753a02c35fe019786854a92001"
    }
  },
  "856db33ad6503d49": {
    "name": "Stellar",
    "symbol": "xlm",
    "price": 0.389193,
    "livePrice": {
      "value": 0.389193,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=stellar&vs_currencies=usd"
    },
    "rank": 15,
    "cap": 12044157654,
    "addedDate": "1752285572682",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "The Stellar network is an open source, distributed, and community owned network used to facilitate cross-asset transfers of value. Stellar aims to help facilitate cross-asset transfer of value at a fraction of a penny while aiming to be an open financial system that gives people of all income levels access to low-cost financial services. Stellar can handle exchanges between fiat-based currencies and between cryptocurrencies. Stellar.org, the organization that supports Stellar, is centralized like XRP and meant to handle cross platform transactions and micro transactions like XRP. However, unlike Ripple, Stellar.org is non-profit and their platform itself is open source and decentralized. \r\n\r\nStellar was founded by Jed McCaleb in 2014. Jed McCaleb is also the founder of Mt. Gox and co-founder of Ripple, launched the network system Stellar with former lawyer Joyce Kim. Stellar is also a payment technology that aims to connect financial institutions and drastically reduce the cost and time required for cross-border transfers. In fact, both payment networks used the same protocol initially.\r\n\r\nDistributed Exchange\r\nThrough the use of its intermediary currency Lumens (XLM), a user can send any currency that they own to anyone else in a different currency.\r\n\r\nFor instance, if Joe wanted to send USD to Mary using her EUR, an offer is submitted to the distributed exchange selling USD for EUR. This submitted offer forms is known as an order book. The network will use the order book to find the best exchange rate for the transaction in-order to minimize the fee paid by a user.\r\n\r\nThis multi-currency transaction is possible because of \"Anchors\". Anchors are trusted entities that hold people’s deposits and can issue credit. In essence, Anchors serves as the bridge between different currencies and the Stellar network.\r\n\r\nLumens (XLM)\r\nLumens are the native asset (digital currency) that exist on the Stellar network that helps to facilitate multi-currency transactions and prevent spams. For multi-currency transactions, XLM is the digital intermediary that allows for such a transaction to occur at a low cost.\r\n\r\nIn-order to prevent DoS attacks (aka spams) that would inevitably occur on the Stellar network, a small fee of 0.00001 XLM is associated with every transaction that occurs on the network. This fee is small enough so it does not significantly affect the cost of transaction, but large enough so it dissuades bad actors from spamming the network. \r\n\r\nPrior to Protocol 12, Stellar had a built-in inflation mechanism conceived to allow account holders to collectively direct inflation-generated lumens toward projects built on Stellar.\r\n\r\nAs the network evolved and grew, it became increasingly clear that inflation wasn’t working as intended — account holders either didn’t set their inflation destination or joined inflation pools to claim the inflation themselves, and the operational costs associated with inflation payments continued to rise — and so a protocol change to disable inflation was proposed, implemented, voted on by validators, and ultimately adopted as part of a network upgrade.\r\n\r\nThe inflation operation is now deprecated.\r\nhttps://developers.stellar.org/docs/glossary/inflation/\r\n",
    "explorerLink": "https://dashboard.stellar.org/",
    "address": {},
    "website": "https://www.stellar.org/",
    "reddit": "https://www.reddit.com/r/stellar",
    "telegram": "",
    "twitter": "https://twitter.com/stellarorg",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/100/large/fmpFRHHQ_400x400.jpg?1735231350",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 2167635922,
    "high_24h": 0.388325,
    "low_24h": 0.302078,
    "price_change_24h": 0.08711471,
    "price_change_percentage_24h": 28.83847,
    "market_cap_change_24h": 2667918073,
    "market_cap_change_percentage_24h": 28.45403,
    "circulating_supply": 31056803848.27393,
    "total_supply": 50001786892.81784,
    "max_supply": 50001786892.81784,
    "last_updated": "2025-07-12T01:58:21.070Z",
    "platforms": {}
  },
  "f8ed53c3e1aa7124": {
    "name": "Sui",
    "symbol": "sui",
    "price": 3.44,
    "livePrice": {
      "value": 3.44,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=sui&vs_currencies=usd"
    },
    "rank": 16,
    "cap": 11870023591,
    "addedDate": "1752285587779",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "sui",
    "launchDate": "",
    "token": true,
    "description": "Sui is an innovative layer-1 blockchain platform crafted to meet the demands of global adoption, providing a secure, robust, and scalable development environment. Rooted in a unique object-centric data model and fortified by the trusted Move programming language, Sui is engineered to tackle the inefficiencies found in current blockchain frameworks.\r\n\r\nIn addition to its solid technical underpinnings, Sui places a strong emphasis on user experience, aiming to remove common barriers encountered in blockchain interactions. Through groundbreaking features such as zkLogin, sponsored transactions, and programmable transaction blocks, Sui sets a new standard for user accessibility and friendliness within Web3 applications.\r\n\r\nUnique elements of Sui\r\nSui’s innovative architecture ensures swift transactions with stable fees and high throughput through horizontal scaling. Its object-oriented design offers deep composability for developers, enabling tailored object types with network-wide compatibility. This revolutionizes asset and protocol collaboration, fostering product innovation.\r\n\r\nThe platform's object-oriented approach dramatically improves transaction processing, enabling parallel execution and faster completion times. Additionally, unique consensus requirements expedite transaction finalization while maintaining stability. Sui prioritizes overcoming Web3 adoption barriers, offering native tools like zkLogin and sponsored transactions for wallet onboarding and fee management.\r\n\r\nMove integration into Sui's data model combines innovation with security, mitigating common exploits found in smart contract languages. This empowers developers and users with a secure and intuitive platform, accelerating the evolution of Web3 applications.\r\n\r\nAbout the Sui token\r\nThe SUI token serves four primary functions within the Sui ecosystem:\r\nProof-of-stake participation - Sui implements a delegated proof-of-stake mechanism, rewarding honest behavior by validators and SUI token holders who stake with them.\r\nGas fee payments - SUI tokens cover gas fees for executing transactions and storing data onchain.\r\nApplication utility - SUI is a versatile asset, integral to various applications within Sui’s ecosystem, including decentralized exchanges, lending platforms, gaming, and more.\r\nGovernance - The SUI token empowers holders to participate in on-chain voting on significant matters like protocol upgrades and platform changes, shaping the future of Sui.\r\n\r\nAdditionally, the Sui storage fund ensures fair compensation for validators by distributing stake rewards over time and covering storage costs for previously stored on-chain data. This tokenomic strategy promotes indefinite data storage while maintaining fair compensation for validators, fostering long-term sustainability.\r\n",
    "explorerLink": "https://suiscan.xyz/mainnet/home",
    "address": {
      "sui": "0x0000000000000000000000000000000000000000000000000000000000000002::sui::SUI"
    },
    "website": "https://sui.io/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/SuiNetwork",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/sui",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/26375/large/sui-ocean-square.png?1727791290",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 1837383797,
    "high_24h": 3.56,
    "low_24h": 3.33,
    "price_change_24h": -0.039598054404444,
    "price_change_percentage_24h": -1.1394,
    "market_cap_change_24h": -132826157.02218,
    "market_cap_change_percentage_24h": -1.10662,
    "circulating_supply": 3455015252.817221,
    "total_supply": 10000000000,
    "max_supply": 10000000000,
    "last_updated": "2025-07-12T01:59:29.432Z",
    "platforms": {
      "sui": "0x0000000000000000000000000000000000000000000000000000000000000002::sui::SUI"
    }
  },
  "a9c2afb84ff9f3c3": {
    "name": "Bitcoin Cash",
    "symbol": "bch",
    "price": 532.82,
    "livePrice": {
      "value": 532.82,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bitcoin-cash&vs_currencies=usd"
    },
    "rank": 17,
    "cap": 10596612372,
    "addedDate": "1752285602888",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Bitcoin Cash is a hard fork of Bitcoin with a protocol upgrade to fix on-chain capacity. Bitcoin Cash intends to be a Bitcoin without Segregated Witness (SegWit) as soft fork, where upgrades of the protocol are done mainly through hard forks and without changing the original economic rules of the Bitcoin.\r\n\r\nBitcoin Cash (BCH) is released on 1st August 2017 as an upgraded version of the original Bitcoin Core software. The main upgrade is the increase in the block size limit from 1MB to 8MB. This effectively allows miners on the BCH chain to process up to 8 times more payments per second in comparison to Bitcoin. This makes for faster, cheaper transactions and a much smoother user experience.\r\n\r\nWhy was Bitcoin Cash Created?\r\n\r\nThe main objective of Bitcoin Cash is to to bring back the essential qualities of money inherent in the original Bitcoin software. Over the years, these qualities were filtered out of Bitcoin Core and progress was stifled by various people, organizations, and companies involved in Bitcoin protocol development. The result is that Bitcoin Core is currently unusable as money due to increasingly high fees per transactions and transfer times taking hours to complete. This is all because of the 1MB limitation of Bitcoin Core’s block size, causing it unable to accommodate to large number of transactions.\r\n\r\nEssentially Bitcoin Cash is a community-activated upgrade (otherwise known as a hard fork) of Bitcoin that increased the block size to 8MB, solving the scaling issues that plague Bitcoin Core today.\r\n\r\nNov 16th 2018: A hashwar resulted in a split between Bitcoin SV and Bitcoin ABC",
    "explorerLink": "https://blockchair.com/bitcoin-cash",
    "address": {},
    "website": "https://bch.info/",
    "reddit": "https://www.reddit.com/r/btc",
    "telegram": "https://t.me/bchchannel",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/780/large/bitcoin-cash-circle.png?1696501932",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 530541600,
    "high_24h": 537.81,
    "low_24h": 518.37,
    "price_change_24h": 14.176441,
    "price_change_percentage_24h": 2.73335,
    "market_cap_change_24h": 277099318,
    "market_cap_change_percentage_24h": 2.6852,
    "circulating_supply": 19895903.02165078,
    "total_supply": 19895962.39665078,
    "max_supply": 21000000,
    "last_updated": "2025-07-12T01:59:31.812Z",
    "platforms": {}
  },
  "24a681bdba5e5de4": {
    "name": "Chainlink",
    "symbol": "link",
    "price": 15.38,
    "livePrice": {
      "value": 15.38,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=chainlink&vs_currencies=usd"
    },
    "rank": 18,
    "cap": 10432868331,
    "addedDate": "1752285617991",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2017-09-16",
    "token": true,
    "description": "Chainlink is a framework for building Decentralized Oracle Networks (DONs) that bring real-world data onto blockchain networks, enabling the creation of hybrid smart contracts. These DONs provide decentralized services such as Price Feeds, Proof of Reserve, Verifiable Randomness, Keepers, and the ability to connect to any web API. \r\n\r\nIt aims to ensure that the external information (pricing, weather data, event outcomes, etc.) and off-chain computations (randomness, transaction automation, fair ordering, etc.) fed to on-chain smart contracts are reliable and tamper-proof.https://www.instagram.com/chainlinklabs",
    "explorerLink": "https://etherscan.io/token/0x514910771af9ca656af840dff83e8264ecf986ca",
    "address": {
      "ethereum": "0x514910771af9ca656af840dff83e8264ecf986ca",
      "solana": "LinkhB3afbBKb2EQQu7s7umdZceV3wcvAUJhQAfQ23L",
      "hydration": "asset_registry%2F1000794",
      "near-protocol": "514910771af9ca656af840dff83e8264ecf986ca.factory.bridge.near",
      "base": "0x88fb150bdc53a65fe94dea0c9ba0a6daf8c6e196",
      "arbitrum-one": "0xf97f4df75117a78c1a5a0dbb814af92458539fb4",
      "huobi-token": "0x9e004545c59d359f6b7bfb06a26390b087717b42",
      "xdai": "0xe2e73a1c69ecf83f464efce6a5be353a37ca09b2",
      "optimistic-ethereum": "0x350a791bfc2c21f9ed5d10980dad2e2638ffa7f6",
      "harmony-shard-0": "0x218532a12a389a4a92fc0c5fb22901d1c19198aa",
      "osmosis": "ibc/D3327A763C23F01EC43D1F0DB3CEFEC390C362569B6FD191F40A5192F8960049",
      "milkomeda-cardano": "0xf390830df829cf22c53c8840554b98eafc5dcbc2",
      "energi": "0x68ca48ca2626c415a89756471d4ade2cc9034008",
      "sora": "0x008484148dcf23d1b48908393e7a00d5fdc3bf81029a73eeca62a15ebfb1205a",
      "binance-smart-chain": "0xf8a0bf9cf54bb92f17374d9e9a321e6a111a51bd",
      "fantom": "0xb3654dc3d10ea7645f8319668e8f54d2574fbdc8",
      "avalanche": "0x5947bb275c521040051d82396192181b413227a3",
      "polygon-pos": "0x53e0bca35ec356bd5dddfebbd1fc0fd03fabad39"
    },
    "website": "https://chain.link/",
    "reddit": "https://www.reddit.com/r/Chainlink/",
    "telegram": "https://t.me/chainlinkofficial",
    "twitter": "https://twitter.com/chainlink",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/877/large/chainlink-new-logo.png?1696502009",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 783803941,
    "high_24h": 15.81,
    "low_24h": 15.09,
    "price_change_24h": 0.07267442,
    "price_change_percentage_24h": 0.47462,
    "market_cap_change_24h": 50384452,
    "market_cap_change_percentage_24h": 0.48528,
    "circulating_supply": 678099970.4527868,
    "total_supply": 1000000000,
    "max_supply": 1000000000,
    "last_updated": "2025-07-12T01:59:56.822Z",
    "platforms": {
      "ethereum": "0x514910771af9ca656af840dff83e8264ecf986ca",
      "solana": "LinkhB3afbBKb2EQQu7s7umdZceV3wcvAUJhQAfQ23L",
      "hydration": "asset_registry%2F1000794",
      "near-protocol": "514910771af9ca656af840dff83e8264ecf986ca.factory.bridge.near",
      "base": "0x88fb150bdc53a65fe94dea0c9ba0a6daf8c6e196",
      "arbitrum-one": "0xf97f4df75117a78c1a5a0dbb814af92458539fb4",
      "huobi-token": "0x9e004545c59d359f6b7bfb06a26390b087717b42",
      "xdai": "0xe2e73a1c69ecf83f464efce6a5be353a37ca09b2",
      "optimistic-ethereum": "0x350a791bfc2c21f9ed5d10980dad2e2638ffa7f6",
      "harmony-shard-0": "0x218532a12a389a4a92fc0c5fb22901d1c19198aa",
      "osmosis": "ibc/D3327A763C23F01EC43D1F0DB3CEFEC390C362569B6FD191F40A5192F8960049",
      "milkomeda-cardano": "0xf390830df829cf22c53c8840554b98eafc5dcbc2",
      "energi": "0x68ca48ca2626c415a89756471d4ade2cc9034008",
      "sora": "0x008484148dcf23d1b48908393e7a00d5fdc3bf81029a73eeca62a15ebfb1205a",
      "binance-smart-chain": "0xf8a0bf9cf54bb92f17374d9e9a321e6a111a51bd",
      "fantom": "0xb3654dc3d10ea7645f8319668e8f54d2574fbdc8",
      "avalanche": "0x5947bb275c521040051d82396192181b413227a3",
      "polygon-pos": "0x53e0bca35ec356bd5dddfebbd1fc0fd03fabad39"
    }
  },
  "d1597d6f73f6521b": {
    "name": "Avalanche",
    "symbol": "avax",
    "price": 20.86,
    "livePrice": {
      "value": 20.86,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=avalanche-2&vs_currencies=usd"
    },
    "rank": 19,
    "cap": 8811184486,
    "addedDate": "1752285633090",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Avalanche is a high throughput smart contract blockchain platform. Validators secure the network through a proof-of-stake consensus protocol. It is said to be fast, low cost, and environmental friendly.",
    "explorerLink": "https://snowtrace.io/",
    "address": {},
    "website": "https://www.avax.network",
    "reddit": "https://www.reddit.com/r/Avax",
    "telegram": "https://t.me/avalancheavax",
    "twitter": "https://twitter.com/avax",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/avax",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12559/large/Avalanche_Circle_RedWhite_Trans.png?1696512369",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 761933990,
    "high_24h": 21.45,
    "low_24h": 20.41,
    "price_change_24h": 0.06732172,
    "price_change_percentage_24h": 0.32381,
    "market_cap_change_24h": 38189425,
    "market_cap_change_percentage_24h": 0.43531,
    "circulating_supply": 422276596.0335201,
    "total_supply": 457279296.0335201,
    "max_supply": 720000000,
    "last_updated": "2025-07-12T01:59:41.991Z",
    "platforms": {}
  },
  "fcd36358838fc8a8": {
    "name": "LEO Token",
    "symbol": "leo",
    "price": 9.09,
    "livePrice": {
      "value": 9.09,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=leo-token&vs_currencies=usd"
    },
    "rank": 20,
    "cap": 8392296064,
    "addedDate": "1752285648183",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2019-05-20",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://eosflare.io/account/bitfinexleo1",
    "address": {
      "ethereum": "0x2af5d2ad76741191d15dfe7bf6ac92d4bd912ca3",
      "sora": "0x009e199267a6a2c8ae075bb8d4c40ee8d05c1b769085ee59ce98e50c2b2d8756"
    },
    "website": "https://www.bitfinex.com/",
    "reddit": "https://www.reddit.com/r/bitfinex/",
    "telegram": "https://t.me/bitfinex",
    "twitter": "https://twitter.com/bitfinex",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/8418/large/leo-token.png?1696508607",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 5704467,
    "high_24h": 9.1,
    "low_24h": 8.93,
    "price_change_24h": 0.066719,
    "price_change_percentage_24h": 0.73923,
    "market_cap_change_24h": 57215514,
    "market_cap_change_percentage_24h": 0.68644,
    "circulating_supply": 923084745.9,
    "total_supply": 985239504,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:00:39.118Z",
    "platforms": {
      "ethereum": "0x2af5d2ad76741191d15dfe7bf6ac92d4bd912ca3",
      "sora": "0x009e199267a6a2c8ae075bb8d4c40ee8d05c1b769085ee59ce98e50c2b2d8756"
    }
  },
  "c0720aebe1d88fa5": {
    "name": "Hedera",
    "symbol": "hbar",
    "price": 0.198994,
    "livePrice": {
      "value": 0.198994,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=hedera-hashgraph&vs_currencies=usd"
    },
    "rank": 21,
    "cap": 8384466644,
    "addedDate": "1752285663347",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Hedera is a decentralized public network where developers can build secure, fair applications with near real-time consensus. The platform is owned and governed by a council of global innovators including Avery Dennison, Boeing, Deutsche Telekom, DLA Piper, FIS (WorldPay), Google, IBM, LG Electronics, Magalu, Nomura, Swirlds, Tata Communications, University College London (UCL), Wipro, and Zain Group. \r\n\r\nThe Hedera Consensus Service (HCS) acts as a trust layer for any application or permissioned network and allows for the creation of an immutable and verifiable log of messages. Application messages are submitted to the Hedera network for consensus, given a trusted timestamp, and fairly ordered. Use HCS to track assets across a supply chain, create auditable logs of events in an advertising platform, or even use it as a decentralized ordering service.\r\n\r\n",
    "explorerLink": "https://hashscan.io/",
    "address": {},
    "website": "https://www.hedera.com/",
    "reddit": "https://www.reddit.com/r/Hedera/",
    "telegram": "https://t.me/hederahashgraph",
    "twitter": "https://twitter.com/hedera",
    "insta": "",
    "youtube": "",
    "discord": "https://hedera.com/discord",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/3688/large/hbar.png?1696504364",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 829501438,
    "high_24h": 0.20838,
    "low_24h": 0.190571,
    "price_change_24h": 0.00388769,
    "price_change_percentage_24h": 1.9926,
    "market_cap_change_24h": 130117579,
    "market_cap_change_percentage_24h": 1.57635,
    "circulating_supply": 42391439526.70038,
    "total_supply": 50000000000,
    "max_supply": 50000000000,
    "last_updated": "2025-07-12T02:00:16.771Z",
    "platforms": {}
  },
  "b01fe03e35d82beb": {
    "name": "Wrapped eETH",
    "symbol": "weeth",
    "price": 3175.6,
    "livePrice": {
      "value": 3175.6,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=wrapped-eeth&vs_currencies=usd"
    },
    "rank": 22,
    "cap": 8034940028,
    "addedDate": "1752285678602",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Ether.fi's eETH is a decentralized, non-custodial liquid staking token that enables Ethereum holders to earn staking rewards while maintaining full liquidity and control over their assets. eETH along with its wrapped non-rebasing version, weETH, integrates seamlessly with the Ethereum ecosystem, offering users a flexible and secure way to contribute to network validation and participate in the DeFi space. ",
    "explorerLink": "https://etherscan.io/token/0xcd5fe23c85820f7b72d0926fc9b05b43e359b7ee",
    "address": {
      "ethereum": "0xcd5fe23c85820f7b72d0926fc9b05b43e359b7ee",
      "arbitrum-one": "0x35751007a407ca6feffe80b3cb397736d2cf4dbe"
    },
    "website": "https://www.ether.fi/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/+C3fpSjmPqzA5NTVh",
    "twitter": "https://twitter.com/ether_fi",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/zqGzcuQWvD",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/33033/large/weETH.png?1701438396",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 13543630,
    "high_24h": 3251.54,
    "low_24h": 3140.63,
    "price_change_24h": 12.7,
    "price_change_percentage_24h": 0.40157,
    "market_cap_change_24h": 47987986,
    "market_cap_change_percentage_24h": 0.60083,
    "circulating_supply": 2528911.481595312,
    "total_supply": 2528911.481595312,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:01:07.064Z",
    "platforms": {
      "ethereum": "0xcd5fe23c85820f7b72d0926fc9b05b43e359b7ee",
      "arbitrum-one": "0x35751007a407ca6feffe80b3cb397736d2cf4dbe"
    }
  },
  "0918a389da214d2d": {
    "name": "Shiba Inu",
    "symbol": "shib",
    "price": 0.00001338,
    "livePrice": {
      "value": 0.00001338,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=shiba-inu&vs_currencies=usd"
    },
    "rank": 23,
    "cap": 7886397240,
    "addedDate": "1752285693697",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Shiba Inu (SHIB) is a meme token which began as a fun currency and has now transformed into a decentralized ecosystem. During the initial launch, 50% of the supply was allocated into Vitalik Buterin's ethereum wallet. \r\n\r\nAs a result of that, Vitalik proceeded to donate 10% of his SHIB holdings to a COVID-19 relief effort in India and the remaining 40% is burnt forever. That donation was worth about $1 billion at that time, which makes it one of the largest donation ever in the world.\r\n\r\nWhat is the Shiba Inu community working on right now? The Shiba Inu team launched a decentralized exchange called Shibaswap with 2 new tokens, LEASH and BONE. LEASH is a scarce supply token that is used to offer incentives on Shibaswap. BONE is the governance token for holders to vote on proposals on Doggy DAO.",
    "explorerLink": "https://etherscan.io/token/0x95ad61b0a150d79219dcf64e1e6cc01f0b64c4ce",
    "address": {
      "ethereum": "0x95ad61b0a150d79219dcf64e1e6cc01f0b64c4ce"
    },
    "website": "https://shibatoken.com/",
    "reddit": "https://www.reddit.com/r/SHIBArmy/",
    "telegram": "https://t.me/ShibaInu_Dogecoinkiller",
    "twitter": "https://twitter.com/shibarium_",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/shibatoken",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/11939/large/shiba.png?1696511800",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 444412744,
    "high_24h": 0.00001382,
    "low_24h": 0.00001308,
    "price_change_24h": -3.4259518532e-8,
    "price_change_percentage_24h": -0.25535,
    "market_cap_change_24h": -9121673.773796,
    "market_cap_change_percentage_24h": -0.11553,
    "circulating_supply": 589247015504618.6,
    "total_supply": 589501667240494.6,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:00:20.067Z",
    "platforms": {
      "ethereum": "0x95ad61b0a150d79219dcf64e1e6cc01f0b64c4ce"
    }
  },
  "ce31c3ddd3e4448c": {
    "name": "Toncoin",
    "symbol": "ton",
    "price": 3,
    "livePrice": {
      "value": 3,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=the-open-network&vs_currencies=usd"
    },
    "rank": 24,
    "cap": 7398443365,
    "addedDate": "1752285708783",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "the-open-network",
    "launchDate": "",
    "token": true,
    "description": "TON (The Open Network) is a general-purpose blockchain that allows developers to build decentralized apps and tokens.",
    "explorerLink": "https://tonviewer.com/EQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM9c",
    "address": {
      "the-open-network": "EQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM9c",
      "ethereum": "0x582d872a1b094fc48f5de31d3b73f2d9be47def1",
      "binance-smart-chain": "0x76a797a59ba2c17726896976b7b3747bfd1d220f"
    },
    "website": "https://ton.org/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/toncoin",
    "twitter": "https://twitter.com/ton_blockchain",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/17980/large/photo_2024-09-10_17.09.00.jpeg?1725963446",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 445438821,
    "high_24h": 3.01,
    "low_24h": 2.92,
    "price_change_24h": 0.0411118,
    "price_change_percentage_24h": 1.39076,
    "market_cap_change_24h": 109371376,
    "market_cap_change_percentage_24h": 1.50048,
    "circulating_supply": 2469410061.869867,
    "total_supply": 5134965479.506155,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:01:06.775Z",
    "platforms": {
      "the-open-network": "EQAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAAM9c",
      "ethereum": "0x582d872a1b094fc48f5de31d3b73f2d9be47def1",
      "binance-smart-chain": "0x76a797a59ba2c17726896976b7b3747bfd1d220f"
    }
  },
  "cefe932c03887894": {
    "name": "USDS",
    "symbol": "usds",
    "price": 0.999856,
    "livePrice": {
      "value": 0.999856,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=usds&vs_currencies=usd"
    },
    "rank": 25,
    "cap": 7354017189,
    "addedDate": "1752285723940",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etherscan.io/token/0xdc035d45d973e3ec169d2276ddab16f1e407384f",
    "address": {
      "ethereum": "0xdc035d45d973e3ec169d2276ddab16f1e407384f",
      "arbitrum-one": "0x6491c05a82219b8d1479057361ff1654749b876b",
      "base": "0x820c137fa70c8691f0e44dc420a5e53c168921dc",
      "solana": "USDSwr9ApdHk5bvJKMjzff41FfuX8bSxdKcR81vTwcA"
    },
    "website": "https://sky.money/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/SkyEcosystem",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/39926/large/usds.webp?1726666683",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 10890638,
    "high_24h": 1,
    "low_24h": 0.999616,
    "price_change_24h": 0.00001992,
    "price_change_percentage_24h": 0.00199,
    "market_cap_change_24h": -99374258.100104,
    "market_cap_change_percentage_24h": -1.33328,
    "circulating_supply": 7355076657.504111,
    "total_supply": 7355076657.504111,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:00:50.860Z",
    "platforms": {
      "ethereum": "0xdc035d45d973e3ec169d2276ddab16f1e407384f",
      "arbitrum-one": "0x6491c05a82219b8d1479057361ff1654749b876b",
      "base": "0x820c137fa70c8691f0e44dc420a5e53c168921dc",
      "solana": "USDSwr9ApdHk5bvJKMjzff41FfuX8bSxdKcR81vTwcA"
    }
  },
  "161866ee89e3c6ee": {
    "name": "WETH",
    "symbol": "weth",
    "price": 2963.56,
    "livePrice": {
      "value": 2963.56,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=weth&vs_currencies=usd"
    },
    "rank": 26,
    "cap": 7316772551,
    "addedDate": "1752285739024",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2016-06-17",
    "token": true,
    "description": "What is WETH (Wrapped ETH)?\r\nWETH is the tokenized/packaged form of ETH that you use to pay for items when you interact with Ethereum dApps. WETH follows the ERC-20 token standards, enabling it to achieve interoperability with other ERC-20 tokens. \r\n\r\nThis offers more utility to holders as they can use it across networks and dApps. You can stake, yield farm, lend, and provide liquidity to various liquidity pools with WETH. \r\n\r\nAlso, unlike ETH, which doesn’t conform to its own ERC-20 standard and thus has lower interoperability as it can’t be used on other chains besides Ethereum, WETH can be used on cheaper and high throughput alternatives like Binance, Polygon, Solana, and Cardano.\r\n\r\nThe price of WETH will always be the same as ETH because it maintains a 1:1 wrapping ratio.\r\n\r\nHow to Wrap ETH?\r\nCustodians wrap and unwrap ETH. To wrap ETH, you send ETH to a custodian. This can be a multi-sig wallet, a Decentralized Autonomous Organization (DAO), or a smart contract. After connecting your web3 wallet to a DeFi exchange, you enter the amount of ETH you wish to wrap and click the swap function. Once the transaction is confirmed, you will receive WETH tokens equivalent to the ETH that you’ve swapped.\r\n\r\nOn a centralized exchange, the exchange burns the deposited ETH and mints a wrapped form for you. And when you want to unwrap it, the exchange will burn the wrapped version and mint the ETH on your behalf.\r\n\r\nWhat’s Next for WETH?\r\nAccording to the developers, hopefully there will be no future for WETH. According to the website, steps are being taken to update ETH to make it compliant with its own ERC-20 standards. ",
    "explorerLink": "https://etherscan.io/token/0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2",
    "address": {
      "ethereum": "0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2",
      "tron": "THb4CqiFdwNHsWsQCs4JhzwjMWys4aqCbF"
    },
    "website": "https://ethereum.org/en/wrapped-eth",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/2518/large/weth.png?1696503332",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 332812858,
    "high_24h": 3032.29,
    "low_24h": 2932.72,
    "price_change_24h": 7.5,
    "price_change_percentage_24h": 0.25366,
    "market_cap_change_24h": -143336373.501087,
    "market_cap_change_percentage_24h": -1.92137,
    "circulating_supply": 2467998.05515363,
    "total_supply": 2467998.05515363,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:01:07.570Z",
    "platforms": {
      "ethereum": "0xc02aaa39b223fe8d0a0e5c4f27ead9083c756cc2",
      "tron": "THb4CqiFdwNHsWsQCs4JhzwjMWys4aqCbF"
    }
  },
  "815afc0c892f8ba3": {
    "name": "Litecoin",
    "symbol": "ltc",
    "price": 95.01,
    "livePrice": {
      "value": 95.01,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=litecoin&vs_currencies=usd"
    },
    "rank": 27,
    "cap": 7226498516,
    "addedDate": "1752285754106",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2011-10-08",
    "token": true,
    "description": "Litecoin is a peer-to-peer cryptocurrency created by Charlie Lee. It was created based on the Bitcoin protocol but differs in terms of the hashing algorithm used. Litecoin uses the memory intensive Scrypt proof of work mining algorithm. Scrypt allows consumer-grade hardware such as GPU to mine those coins.\r\n\r\nWhy Litecoin?\r\nLitecoin is a cryptocurrency that has evolved from Bitcoin after its own popularity in the industry, this alternative, or ‘altcoin’ has emerged to allow investors to diversify their digital currency package, according to Investopedia. Litecoin is one of the most prominent altcoins and was created by former Google employee and Director of Engineering at Coinbase, Charlie Lee. Litecoin was the first to alter Bitcoin and the most significant difference is that it takes 2.5 minutes for Litecoin to generate a block, or transaction, in comparison to Bitcoin's 10 minutes.\r\n\r\n‘While this matters little to traders, miners who use hardware to run Bitcoin's network cannot switch over to Litecoin. This keeps bigger mining conglomerates away from Litecoin because they cannot easily optimize their profits by swapping to another coin, contributing to a more decentralized experience. Litecoin also has bigger blocks, and more coins in circulation, making it more affordable and swift when transacting,’ Investopedia explained.\r\n\r\nAs explained above, Litecoin can transact a lot faster than Bitcoin, but there are also a number of other characteristics that investors need to know before trading. Litecoin can handle higher volumes of transactions because of the capability of transacting faster and if Bitcoin attempted to transact on the scale of its altcoin, a code update would be needed. However, Litecoin’s blocks would be larger, but with more ‘orphaned blocks'. The faster block time of litecoin reduces the risk of double spending attacks - this is theoretical in the case of both networks having the same hashing power.\r\n\r\nLitecoin Technical Details:\r\nThe transaction confirmation time taken for Litecoin is about 2.5 minutes on average (as compared to Bitcoin's 10 minutes). The Litecoin network is scheduled to cap at 84 million currency units. \r\n\r\nLitecoin has inspired many other popular alternative currencies (eg. Dogecoin) because of its Scrypt hashing algorithm in order to prevent ASIC miners from mining those coins. However it is said that by the end of this year, Scrypt ASIC will enter the mass market.",
    "explorerLink": "https://blockchair.com/litecoin",
    "address": {},
    "website": "http://litecoin.org",
    "reddit": "https://www.reddit.com/r/litecoin/",
    "telegram": "",
    "twitter": "https://twitter.com/LTCFoundation",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/2/large/litecoin.png?1696501400",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 907670661,
    "high_24h": 97.77,
    "low_24h": 93.27,
    "price_change_24h": 0.10446636,
    "price_change_percentage_24h": 0.11008,
    "market_cap_change_24h": 8321562,
    "market_cap_change_percentage_24h": 0.11529,
    "circulating_supply": 76063926.98347135,
    "total_supply": 76064058.23347135,
    "max_supply": 84000000,
    "last_updated": "2025-07-12T02:00:57.350Z",
    "platforms": {}
  },
  "ccb6e229be40f418": {
    "name": "WhiteBIT Coin",
    "symbol": "wbt",
    "price": 46.66,
    "livePrice": {
      "value": 46.66,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=whitebit&vs_currencies=usd"
    },
    "rank": 28,
    "cap": 6724839810,
    "addedDate": "1752285769253",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "What is WhiteBIT Token?\r\n\r\nWBT is a utility token of the largest European cryptocurrency exchange, WhiteBIT. The platform was established in 2018 and has already become one of the leading crypto exchanges with 3+ mln users worldwide. WhiteBIT’s goal is to contribute to the mass adoption and popularization of blockchain technologies by implementing the most effective trading and staking tools on the most convenient terms. The most popular and efficient trading orders for spot and margin trading, up to 20x leverage for margin and perpetual Bitcoin futures trading, unique passive income tools, a referral program, and the lowest trading fees on the market are only part of the functionality available on WhiteBIT. Discover the full potential of the platform at the link: https://whitebit.com/.\r\n\r\nWBT is a full-fledged product of the whole WhiteBIT ecosystem that is integrated into all WhiteBIT services, making it easier for the users to interact on the platform. WBT is a solid base for dozens of blockchain startups, new projects, and fruitful trading. Moreover, WhiteBIT Token is a reliable asset that can be used for staking on its native platform, which provides numerous perks to its holders and owners. \r\n\r\nKey advantages:\r\n\r\nincreased referral interest rate (up to 50%);\r\ndecreased trading fees; \r\nfree daily ERC-20/ETH withdrawals;\r\nfree daily AML checks; \r\nintegration with the current and future products of WhiteBIT and much more.\r\n\r\nWBT tokenomics\r\n\r\nThe token supply is limited to 400 000 000 WBT, with no new tokens to be created in the future. 200M of this amount is treasury tokens that are backing the total amount and will be unlocked within the next three months after the launch. \r\n\r\nTrading competitions, airdrops, bounties, beneficial holding programs, and access to the token from other exchange platforms are part of activities associated with the WBT cryptocurrency available on WhiteBIT. \r\n",
    "explorerLink": "https://etherscan.io/token/0x925206b8a707096ed26ae47c84747fe0bb734f59",
    "address": {
      "ethereum": "0x925206b8a707096ed26ae47c84747fe0bb734f59",
      "tron": "TFptbWaARrWTX5Yvy3gNG5Lm8BmhPx82Bt"
    },
    "website": "https://whitebit.com/wbt",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/White_Bit",
    "twitter": "https://twitter.com/WhiteBit",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/27045/large/wbt_token.png?1696526096",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 43166390,
    "high_24h": 46.91,
    "low_24h": 46.57,
    "price_change_24h": -0.0394264489462,
    "price_change_percentage_24h": -0.08443,
    "market_cap_change_24h": -6822825.299096,
    "market_cap_change_percentage_24h": -0.10135,
    "circulating_supply": 144118517.10815412,
    "total_supply": 323668596,
    "max_supply": 400000000,
    "last_updated": "2025-07-12T02:02:28.725Z",
    "platforms": {
      "ethereum": "0x925206b8a707096ed26ae47c84747fe0bb734f59",
      "tron": "TFptbWaARrWTX5Yvy3gNG5Lm8BmhPx82Bt"
    }
  },
  "39ec9709d3503679": {
    "name": "Binance Bridged USDT (BNB Smart Chain)",
    "symbol": "bsc-usd",
    "price": 1,
    "livePrice": {
      "value": 1,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=binance-bridged-usdt-bnb-smart-chain&vs_currencies=usd"
    },
    "rank": 29,
    "cap": 6287349914,
    "addedDate": "1752285784516",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "binance-smart-chain",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://bscscan.com/token/0x55d398326f99059ff775485246999027b3197955",
    "address": {
      "binance-smart-chain": "0x55d398326f99059ff775485246999027b3197955"
    },
    "website": "https://bscscan.com/token/0x55d398326f99059ff775485246999027b3197955",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/35021/large/USDT.png?1707233575",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 4989464656,
    "high_24h": 1.005,
    "low_24h": 0.993887,
    "price_change_24h": 0.0003706,
    "price_change_percentage_24h": 0.03706,
    "market_cap_change_24h": 3474332,
    "market_cap_change_percentage_24h": 0.05529,
    "circulating_supply": 6284993699.453935,
    "total_supply": 6284993699.453935,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:02:56.692Z",
    "platforms": {
      "binance-smart-chain": "0x55d398326f99059ff775485246999027b3197955"
    }
  },
  "d7932ad2a78c06fb": {
    "name": "Monero",
    "symbol": "xmr",
    "price": 335.07,
    "livePrice": {
      "value": 335.07,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=monero&vs_currencies=usd"
    },
    "rank": 30,
    "cap": 6180862057,
    "addedDate": "1752285799611",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2014-04-18",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://monero.com/explorer",
    "address": {},
    "website": "https://getmonero.org",
    "reddit": "https://www.reddit.com/r/monero",
    "telegram": "",
    "twitter": "https://twitter.com/monero",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/69/large/monero_logo.png?1696501460",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 144313270,
    "high_24h": 334.65,
    "low_24h": 323.1,
    "price_change_24h": 5.66,
    "price_change_percentage_24h": 1.71859,
    "market_cap_change_24h": 107064674,
    "market_cap_change_percentage_24h": 1.76273,
    "circulating_supply": 18446744.07370955,
    "total_supply": 18446744.07370955,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:00:57.447Z",
    "platforms": {}
  },
  "d4728d5ff2f146f2": {
    "name": "Polkadot",
    "symbol": "dot",
    "price": 3.98,
    "livePrice": {
      "value": 3.98,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=polkadot&vs_currencies=usd"
    },
    "rank": 31,
    "cap": 6050784951,
    "addedDate": "1752285814757",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Polkadot is a platform that allows diverse blockchains to transfer messages, including value, in a trust-free fashion; sharing their unique features while pooling their security. In brief, Polkadot is a scalable heterogeneous multi-chain technology.\r\n\r\nPolkadot is heterogeneous because it is entirely flexible and makes no assumption about the nature or structure of the chains in the network. Even non-blockchain systems or data structures can become parachains if they fulfill a set of criteria.\r\n\r\nPolkadot may be considered equivalent to a set of independent chains (e.g. a set containing Ethereum, Ethereum Classic, Namecoin and Bitcoin) except with important additions: pooled security and trust-free interchain transactability.\r\n\r\nMany of the native parachains of Polkadot will be written using a Polkadot Runtime Environment SDK (e.g. Parity Technologies' Substrate).",
    "explorerLink": "http://polkascan.io/",
    "address": {},
    "website": "https://polkadot.com/",
    "reddit": "https://www.reddit.com/r/Polkadot",
    "telegram": "https://t.me/PolkadotOfficial",
    "twitter": "https://twitter.com/Polkadot",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/polkadot",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12171/large/polkadot.png?1696512008",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 552971356,
    "high_24h": 4.08,
    "low_24h": 3.86,
    "price_change_24h": 0.0814217,
    "price_change_percentage_24h": 2.09043,
    "market_cap_change_24h": 122085213,
    "market_cap_change_percentage_24h": 2.05922,
    "circulating_supply": 1522267060,
    "total_supply": 1522267060,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:03:08.403Z",
    "platforms": {}
  },
  "3650ce6385078d69": {
    "name": "Coinbase Wrapped BTC",
    "symbol": "cbbtc",
    "price": 117671,
    "livePrice": {
      "value": 117671,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=coinbase-wrapped-btc&vs_currencies=usd"
    },
    "rank": 32,
    "cap": 6004469797,
    "addedDate": "1752285829929",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Coinbase Wrapped BTC (\"cbBTC\") is a token that is backed 1:1 by native Bitcoin (BTC) held by Coinbase, meaning that for all cbBTC in circulation, there is an equivalent amount of BTC held in a secure custody solution (including cold storage) provided by Coinbase. Wrapped assets, like cbBTC, are transferable tokens that are redeemable for the underlying asset. Coinbase customers can unwrap cbBTC and redeem a corresponding amount of the underlying BTC simply by depositing the cbBTC into their Coinbase accounts. cbBTC is built to be seamlessly compatible with DeFi applications, giving customers the option to tap into DeFi and unlock financial utility. cbBTC removes a key point of friction by allowing customers to use Bitcoin they already hold in new ways onchain. cbBTC is built to be seamlessly compatible with DeFi applications, so users can now tap into novel DeFi use cases like providing their Bitcoin as liquidity to DeFi protocols, using it as collateral to borrow other crypto assets, or spending it as a payment method. Wrapped assets like cbBTC are a mature concept in the crypto world, helping to bring more liquid assets onchain and facilitate an expansive financial ecosystem.\r\n",
    "explorerLink": "https://etherscan.io/token/0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
    "address": {
      "ethereum": "0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
      "base": "0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
      "arbitrum-one": "0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
      "solana": "cbbtcf3aa214zXHbiAZQwf4122FBYbraNdFqgw4iMij"
    },
    "website": "https://www.coinbase.com/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/coinbase",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/40143/large/cbbtc.webp?1726136727",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 484516331,
    "high_24h": 118910,
    "low_24h": 115863,
    "price_change_24h": 1712.85,
    "price_change_percentage_24h": 1.47713,
    "market_cap_change_24h": 60969113,
    "market_cap_change_percentage_24h": 1.02581,
    "circulating_supply": 51034.05839891,
    "total_supply": 51034.05839891,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:03:05.017Z",
    "platforms": {
      "ethereum": "0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
      "base": "0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
      "arbitrum-one": "0xcbb7c0000ab88b473b1f5afd9ef808440eed33bf",
      "solana": "cbbtcf3aa214zXHbiAZQwf4122FBYbraNdFqgw4iMij"
    }
  },
  "ffb9516f20520dec": {
    "name": "Ethena USDe",
    "symbol": "usde",
    "price": 1.001,
    "livePrice": {
      "value": 1.001,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ethena-usde&vs_currencies=usd"
    },
    "rank": 33,
    "cap": 5330881771,
    "addedDate": "1752285845031",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Ethena is a delta-hedged synthetic dollar with native crypto yield derived from staking and perpetual funding rate",
    "explorerLink": "https://etherscan.io/token/0x4c9edd5852cd905f086c759e8383e09bff1e68b3",
    "address": {
      "ethereum": "0x4c9edd5852cd905f086c759e8383e09bff1e68b3",
      "the-open-network": "EQAIb6KmdfdDR7CN1GBqVJuP25iCnLKCvBlJ07Evuu2dzP5f",
      "aptos": "0xf37a8864fe737eb8ec2c2931047047cbaed1beed3fb0e5b7c5526dafd3b9c2e9",
      "zircuit": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "zksync": "0x39fe7a0dacce31bd90418e3e659fb0b5f0b3db0d",
      "solana": "DEkqHyPN7GMRJ5cArtQFAWefqbZb33Hyf6s5iCwjEonT"
    },
    "website": "https://app.ethena.fi/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/ethena_labs",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/33613/large/usde.png?1733810059",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 232852479,
    "high_24h": 1.003,
    "low_24h": 0.99781,
    "price_change_24h": 0.00062309,
    "price_change_percentage_24h": 0.06227,
    "market_cap_change_24h": 7328779,
    "market_cap_change_percentage_24h": 0.13767,
    "circulating_supply": 5324424743.634852,
    "total_supply": 5324424743.634852,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:03:56.992Z",
    "platforms": {
      "ethereum": "0x4c9edd5852cd905f086c759e8383e09bff1e68b3",
      "the-open-network": "EQAIb6KmdfdDR7CN1GBqVJuP25iCnLKCvBlJ07Evuu2dzP5f",
      "aptos": "0xf37a8864fe737eb8ec2c2931047047cbaed1beed3fb0e5b7c5526dafd3b9c2e9",
      "zircuit": "0x5d3a1ff2b6bab83b63cd9ad0787074081a52ef34",
      "zksync": "0x39fe7a0dacce31bd90418e3e659fb0b5f0b3db0d",
      "solana": "DEkqHyPN7GMRJ5cArtQFAWefqbZb33Hyf6s5iCwjEonT"
    }
  },
  "b0b4ffbe8e27bb57": {
    "name": "Uniswap",
    "symbol": "uni",
    "price": 8.75,
    "livePrice": {
      "value": 8.75,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=uniswap&vs_currencies=usd"
    },
    "rank": 34,
    "cap": 5254376877,
    "addedDate": "1752285860078",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "UNI is the governance token for Uniswap, an Automated Market Marker DEX on the Ethereum blockchain. The UNI token allows token holders to participate in the governance of the protocol. Key decisions such as usage of the treasury or future upgrades can be decided through a governance vote.",
    "explorerLink": "https://etherscan.io/token/0x1f9840a85d5af5bf1d1762f925bdaddc4201f984",
    "address": {
      "ethereum": "0x1f9840a85d5af5bf1d1762f925bdaddc4201f984",
      "xdai": "0x4537e328bf7e4efa29d05caea260d7fe26af9d74",
      "unichain": "0x8f187aa05619a017077f5308904739877ce9ea21",
      "near-protocol": "1f9840a85d5af5bf1d1762f925bdaddc4201f984.factory.bridge.near",
      "arbitrum-one": "0xfa7f8980b0f1e64a2062791cc3b0871572f1f7f0",
      "huobi-token": "0x22c54ce8321a4015740ee1109d9cbc25815c46e6",
      "optimistic-ethereum": "0x6fd9d7ad17242c41f7131d257212c54a0e816691",
      "harmony-shard-0": "0x90d81749da8867962c760414c1c25ec926e889b6",
      "energi": "0x665b3a802979ec24e076c80025bff33c18eb6007",
      "sora": "0x009be848df92a400da2f217256c88d1a9b1a0304f9b3e90991a67418e1d3b08c",
      "binance-smart-chain": "0xbf5140a22578168fd562dccf235e5d43a02ce9b1",
      "avalanche": "0x8ebaf22b6f053dffeaf46f4dd9efa95d89ba8580",
      "polygon-pos": "0xb33eaad8d922b1083446dc23f610c2567fb5180f"
    },
    "website": "https://uniswap.org/",
    "reddit": "https://www.reddit.com/r/Uniswap",
    "telegram": "",
    "twitter": "https://twitter.com/Uniswap",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/FCfyBSbCU5",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12504/large/uniswap-logo.png?1720676669",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 911842225,
    "high_24h": 9.01,
    "low_24h": 8.36,
    "price_change_24h": 0.314411,
    "price_change_percentage_24h": 3.7287,
    "market_cap_change_24h": 189015662,
    "market_cap_change_percentage_24h": 3.73153,
    "circulating_supply": 600483073.71,
    "total_supply": 1000000000,
    "max_supply": 1000000000,
    "last_updated": "2025-07-12T02:03:44.024Z",
    "platforms": {
      "ethereum": "0x1f9840a85d5af5bf1d1762f925bdaddc4201f984",
      "xdai": "0x4537e328bf7e4efa29d05caea260d7fe26af9d74",
      "unichain": "0x8f187aa05619a017077f5308904739877ce9ea21",
      "near-protocol": "1f9840a85d5af5bf1d1762f925bdaddc4201f984.factory.bridge.near",
      "arbitrum-one": "0xfa7f8980b0f1e64a2062791cc3b0871572f1f7f0",
      "huobi-token": "0x22c54ce8321a4015740ee1109d9cbc25815c46e6",
      "optimistic-ethereum": "0x6fd9d7ad17242c41f7131d257212c54a0e816691",
      "harmony-shard-0": "0x90d81749da8867962c760414c1c25ec926e889b6",
      "energi": "0x665b3a802979ec24e076c80025bff33c18eb6007",
      "sora": "0x009be848df92a400da2f217256c88d1a9b1a0304f9b3e90991a67418e1d3b08c",
      "binance-smart-chain": "0xbf5140a22578168fd562dccf235e5d43a02ce9b1",
      "avalanche": "0x8ebaf22b6f053dffeaf46f4dd9efa95d89ba8580",
      "polygon-pos": "0xb33eaad8d922b1083446dc23f610c2567fb5180f"
    }
  },
  "b47b6feb6e4b8905": {
    "name": "Bitget Token",
    "symbol": "bgb",
    "price": 4.49,
    "livePrice": {
      "value": 4.49,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bitget-token&vs_currencies=usd"
    },
    "rank": 35,
    "cap": 5264416288,
    "addedDate": "1752285875255",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Bitget Token (BGB) is the exclusive platform token for the centralized exchange Bitget and the decentralized Bitget Wallet ecosystem. As a utility token, it can be used for trading, paying transaction fees, participating in platform activities, and accessing perks. \r\n\r\nThe initial supply of BGB is fixed at 2 billion tokens, but 800 million BGB (40% of the total supply) were proactively burned by the Bitget team on December 30, 2024, reducing the total supply to 1.2 billion tokens, all of which are now in full circulation. Starting in 2025, Bitget plans to introduce a quarterly buyback and burn mechanism, transitioning BGB into a deflationary model.\r\n\r\nBitget Token (BGB) stands out by unlocking access to a wide range of benefits across Bitget's centralized and decentralized ecosystems. Current perks include token farming, earning passive income through staking, early access to high-potential projects on Bitget Launchpad and Launchpool, fee discounts, and exclusive VIP privileges. \r\n\r\nFuture use cases include on-chain trading, DeFi applications, gas fees, and project airdrop eligibility. Additionally, BGB enables payments with discounts via Bitget Pay and Card, offering premium benefits and expanded services. With its versatile applications, BGB enhances user experience and boosts adoption across Bitget's ecosystem.\r\nBitget Token (BGB) can be purchased directly on the Bitget exchange. BGB is also available for trading on Bitfinex and MEXC. ",
    "explorerLink": "https://etherscan.io/token/0x54d2252757e1672eead234d27b1270728ff90581",
    "address": {
      "ethereum": "0x54d2252757e1672eead234d27b1270728ff90581",
      "morph-l2": "0x55d1f1879969bdbb9960d269974564c58dbc3238"
    },
    "website": "https://partner.bitget.com/bg/2LAE9K",
    "reddit": "https://www.reddit.com/r/BitgetReddit",
    "telegram": "https://t.me/Bitget_NewMarket_Bot",
    "twitter": "https://twitter.com/bitgetglobal",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/11610/large/Bitget_logo.png?1736925727",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 229265040,
    "high_24h": 4.62,
    "low_24h": 4.47,
    "price_change_24h": -0.048834984108789,
    "price_change_percentage_24h": -1.07484,
    "market_cap_change_24h": -56001945.426724,
    "market_cap_change_percentage_24h": -1.05259,
    "circulating_supply": 1169993089.2,
    "total_supply": 1169993089.2,
    "max_supply": 2000000000,
    "last_updated": "2025-07-12T02:03:59.351Z",
    "platforms": {
      "ethereum": "0x54d2252757e1672eead234d27b1270728ff90581",
      "morph-l2": "0x55d1f1879969bdbb9960d269974564c58dbc3238"
    }
  },
  "e9a68801c652998b": {
    "name": "Pepe",
    "symbol": "pepe",
    "price": 0.00001241,
    "livePrice": {
      "value": 0.00001241,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=pepe&vs_currencies=usd"
    },
    "rank": 36,
    "cap": 5222025906,
    "addedDate": "1752285890331",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "What is the project about?\r\nPepe is a community based meme token surround the iconic meme Pepe the frog. Pepe aims to leverage the power of such an iconic meme to become the most memeable memecoin in existence. \r\n\r\nWhat makes your project unique?\r\nPepe is here to make memecoins great again. Ushering in a new paradigm for memecoins, Pepe represents the memecoin in it's purest simplicity. With zero taxes, liquidity locked forever, and contract immutable, Pepe is for the people, forever. Pepe is about culture, rallying together a community to have fun and enjoy memes, fueled purely by memetic power. \r\n\r\nHistory of your project.\r\nPepe was stealth launched on Friday, April 14th, 2023. \r\n\r\nWhat’s next for your project?\r\nPepe will focus on developing a tight-knit community around the token and building resources to enrich the communities knowledge and success in crypto through a token gated group, newsletter, and more tools. \r\n\r\nWhat can your token be used for?\r\nPepe can be used to speculate on the power of memes, and does not pretend to be anything more. \r\n",
    "explorerLink": "https://etherscan.io/token/0x6982508145454ce325ddbe47a25d4ec3d2311933",
    "address": {
      "ethereum": "0x6982508145454ce325ddbe47a25d4ec3d2311933",
      "arbitrum-one": "0x25d887ce7a35172c62febfd67a1856f20faebb00",
      "binance-smart-chain": "0x25d887ce7a35172c62febfd67a1856f20faebb00"
    },
    "website": "https://www.pepe.vip/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/pepecoineth",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/29850/large/pepe-token.jpeg?1696528776",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 8039674348,
    "high_24h": 0.00001305,
    "low_24h": 0.00001211,
    "price_change_24h": -4.1540929425e-8,
    "price_change_percentage_24h": -0.33354,
    "market_cap_change_24h": -18022616.948171,
    "market_cap_change_percentage_24h": -0.34394,
    "circulating_supply": 420690000000000,
    "total_supply": 420690000000000,
    "max_supply": 420690000000000,
    "last_updated": "2025-07-12T02:03:34.747Z",
    "platforms": {
      "ethereum": "0x6982508145454ce325ddbe47a25d4ec3d2311933",
      "arbitrum-one": "0x25d887ce7a35172c62febfd67a1856f20faebb00",
      "binance-smart-chain": "0x25d887ce7a35172c62febfd67a1856f20faebb00"
    }
  },
  "663dca4fd28251a3": {
    "name": "Aave",
    "symbol": "aave",
    "price": 299.53,
    "livePrice": {
      "value": 299.53,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=aave&vs_currencies=usd"
    },
    "rank": 37,
    "cap": 4552421231,
    "addedDate": "1752285905472",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "Aave is a decentralized money market protocol where users can lend and borrow cryptocurrency across 20 different assets as collateral. The protocol has a native token called AAVE, which is also a governance token that lets the community decide the direction of the protocol in a collective manner. Lenders can earn interest by providing liquidity to the market, while borrowers can borrow by collateralizing their cryptoassets to take out loans from the liquidity pools.\r\n\r\n",
    "explorerLink": "https://etherscan.io/token/0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9",
    "address": {
      "ethereum": "0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9",
      "base": "0x63706e401c06ac8513145b7687a14804d17f814b",
      "hydration": "asset_registry%2F1000624",
      "near-protocol": "7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9.factory.bridge.near",
      "optimistic-ethereum": "0x76fb31fb4af56892a25e32cfc43de717950c9278",
      "arbitrum-one": "0xba5ddd1f9d7f570dc94a51479a000e3bce967196",
      "huobi-token": "0x202b4936fe1a82a4965220860ae46d7d3939bb25",
      "harmony-shard-0": "0xcf323aad9e522b93f11c352caa519ad0e14eb40f",
      "energi": "0xa7f2f790355e0c32cab03f92f6eb7f488e6f049a",
      "sora": "0x0091bd8d8295b25cab5a7b8b0e44498e678cfc15d872ede3215f7d4c7635ba36",
      "binance-smart-chain": "0xfb6115445bff7b52feb98650c87f44907e58f802",
      "fantom": "0x6a07a792ab2965c72a5b8088d3a069a7ac3a993b",
      "avalanche": "0x63a72806098bd3d9520cc43356dd78afe5d386d9",
      "polygon-pos": "0xd6df932a45c0f255f85145f286ea0b292b21c90b"
    },
    "website": "https://app.aave.com/",
    "reddit": "https://www.reddit.com/r/Aave_Official",
    "telegram": "https://t.me/Aavesome",
    "twitter": "https://twitter.com/aave",
    "insta": "",
    "youtube": "",
    "discord": "https://aave.com/discord",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/12645/large/aave-token-round.png?1720472354",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 855821164,
    "high_24h": 316.87,
    "low_24h": 294.15,
    "price_change_24h": -7.1880370381591,
    "price_change_percentage_24h": -2.34353,
    "market_cap_change_24h": -104694094.855072,
    "market_cap_change_percentage_24h": -2.24805,
    "circulating_supply": 15193971.704662532,
    "total_supply": 16000000,
    "max_supply": 16000000,
    "last_updated": "2025-07-12T02:04:25.152Z",
    "platforms": {
      "ethereum": "0x7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9",
      "base": "0x63706e401c06ac8513145b7687a14804d17f814b",
      "hydration": "asset_registry%2F1000624",
      "near-protocol": "7fc66500c84a76ad7e9c93437bfc5ac33e2ddae9.factory.bridge.near",
      "optimistic-ethereum": "0x76fb31fb4af56892a25e32cfc43de717950c9278",
      "arbitrum-one": "0xba5ddd1f9d7f570dc94a51479a000e3bce967196",
      "huobi-token": "0x202b4936fe1a82a4965220860ae46d7d3939bb25",
      "harmony-shard-0": "0xcf323aad9e522b93f11c352caa519ad0e14eb40f",
      "energi": "0xa7f2f790355e0c32cab03f92f6eb7f488e6f049a",
      "sora": "0x0091bd8d8295b25cab5a7b8b0e44498e678cfc15d872ede3215f7d4c7635ba36",
      "binance-smart-chain": "0xfb6115445bff7b52feb98650c87f44907e58f802",
      "fantom": "0x6a07a792ab2965c72a5b8088d3a069a7ac3a993b",
      "avalanche": "0x63a72806098bd3d9520cc43356dd78afe5d386d9",
      "polygon-pos": "0xd6df932a45c0f255f85145f286ea0b292b21c90b"
    }
  },
  "0c160719f1924ae7": {
    "name": "Bittensor",
    "symbol": "tao",
    "price": 398.45,
    "livePrice": {
      "value": 398.45,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=bittensor&vs_currencies=usd"
    },
    "rank": 38,
    "cap": 3737881258,
    "addedDate": "1752285920588",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "Bittensor is an open-source protocol that powers a decentralized, blockchain-based machine learning network. Machine learning models train collaboratively and are rewarded in TAO according to the informational value they offer the collective. TAO also grants external access, allowing users to extract information from the network while tuning its activities to their needs.\r\n\r\nUltimately, BitTensors vision is to create a pure market for artificial intelligence, an incentivized arena in which consumers and producers of this valuable commodity can interact in a trustless, open and transparent context.\r\n\r\nBittensor enables:\r\n\r\n-A novel, optimized strategy for the development and distribution of artificial intelligence technology by leveraging the possibilities of a distributed ledger. Specifically, its facilitation of open access/ownership, decentralized governance, and the ability to harness globally-distributed resources of computing power and innovation within an incentivized framework.\r\n\r\n-An open-source repository of machine intelligence, accessible to anyone, anywhere, thus creating the conditions for open and permission-less innovation on a global internet scale.\r\n\r\n-Distribution of rewards and network ownership to users in direct proportion to the value they have added.",
    "explorerLink": "https://taostats.io/",
    "address": {},
    "website": "https://bittensor.com/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/taobittensor",
    "twitter": "https://twitter.com/opentensor",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/bittensor",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/28452/large/ARUsPeNQ_400x400.jpeg?1696527447",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 246714158,
    "high_24h": 401.57,
    "low_24h": 376.34,
    "price_change_24h": 21.23,
    "price_change_percentage_24h": 5.62673,
    "market_cap_change_24h": 194830131,
    "market_cap_change_percentage_24h": 5.49894,
    "circulating_supply": 9387445,
    "total_supply": 21000000,
    "max_supply": 21000000,
    "last_updated": "2025-07-12T02:04:18.170Z",
    "platforms": {}
  },
  "bcf7ac399e5b3c4a": {
    "name": "Dai",
    "symbol": "dai",
    "price": 1,
    "livePrice": {
      "value": 1,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=dai&vs_currencies=usd"
    },
    "rank": 39,
    "cap": 3626476244,
    "addedDate": "1752285935646",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "MakerDAO has launched Multi-collateral DAI (MCD). This token refers to the new DAI that is collaterized by multiple assets.\r\n",
    "explorerLink": "https://etherscan.io/token/0x6b175474e89094c44da98b954eedeac495271d0f",
    "address": {
      "ethereum": "0x6b175474e89094c44da98b954eedeac495271d0f"
    },
    "website": "https://makerdao.com/",
    "reddit": "https://www.reddit.com/r/MakerDAO",
    "telegram": "https://t.me/makerdaoOfficial",
    "twitter": "https://twitter.com/SkyEcosystem",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/9956/large/Badge_Dai.png?1696509996",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 138924708,
    "high_24h": 1,
    "low_24h": 0.999613,
    "price_change_24h": 0.00024445,
    "price_change_percentage_24h": 0.02445,
    "market_cap_change_24h": -23220843.345816,
    "market_cap_change_percentage_24h": -0.63624,
    "circulating_supply": 3626100123.70166,
    "total_supply": 3626100123.70166,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:04:45.709Z",
    "platforms": {
      "ethereum": "0x6b175474e89094c44da98b954eedeac495271d0f"
    }
  },
  "a7191c72320bab65": {
    "name": "Pi Network",
    "symbol": "pi",
    "price": 0.47128,
    "livePrice": {
      "value": 0.47128,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=pi-network&vs_currencies=usd"
    },
    "rank": 40,
    "cap": 3616830862,
    "addedDate": "1752285950710",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "What Is Pi Network?\r\nPi Network is a social cryptocurrency, developer platform, and ecosystem designed for widespread accessibility and real-world utility. It enables users to mine and transact Pi using a mobile-friendly interface while supporting applications built within its blockchain ecosystem.\r\n\r\nSupply Model and Mining Mechanism\r\nThe Maximum Supply of Pi is 100 billion tokens. The Maximum Supply is comprised of the following: 65 Billion tokens (or 65%) are allocated for all community mining rewards; 10 billion (10%) are allocated for foundation reserves; 5 billion (5%) are allocated for liquidity purposes; and 20 billion (20%) are allocated for the Core Team. Each allocation mentioned above tracks the community Migrated Mining Rewards issuance pace, so the proportions of each allocation in the total supply remains the same at any given time. \r\n\r\nThe Effective Total Supply of Pi—the total Pi supply at the current time—allocates Pi proportionally the same as the Maximum Supply. Since every allocation tracks the Migrated Mining Rewards of the community, the Effective Total Supply can be calculated by dividing the current Migrated Mining Rewards of Pi on the Mainnet blockchain by 65%. The other allocations within the Effective Total Supply can then be calculated based on the same proportions as the Maximum Supply, e.g. at most 10% of the Effective Total Supply is available in the foundation reserve, 5% of the Effective Total Supply is available for liquidity purposes, and 20% of the Effective Total Supply is available for the Core Team. This remains true despite the fact that all tokens were minted at the genesis as technically required by the blockchain protocol.\r\n\r\nCirculating Supply includes all Migrated Mining Rewards and all tokens that entered circulation from other buckets of the allocations, which at its maximum could be summed up to equal the Effective Total Supply. \r\n\r\nPi’s mining rewards are distributed based on an issuance formula that follows a declining exponential model defined in the Pi whitepaper. Users can increase the amount of mining rewards they receive based on their individual contributions to the network, like Security Circles, using utility-based Pi apps, running Nodes, etc. For each month, the amount of Pi to be distributed as mobile balance is capped and determined by the model, regardless of how many people or how many types of mining rewards there are during the month. The capping is achieved by the design of a system-wide base mining rate, and each type of mining rewards to each individual are just a multiplier of this base mining rate. As the monthly supplies always diminish, the base mining rate generally decreases over time. \r\n\r\nFewer Pi may also be issued because the real Pi issuance on the blockchain depends on Pioneers passing KYC and completing all steps required for migration to the Mainnet. Despite all efforts to facilitate and remind Pioneers to complete those required steps, there are always dropoffs along the way, resulting in less than all outstanding mobile balances to be issued on the blockchain. Because of this mechanism, the community issued amount (Migrated Mining Rewards) on the blockchain will likely be closer and closer to a line lower than the 65 billion. This is thus the reason for the variable Effective Total Supply which incorporates this effect. Effective Total Supply results from all Migrated Mining Rewards divided by 65%, as opposed to the Maximum Supply of 100 billion.\r\n\r\nEcosystem and Adoption\r\nPi Network has built an integrated ecosystem that facilitates real-world transactions and decentralized applications. Pi can be used as a medium of exchange for goods and services, including online commerce and local brick-and-mortar businesses.\r\n\r\nUsers can engage with Core Team and community-built apps in the Pi ecosystem through the Pi Browser, where integrated features like the Pi Wallet provide a seamless experience. Events like PiFest 2024 showcased Pi’s growing adoption, with over 27,000 active sellers and 28,000 test merchants across 160 countries.\r\n\r\nWho Are the Founders of Pi Network?\r\nPi Network was founded by Dr. Nicolas Kokkalis and Dr. Chengdiao Fan, both of whom have PhDs from Stanford University and a passion for improving human lives through technology.\r\n\r\nDr. Nicolas Kokkalis is a Stanford PhD in EE and postdoc in CS with research on distributed systems and human-computer interaction. His work focuses on combining distributed systems and human computer interaction to bring cryptocurrency to everyday people. As a strong and long-term believer of the technical, financial and social potential of cryptocurrencies, he is determined to move them beyond their current limitations and is committed to bringing the power of blockchain to more people.\r\n\r\nDr. Chengdiao Fan holds a Stanford PhD in Anthropological Sciences, harnessing social computing to unlock human potential on a global scale. Chengdiao is building Pi Network to mobilize individuals all over the world to participate and be rewarded for their contributions, and establish an inclusive ecosystem for global citizens to unleash and capture their own agency, and in turn create utilities and productions for society and the world.\r\n\r\nCompliance and Identity Verification\r\nPi Network follows a one-account-per-person policy through its Know Your Customer (KYC) solution. This system combines machine automation and human verification to authenticate user identities while preserving privacy.\r\n\r\nThe KYC process emphasizes real individuals, combats fraudulent activities and enables fair participation in the mining process of the network. Pi’s identity verification approach balances scalability, security, and accessibility, allowing millions of users worldwide to validate their accounts while maintaining regulatory compliance.",
    "explorerLink": "https://blockexplorer.minepi.com/mainnet/",
    "address": {},
    "website": "https://minepi.com/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/PiCoreTeam",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/54342/large/pi_network.jpg?1739347576",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 240005330,
    "high_24h": 0.525776,
    "low_24h": 0.463955,
    "price_change_24h": -0.0363205282401177,
    "price_change_percentage_24h": -7.15533,
    "market_cap_change_24h": -269138294.311907,
    "market_cap_change_percentage_24h": -6.9259,
    "circulating_supply": 7683003530.592672,
    "total_supply": 11819883468.59082,
    "max_supply": 100000000000,
    "last_updated": "2025-07-12T02:04:48.560Z",
    "platforms": {}
  },
  "c3adf4e49e00cf8a": {
    "name": "Cronos",
    "symbol": "cro",
    "price": 0.10833,
    "livePrice": {
      "value": 0.10833,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=crypto-com-chain&vs_currencies=usd"
    },
    "rank": 41,
    "cap": 3325094671,
    "addedDate": "1752285965892",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "2018-11-14",
    "token": true,
    "description": "We propose Crypto.com Chain, the next generation decentralized mobile payment protocol, the most efficient and secure way to pay and be paid in crypto, anywhere, any crypto\r\nwithout fees. Crypto.com Chain will deliver on its vision by developing innovative technology components and processes (inc. scalable encryption algorithm to protect users’ privacy, utilizing trusted execution environments, sustainable price stability mechanisms, user protection via PoGSD) catered specifically to cryptocurrency payment, while leveraging proven blockchain technology structural design elements. ",
    "explorerLink": "https://etherscan.io/token/0xa0b73e1ff0b80914ab6fe0444e65848c4c34450b",
    "address": {
      "ethereum": "0xa0b73e1ff0b80914ab6fe0444e65848c4c34450b"
    },
    "website": "https://cronos-pos.org/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/Cronos_POS_Announcements",
    "twitter": "https://twitter.com/cronos_chain",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/cronos",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/7310/large/cro_token_logo.png?1696507599",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 76417526,
    "high_24h": 0.108285,
    "low_24h": 0.096702,
    "price_change_24h": 0.01120804,
    "price_change_percentage_24h": 11.54021,
    "market_cap_change_24h": 294874314,
    "market_cap_change_percentage_24h": 9.73112,
    "circulating_supply": 31135012977.33425,
    "total_supply": 97834976860.5095,
    "max_supply": 100000000000,
    "last_updated": "2025-07-12T02:05:56.875Z",
    "platforms": {
      "ethereum": "0xa0b73e1ff0b80914ab6fe0444e65848c4c34450b"
    }
  },
  "e62443e0f32753ad": {
    "name": "Aptos",
    "symbol": "apt",
    "price": 4.9,
    "livePrice": {
      "value": 4.9,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=aptos&vs_currencies=usd"
    },
    "rank": 42,
    "cap": 3166443594,
    "addedDate": "1752285980994",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "aptos",
    "launchDate": "",
    "token": true,
    "description": "Aptos is a new, independent high-performance PoS Layer 1 project focused on delivering the safest and most scalable Layer 1 blockchain in the world. The Aptos blockchain leverages the Move programming language and the Move VM for application development, which are created and optimized for blockchain use cases.The team is comprised of the original creators, researchers, designers, and builders of Diem, the blockchain that was first built to serve this purpose. Aptos raised $200m from a16z, Multicoin, Binance and others. Aptos launched Devnet in mid March, incentivized testnet in late May and targets Q3 for mainnet launch. ",
    "explorerLink": "https://aptscan.ai/",
    "address": {
      "aptos": "0x1::aptos_coin::AptosCoin"
    },
    "website": "https://aptosfoundation.org",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/AptosTG",
    "twitter": "https://twitter.com/Aptos_Network",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/aptosnetwork",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/26455/large/aptos_round.png?1696525528",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 340434234,
    "high_24h": 5.08,
    "low_24h": 4.8,
    "price_change_24h": -0.001919173798656,
    "price_change_percentage_24h": -0.03911,
    "market_cap_change_24h": -735622.459344,
    "market_cap_change_percentage_24h": -0.02323,
    "circulating_supply": 645696662.5971426,
    "total_supply": 1153778112.748178,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:05:55.682Z",
    "platforms": {
      "aptos": "0x1::aptos_coin::AptosCoin"
    }
  },
  "187ce6b11e2b09e5": {
    "name": "Ethena Staked USDe",
    "symbol": "susde",
    "price": 1.18,
    "livePrice": {
      "value": 1.18,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ethena-staked-usde&vs_currencies=usd"
    },
    "rank": 44,
    "cap": 3118912411,
    "addedDate": "1752285996269",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etherscan.io/token/0x9d39a5de30e57443bff2a8307a4256c8797a3497",
    "address": {
      "ethereum": "0x9d39a5de30e57443bff2a8307a4256c8797a3497"
    },
    "website": "https://app.ethena.fi/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/ethena_labs",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/33669/large/sUSDe-Symbol-Color.png?1716307680",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 20857805,
    "high_24h": 1.18,
    "low_24h": 1.18,
    "price_change_24h": 0.000686,
    "price_change_percentage_24h": 0.05821,
    "market_cap_change_24h": 2946316,
    "market_cap_change_percentage_24h": 0.09456,
    "circulating_supply": 2645176593.982472,
    "total_supply": 2645176593.982472,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:06:31.740Z",
    "platforms": {
      "ethereum": "0x9d39a5de30e57443bff2a8307a4256c8797a3497"
    }
  },
  "9ec75053fe246086": {
    "name": "NEAR Protocol",
    "symbol": "near",
    "price": 2.53,
    "livePrice": {
      "value": 2.53,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=near&vs_currencies=usd"
    },
    "rank": 43,
    "cap": 3119001808,
    "addedDate": "1752286011436",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "",
    "token": true,
    "description": "NEAR Protocol is the blockchain for AI. A high-performance, AI-native platform built to power the next generation of decentralized applications and intelligent agents. It provides the infrastructure AI needs to transact, operate, and interact across Web2 and Web3. NEAR combines three core elements: User-Owned AI, which ensures agents act in users’ best interests; Intents and Chain Abstraction, which eliminate blockchain complexity for seamless, goal-driven transactions across chains; and a sharded blockchain architecture that delivers the scalability, speed, and low-cost execution needed for real-world AI and Web3 use. This integrated stack makes NEAR the foundation for building secure, user-owned, AI-native applications at internet scale.",
    "explorerLink": "https://nearblocks.io",
    "address": {
      "ethereum": "0x85f17cf997934a597031b2e18a9ab6ebd4b9f6a4"
    },
    "website": "https://near.org/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/cryptonear",
    "twitter": "https://twitter.com/nearprotocol",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.com/invite/zfhfRpaM4m",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/10365/large/near.jpg?1696510367",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 374947358,
    "high_24h": 2.63,
    "low_24h": 2.47,
    "price_change_24h": -0.007654697919119,
    "price_change_percentage_24h": -0.30158,
    "market_cap_change_24h": -7717615.471144,
    "market_cap_change_percentage_24h": -0.24683,
    "circulating_supply": 1232503578,
    "total_supply": 1259921603,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:06:04.159Z",
    "platforms": {
      "ethereum": "0x85f17cf997934a597031b2e18a9ab6ebd4b9f6a4"
    }
  },
  "bd030e09eccf18b2": {
    "name": "OKB",
    "symbol": "okb",
    "price": 48.92,
    "livePrice": {
      "value": 48.92,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=okb&vs_currencies=usd"
    },
    "rank": 45,
    "cap": 2934072972,
    "addedDate": "1752286026524",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "OKEx, the 2nd most popular cryptocurrency exchange by trading volume, launched its platform token ‘OKB‘ today with 10 trading pairs. On its official support page, OKEx describes OKB is a global utility token issued by the OK Blockchain Foundation. The total available supply of OKB will be one billion tokens (1,000,000,000), with a distribution model that allocates 60% of the supply will be given out to OKEx customers for community building and during marketing campaigns. According to OKEx, the company had officially issued OKB on ERC20 protocol earlier this month. \r\n\r\nThe company denied ICO (initial coin offering) and public fundraising. Reportedly the company had stated that it would be soon shifting the token to its official OK chain and subsequently it will be applied not only on OKEx’s platform but also on other related projects. There will be in total 1 billion tokens supplied globally out of which 600 million coins will be distributed to OKEx customers for community building and marketing campaigns. Rest will be locked up for a period of 1 year to 3 years.\r\n\r\nAccording to OKEx, the company had officially issued OKB on ERC20 protocol earlier this month. The company denied ICO (initial coin offering) and public fundraising. Reportedly the company had stated that it would be soon shifting the token to its official OK chain and subsequently it will be applied not only on OKEx’s platform but also on other related projects. There will be in total 1 billion tokens supplied globally out of which 600 million coins will be distributed to OKEx customers for community building and marketing campaigns. Rest will be locked up for a period of 1 year to 3 years.",
    "explorerLink": "https://www.oklink.com/en/okc/token/0xdf54b6c6195ea4d948d03bfd818d365cf175cfc2",
    "address": {
      "ethereum": "0x75231f58b43240c9718dd58b4967c5114342a86c",
      "okex-chain": "0xdf54b6c6195ea4d948d03bfd818d365cf175cfc2",
      "sora": "0x0080edc40a944d29562b2dea2de42ed27b9047d16eeea27c5bc1b2e02786abe9"
    },
    "website": "https://www.okx.com/okb",
    "reddit": "https://www.reddit.com/r/OKX/",
    "telegram": "https://t.me/OKXOfficial_English",
    "twitter": "https://twitter.com/okx",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/4463/large/WeChat_Image_20220118095654.png?1696505053",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 18227584,
    "high_24h": 50.29,
    "low_24h": 48.66,
    "price_change_24h": -0.23160115953713,
    "price_change_percentage_24h": -0.47116,
    "market_cap_change_24h": -17245764.583725,
    "market_cap_change_percentage_24h": -0.58434,
    "circulating_supply": 60000000,
    "total_supply": 235957685.3,
    "max_supply": 300000000,
    "last_updated": "2025-07-12T02:06:04.517Z",
    "platforms": {
      "ethereum": "0x75231f58b43240c9718dd58b4967c5114342a86c",
      "okex-chain": "0xdf54b6c6195ea4d948d03bfd818d365cf175cfc2",
      "sora": "0x0080edc40a944d29562b2dea2de42ed27b9047d16eeea27c5bc1b2e02786abe9"
    }
  },
  "52a5cc3e2cc78f22": {
    "name": "Internet Computer",
    "symbol": "icp",
    "price": 5.43,
    "livePrice": {
      "value": 5.43,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=internet-computer&vs_currencies=usd"
    },
    "rank": 46,
    "cap": 2903124237,
    "addedDate": "1752286041705",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "internet-computer",
    "launchDate": "",
    "token": true,
    "description": "Internet Computer (IC) is the world’s first blockchain that is capable of running at web speed at unrestrictive capacities. Built by the DFINITY Foundation, IC aims to recreate the web by supporting smart contract development at scale and changing the way people can interact using web services. Internet Computer aims to extend the public internet, so that it can be the world’s computing platform, in a decentralized manner. Internet Computer sets to revolutionalize the design of the crypto economy, with an aim to overhaul traditional software services. \r\n\r\nThe project was founded in October 2016 by Dominic WIllams and have raised a total of $121 million from investors such as Adreessen Horowitz, Polychain Capital, Multicoin Capital and such. On May 10, 2021, DFINITY launched the Internet Computer into the public domain, marking it a major milestone for ICP as it means the internet now functions as a decentralised global computer. This is marked by the release of all of the Internet Computer’s source code into the public domain, as well as ICP utility token that allows tens of thousands of community members to govern the Internet Computer network.\r\n\r\nICP is Internet Computer's native token. It plays three prominent roles:\r\n\r\n1. Network Governance: Users that participate in the governance will be rewarded with ICPI\r\n2. Production of Cycles for Compute: ICP can be converted into cycles where it is used as the transaction fee to access the network. Cycles are burned after used.\r\n3. Rewarding Users: ICP is used as the rewards to incentivize users to participate in the network such as securing the network.",
    "explorerLink": "https://dashboard.internetcomputer.org/canister/ryjl3-tyaaa-aaaaa-aaaba-cai",
    "address": {
      "internet-computer": "ryjl3-tyaaa-aaaaa-aaaba-cai"
    },
    "website": "https://internetcomputer.org/",
    "reddit": "https://www.reddit.com/r/dfinity/",
    "telegram": "https://t.me/+m8tiEFaaNR8xNjNl",
    "twitter": "https://twitter.com/dfinity",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/14495/large/Internet_Computer_logo.png?1696514180",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 94544583,
    "high_24h": 5.57,
    "low_24h": 5.29,
    "price_change_24h": -0.016907727327422,
    "price_change_percentage_24h": -0.31069,
    "market_cap_change_24h": -11666761.129919,
    "market_cap_change_percentage_24h": -0.40026,
    "circulating_supply": 535316174.1461513,
    "total_supply": 535316174.1461513,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:07:13.404Z",
    "platforms": {
      "internet-computer": "ryjl3-tyaaa-aaaaa-aaaba-cai"
    }
  },
  "8fe7c97c525d5181": {
    "name": "Jito Staked SOL",
    "symbol": "jitosol",
    "price": 198.64,
    "livePrice": {
      "value": 198.64,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=jito-staked-sol&vs_currencies=usd"
    },
    "rank": 47,
    "cap": 2861646524,
    "addedDate": "1752286057221",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "solana",
    "launchDate": "",
    "token": true,
    "description": "The first liquid staking derivative on Solana to include MEV rewards. Tracks the price of SOL while accruing staking and MEV rewards. Yield is accrued in the price so it will steadily appreciate vs. SOL.",
    "explorerLink": "https://solscan.io/token/J1toso1uCk3RLmjorhTtrVwY9HJ7X8V9yYac6Y7kGCPn",
    "address": {
      "solana": "J1toso1uCk3RLmjorhTtrVwY9HJ7X8V9yYac6Y7kGCPn",
      "neon-evm": "0xfa8fb7e3bd299b2a9693b1bfdcf5dd13ab57007e"
    },
    "website": "https://www.jito.network/",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/jito_sol",
    "insta": "",
    "youtube": "",
    "discord": "https://discord.gg/jitocommunity",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/28046/large/JitoSOL-200.png?1696527060",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 26726862,
    "high_24h": 203.94,
    "low_24h": 194.84,
    "price_change_24h": -1.0179333766134,
    "price_change_percentage_24h": -0.50984,
    "market_cap_change_24h": -18076363.440878,
    "market_cap_change_percentage_24h": -0.62771,
    "circulating_supply": 14408720.75470473,
    "total_supply": 14408720.75470473,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:07:34.811Z",
    "platforms": {
      "solana": "J1toso1uCk3RLmjorhTtrVwY9HJ7X8V9yYac6Y7kGCPn",
      "neon-evm": "0xfa8fb7e3bd299b2a9693b1bfdcf5dd13ab57007e"
    }
  },
  "68227e83e7698c68": {
    "name": "BlackRock USD Institutional Digital Liquidity Fund",
    "symbol": "buidl",
    "price": 1,
    "livePrice": {
      "value": 1,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=blackrock-usd-institutional-digital-liquidity-fund&vs_currencies=usd"
    },
    "rank": 49,
    "cap": 2826501175,
    "addedDate": "1752286072395",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etherscan.io/token/0x7712c34205737192402172409a8f7ccef8aa2aec",
    "address": {
      "ethereum": "0x7712c34205737192402172409a8f7ccef8aa2aec",
      "avalanche": "0x53fc82f14f009009b440a706e31c9021e1196a2f",
      "polygon-pos": "0x2893ef551b6dd69f661ac00f11d93e5dc5dc0e99",
      "aptos": "0x50038be55be5b964cfa32cf128b5cf05f123959f286b4cc02b86cafd48945f89",
      "solana": "GyWgeqpy5GueU2YbkE8xqUeVEokCMMCEeUrfbtMw6phr",
      "optimistic-ethereum": "0xa1cdab15bba75a80df4089cafba013e376957cf5",
      "arbitrum-one": "0xa6525ae43edcd03dc08e775774dcabd3bb925872"
    },
    "website": "https://www.blackrock.com/corporate",
    "reddit": "https://www.reddit.com",
    "telegram": "",
    "twitter": "https://twitter.com/BlackRock",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/36291/large/blackrock.png?1711013223",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 0,
    "high_24h": 1,
    "low_24h": 1,
    "price_change_24h": 0,
    "price_change_percentage_24h": 0,
    "market_cap_change_24h": -4680068.33,
    "market_cap_change_percentage_24h": -0.1653,
    "circulating_supply": 2826501175.033854,
    "total_supply": 2826501175.033854,
    "max_supply": 0,
    "last_updated": "2025-07-12T02:05:03.730Z",
    "platforms": {
      "ethereum": "0x7712c34205737192402172409a8f7ccef8aa2aec",
      "avalanche": "0x53fc82f14f009009b440a706e31c9021e1196a2f",
      "polygon-pos": "0x2893ef551b6dd69f661ac00f11d93e5dc5dc0e99",
      "aptos": "0x50038be55be5b964cfa32cf128b5cf05f123959f286b4cc02b86cafd48945f89",
      "solana": "GyWgeqpy5GueU2YbkE8xqUeVEokCMMCEeUrfbtMw6phr",
      "optimistic-ethereum": "0xa1cdab15bba75a80df4089cafba013e376957cf5",
      "arbitrum-one": "0xa6525ae43edcd03dc08e775774dcabd3bb925872"
    }
  },
  "b5a89bd6a40c138f": {
    "name": "Ondo",
    "symbol": "ondo",
    "price": 0.89931,
    "livePrice": {
      "value": 0.89931,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ondo-finance&vs_currencies=usd"
    },
    "rank": 48,
    "cap": 2835901868,
    "addedDate": "1752286087537",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "ethereum",
    "launchDate": "",
    "token": true,
    "description": "ONDO is a DeFi primitive that enables users to originate risk-isolated, fixed yield loans backed by yield-generating crypto-assets. It's unique because it's a permissionless protocol that allows users to interact on a peer-to-pool basis with no intermediaries.",
    "explorerLink": "https://etherscan.io/address/0xfaba6f8e4a5e8ab82f62fe7c39859fa577269be3",
    "address": {
      "ethereum": "0xfaba6f8e4a5e8ab82f62fe7c39859fa577269be3"
    },
    "website": "https://ondo.finance/",
    "reddit": "https://www.reddit.com",
    "telegram": "https://t.me/ondofinance",
    "twitter": "https://twitter.com/OndoFinance",
    "insta": "",
    "youtube": "",
    "discord": "",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/26580/large/ONDO.png?1696525656",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 288420923,
    "high_24h": 0.929654,
    "low_24h": 0.8735,
    "price_change_24h": 0.00055707,
    "price_change_percentage_24h": 0.06198,
    "market_cap_change_24h": -3886964.321463,
    "market_cap_change_percentage_24h": -0.13688,
    "circulating_supply": 3159107529,
    "total_supply": 10000000000,
    "max_supply": 10000000000,
    "last_updated": "2025-07-12T02:07:27.411Z",
    "platforms": {
      "ethereum": "0xfaba6f8e4a5e8ab82f62fe7c39859fa577269be3"
    }
  },
  "8fb30f8637d53619": {
    "name": "Ethereum Classic",
    "symbol": "etc",
    "price": 18.42,
    "livePrice": {
      "value": 18.42,
      "url": "https://api.coingecko.com/api/v3/simple/price?ids=ethereum-classic&vs_currencies=usd"
    },
    "rank": 50,
    "cap": 2811361787,
    "addedDate": "1752286102682",
    "coinMarketCap": true,
    "coingecko": true,
    "chain": "",
    "launchDate": "2015-07-30",
    "token": true,
    "description": "No description available",
    "explorerLink": "https://etc.tokenview.io/",
    "address": {},
    "website": "http://ethereumclassic.org",
    "reddit": "https://www.reddit.com/r/EthereumClassic",
    "telegram": "https://t.me/ETCnetwork",
    "twitter": "https://twitter.com/ETC_Network",
    "insta": "",
    "youtube": "",
    "discord": "https://ethereumclassic.org/discord",
    "coinLogo": "https://coin-images.coingecko.com/coins/images/453/large/ethereum-classic-logo.png?1696501717",
    "coingecko_rank": "",
    "coingecko_score": "",
    "developer_score": "",
    "community_score": "",
    "liquidity_score": "",
    "public_interest_score": "",
    "total_volume": 261367413,
    "high_24h": 18.82,
    "low_24h": 18.09,
    "price_change_24h": -0.05351582501851,
    "price_change_percentage_24h": -0.28973,
    "market_cap_change_24h": -7716263.299328,
    "market_cap_change_percentage_24h": -0.27372,
    "circulating_supply": 152670737.0544734,
    "total_supply": 152670737.0544734,
    "max_supply": 210700000,
    "last_updated": "2025-07-12T02:07:41.172Z",
    "platforms": {}
  }
}